{"News": {"US": {"RAMP": {"company_name": "LiveRamp Holdings, Inc.", "News 1": {"title": "Here's Why LiveRamp Holdings Is Soaring Today", "keywords": ["companys", "liveramp", "soaring", "share", "heres", "sales", "loss", "holdings", "liveramps", "quarter", "revenue", "subscription", "million", "today", "whatliveramp"], "publish_date": "2020-05-22", "url": "https://www.fool.com/investing/2020/05/22/heres-why-liveramp-holdings-is-soaring-today.aspx?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article&yptr=yahoo", "summary": "What happenedLiveRamp Holdings' (NYSE:RAMP) stock skyrocketed today after the company reported its fourth-quarter 2020 results.\nAs of 2:01 P.M. EST, the company's share price was up 25.4%.\nThe sales jump was fueled by the company's subscription revenue segment, which saw its sales spike 28% from the year-ago quarter.\nAdditionally, investors were likely impressed that LiveRamp's non-GAAP loss per share of $0.05 was better than analysts' estimate of a loss of $0.14 per share.\nSales climbed 33% compared to the prior year, to $381 million, and LiveRamp's all-important subscription sales popped 29%.", "text": "What happened  LiveRamp Holdings' (NYSE:RAMP) stock skyrocketed today after the company reported its fourth-quarter 2020 results. As of 2:01 P.M. EST, the company's share price was up 25.4%. So what  LiveRamp released its fourth-quarter results yesterday, with revenue increasing 35% year over year, to $105.7 million. The sales jump was fueled by the company's subscription revenue segment, which saw its sales spike 28% from the year-ago quarter. The segment now accounts for 79% of LiveRamp's total sales."}, "News 2": {"title": "LiveRamp (RAMP) Q4 2020 Earnings Call Transcript", "keywords": ["business", "liveramp", "earnings", "chief", "think", "strong", "ramp", "transcript", "2020", "customers", "data", "safe", "q4", "revenue", "president", "really"], "publish_date": "2020-05-22", "url": "https://www.fool.com/earnings/call-transcripts/2020/05/22/liveramp-ramp-q4-2020-earnings-call-transcript.aspx?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article&yptr=yahoo", "summary": "ETContents:Prepared RemarksQuestions and AnswersCall ParticipantsPrepared Remarks:OperatorGood afternoon, ladies and gentlemen, and welcome to LiveRamp's fiscal 2020 fourth-quarter earnings call.\nWe saw strong growth in third-party data sales in Q4 to support advanced television targeting and our consumer social program.\nMy words, Amazon got control of the knobs, really, really fast.\nWarren Jenson -- President and Chief Financial OfficerAnd then, Dan, the higher...James Arra -- President and Chief Commercial OfficerDan, this is...Warren Jenson -- President and Chief Financial OfficerJames, go ahead.\nScott Howe -- Chief Executive OfficerJames, do you want to...James Arra -- President and Chief Commercial OfficerStan, this is James.", "text": "LiveRamp (NYSE:RAMP)  Q4 2020 Earnings Call  , 4:30 p.m. ET  Contents:  Prepared Remarks  Questions and Answers  Call Participants  Prepared Remarks:  Operator  Good afternoon, ladies and gentlemen, and welcome to LiveRamp's fiscal 2020 fourth-quarter earnings call. As a reminder, this conference call is being recorded. I'd now like to turn the call over to your host, Lauren Dillard, chief communications officer. Lauren Dillard -- Chief Communications Officer  Thank you, operator."}, "News 3": {"title": "The LiveRamp Holdings, Inc. (NYSE:RAMP) Full-Year Results Are Out And Analysts Have Published New Forecasts", "keywords": ["forecasts", "fullyear", "latest", "liveramp", "price", "share", "nyseramp", "analysts", "revenues", "published", "expected", "past", "estimates", "holdings", "results"], "publish_date": "2020-05-24", "url": "https://finance.yahoo.com/news/liveramp-holdings-inc-nyse-ramp-133542407.html", "summary": "The investors in LiveRamp Holdings, Inc.'s (NYSE:RAMP) will be rubbing their hands together with glee today, after the share price leapt 27% to US$48.17 in the week following its yearly results.\nWhile revenues of US$381m were in line with analyst predictions, statutory losses were much smaller than expected, with LiveRamp Holdings losing US$1.84 per share.\nThe most optimistic LiveRamp Holdings analyst has a price target of US$63.00 per share, while the most pessimistic values it at US$25.00.\nSo it looks like LiveRamp Holdings is expected to grow at about the same rate as the wider industry.\nWe have forecasts for LiveRamp Holdings going out to 2025, and you can see them free on our platform here.", "text": "The investors in LiveRamp Holdings, Inc.'s (NYSE:RAMP) will be rubbing their hands together with glee today, after the share price leapt 27% to US$48.17 in the week following its yearly results. It looks like the results were pretty good overall. While revenues of US$381m were in line with analyst predictions, statutory losses were much smaller than expected, with LiveRamp Holdings losing US$1.84 per share. Earnings are an important time for investors, as they can track a company's performance, look at what the analysts are forecasting for next year, and see if there's been a change in sentiment towards the company. With this in mind, we've gathered the latest statutory forecasts to see what the analysts are expecting for next year."}, "News 4": {"title": "LiveRamp Announces Fourth Quarter and Fiscal Year Results", "keywords": ["liveramp", "nm", "operating", "fiscal", "announces", "loss", "cash", "compared", "quarter", "results", "revenue", "nongaap", "million", "prior", "fourth"], "publish_date": "2020-05-21", "url": "https://finance.yahoo.com/news/liveramp-announces-fourth-quarter-fiscal-200500974.html", "summary": "GAAP operating loss was $41 million compared to a GAAP operating loss of $82 million in the prior year period.\nNon-GAAP operating loss was $16 million compared to a non-GAAP operating loss of $22 million in the prior year period.\nGAAP loss per share from continuing operations was $0.07, and non-GAAP loss per share from continuing operations was $0.05.\nGAAP operating loss was $181 million compared to a GAAP operating loss of $198 million in the prior year.\nNon-GAAP operating loss was $64 million compared to a non-GAAP operating loss of $54 million in the prior year.", "text": "Total Q4 Revenue Up 35% — Subscription Revenue Up 28%  Repurchases $103 Million of Stock Since December 31, 2019  Strong Balance Sheet  LiveRamp® (NYSE: RAMP), the leading global data connectivity platform, today announced its financial results for the fourth quarter and fiscal year ended March 31, 2020. This press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200521005703/en/  Fourth Quarter Financial Highlights  Total revenue was $106 million, up 35% compared to the prior year period. Subscription revenue was $84 million, up 28% and contributed 79% of total revenue. Marketplace & Other revenue was $22 million, up 71%."}, "News 5": {"title": "LiveRamp Holdings, Inc. to Host Earnings Call", "keywords": ["financial", "liveramp", "earnings", "market", "2020", "investor", "information", "21", "wwwinvestornetworkcom", "holdings", "host", "york", "whats"], "publish_date": "2020-05-21", "url": "https://finance.yahoo.com/news/liveramp-holdings-inc-host-earnings-183000538.html", "summary": "NEW YORK, NY / ACCESSWIRE / May 21, 2020 / LiveRamp Holdings, Inc. (RAMP) will be discussing their earnings results in their 2020 Fourth Quarter Earnings call to be held on May 21, 2020 at 4:30 PM Eastern Time.\nAbout Investor NetworkInvestor Network (IN) is a financial content community, serving millions of unique investors market information, earnings, commentary and news on what's trending.\nDedicated to both the professional and the average traders, IN offers timely, trusted and relevant financial information for virtually every investor.\nIN is an Issuer Direct brand, to learn more or for the latest financial news and market information, visit www.investornetwork.com.\nSOURCE: Investor NetworkView source version on accesswire.com:https://www.accesswire.com/590771/LiveRamp-Holdings-Inc-to-Host-Earnings-Call", "text": "NEW YORK, NY / ACCESSWIRE / May 21, 2020 / LiveRamp Holdings, Inc. (RAMP) will be discussing their earnings results in their 2020 Fourth Quarter Earnings call to be held on May 21, 2020 at 4:30 PM Eastern Time. To listen to the event live or access a replay of the call - visit  https://www.investornetwork.com/event/presentation/63482  To receive updates for this company you can register by emailing info@investornetwork.com or by clicking get investment info from the company's profile. About Investor Network  Investor Network (IN) is a financial content community, serving millions of unique investors market information, earnings, commentary and news on what's trending. Dedicated to both the professional and the average traders, IN offers timely, trusted and relevant financial information for virtually every investor. IN is an Issuer Direct brand, to learn more or for the latest financial news and market information, visit www.investornetwork.com."}, "News 6": {"title": "Does LiveRamp Holdings, Inc. (NYSE:RAMP) Have A High Beta?", "keywords": ["liveramp", "market", "price", "stocks", "nyseramp", "high", "stock", "share", "holdings", "volatility", "ramps", "beta", "does"], "publish_date": "2020-05-21", "url": "https://finance.yahoo.com/news/does-liveramp-holdings-inc-nyse-135107381.html", "summary": "If you're interested in LiveRamp Holdings, Inc. (NYSE:RAMP), then you might want to consider its beta (a measure of share price volatility) in order to understand how the stock could impact your portfolio.\nCheck out our latest analysis for LiveRamp HoldingsWhat we can learn from RAMP's beta valueZooming in on LiveRamp Holdings, we see it has a five year beta of 1.27.\nWith a market capitalisation of US$2.5b, LiveRamp Holdings is a pretty big company, even by global standards.\nIt takes a lot of money to influence the share price of large companies like this one.\nThat makes it interesting to note that its share price has a history of sensitivity to market volatility.", "text": "If you're interested in LiveRamp Holdings, Inc. (NYSE:RAMP), then you might want to consider its beta (a measure of share price volatility) in order to understand how the stock could impact your portfolio. Volatility is considered to be a measure of risk in modern finance theory. Investors may think of volatility as falling into two main categories. The first category is company specific volatility. This can be dealt with by limiting your exposure to any particular stock."}, "no_of_news": 6, "plot_name": "/content/plots/RAMP.png"}, "PDD": {"company_name": "Pinduoduo Inc.", "News 1": {"title": "Why This Chinese E-Commerce Stock Is Skyrocketing While Other Chinese Tech Stocks Are Tanking", "keywords": ["pinduoduo", "growth", "stocks", "strong", "tanking", "stock", "revenue", "sales", "merchants", "pinduoduos", "skyrocketing", "quarter", "chinese", "ecommerce", "million", "tech"], "publish_date": "2020-05-25", "url": "https://www.fool.com/investing/2020/05/25/why-this-chinese-e-commerce-stock-is-surging-while.aspx?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article&yptr=yahoo", "summary": "Last week was a terrible one for Chinese tech stocks, as the U.S. Senate passed the Holding Foreign Companies Accountable Act (HFCA).\nPinduoduo's unique businessOn Friday, Pinduoduo reported its first-quarter earnings, sending shares up a whopping 14.5% on the day.\nAfter all, those are some big and growing net losses, and while a 44% revenue growth rate is nothing to sneeze at, that rate was well below the fourth quarter’s 91% growth.\nWhile the company didn’t disclose single quarter GMV growth, one analyst on the conference call put first quarter GMV growth at 99%.\nStill, Pinduoduo is probably not faking revenue, given the huge revenue deceleration during the quarter.", "text": "Last week was a terrible one for Chinese tech stocks, as the U.S. Senate passed the Holding Foreign Companies Accountable Act (HFCA). If passed by the House of Representatives and then signed into law, the new act could mean Chinese stocks will be delisted from U.S. exchanges, should companies choose not to adhere to the law’s new requirements. The new rules would include certifying that the company is not controlled by a foreign government and would also allow an American audit firm to certify any listed company’s financials. The swift and somewhat unexpected passage led most large-cap Chinese tech stocks to decline for the week -- with one very notable exception:  So, what did Pinduoduo (NASDAQ:PDD) do so right, where other big Chinese tech names faltered amid the renewed U.S.-China trade tensions? Pinduoduo's unique business  On Friday, Pinduoduo reported its first-quarter earnings, sending shares up a whopping 14.5% on the day."}, "News 2": {"title": "Alibaba Earnings Top Expectations In Difficult Coronavirus Conditions", "keywords": ["earnings", "stocks", "billion", "stock", "revenue", "buy", "difficult", "results", "quarter", "expectations", "reported", "coronavirus", "million", "conditions", "alibaba"], "publish_date": "2020-05-22", "url": "https://www.investors.com/news/technology/alibaba-earnings-q4-2020/?src=A00220&yptr=yahoo", "summary": "Alibaba (BABA) reported quarterly results before the market open Friday that beat estimates as total gross merchandise volume for the year hit a record $1 trillion.\nAlibaba stock fell.\nAlibaba Stock ActivityAlibaba stock dropped 5.9%, closing at 199.70 on the stock market today.\nOn Tuesday, Alibaba stock broke out above a 216.20 buy point in a cup with handle, then pulled back below that buy point.\nAlibaba stock remained just above its 50-day moving average.", "text": "Alibaba (BABA) reported quarterly results before the market open Friday that beat estimates as total gross merchandise volume for the year hit a record $1 trillion. Alibaba stock fell. X  The China e-commerce giant reported adjusted earnings of $1.30 per share, up from $1.28 a year earlier. Revenue grew 22% in local currency to $16.14 billion. Wall Street expected earnings of 85 cents on revenue of $15.1 billion."}, "News 3": {"title": "Pinduoduo Stock Jumps On Earnings Report", "keywords": ["pinduoduo", "company", "earnings", "stocks", "stock", "report", "volume", "open", "china", "revenue", "reported", "jumps", "million"], "publish_date": "2020-05-22", "url": "https://www.investors.com/news/technology/pinduoduo-earnings-q12020/?src=A00220&yptr=yahoo", "summary": "China e-commerce company Pinduoduo (PDD) reported mixed first-quarter results before the market open Friday, as gross merchandise volume doubled.\nPinduoduo stock rose.\nPinduoduo stock soared 14.5% to 68.70, a new closing high on the stock market today.\nFor the 12-month period ended March 31, Pinduoduo reported total gross merchandise volume of $163.4 billion, double that of the prior year.\nPinduoduo stock is up about 129% this year.", "text": "China e-commerce company Pinduoduo (PDD) reported mixed first-quarter results before the market open Friday, as gross merchandise volume doubled. Pinduoduo stock rose. X  The company reported an adjusted loss of 39 per share on revenue of $923.5 million. Wall Street expected an adjusted loss of 32 cents on revenue of $741 million. In addition, revenue climbed 44% in local currency."}, "News 4": {"title": "Here's Why Pinduoduo Stock Headed Higher on Friday", "keywords": ["pinduoduo", "higher", "stock", "heres", "buyers", "results", "quarter", "outbreak", "mau", "headed", "reported", "active", "million", "pinduoduos"], "publish_date": "2020-05-22", "url": "https://www.fool.com/investing/2020/05/22/heres-why-pinduoduo-stock-headed-higher-on-friday.aspx?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article&yptr=yahoo", "summary": "What happenedShares of Chinese e-commerce giant Pinduoduo (NASDAQ:PDD) headed higher on Friday after the company reported unaudited results for the first quarter of 2020.\nUndeterred, Pinduoduo reported strong quarterly revenue growth of 44% year over year, coming in at $924 million.\nPinduoduo distinguishes monthly average users (MAU) from active annual buyers.\nNow whatIn celebrating Pinduoduo's quarter, investors are shrugging off legislative news from earlier in the week.\nLegislators are wanting to require unaudited financial results, like those reported by Pinduoduo today, to be audited by third parties.", "text": "What happened  Shares of Chinese e-commerce giant Pinduoduo (NASDAQ:PDD) headed higher on Friday after the company reported unaudited results for the first quarter of 2020. As of 2:30 p.m. EDT, the stock had gone up 12%. Investors are celebrating Pinduoduo's across-the-board growth, despite the quarter running through the worst of the COVID-19 outbreak in China. After today's move, shares are trading near all-time highs. So what  Many U.S. companies have reported first-quarter results negatively impacted by the coronavirus."}, "News 5": {"title": "Pinduoduo Inc (PDD) Q1 2020 Earnings Call Transcript", "keywords": ["pinduoduo", "question", "earnings", "transcript", "users", "2020", "billion", "revenue", "platform", "q1", "merchants", "quarter", "online", "pdd", "gmv", "million"], "publish_date": "2020-05-22", "url": "https://www.fool.com/earnings/call-transcripts/2020/05/22/pinduoduo-inc-pdd-q1-2020-earnings-call-transcript.aspx?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article&yptr=yahoo", "summary": "ETContents:Prepared RemarksQuestions and AnswersCall ParticipantsPrepared Remarks:OperatorLadies and gentlemen, welcome to Pinduoduo First Quarter 2020 Earnings Conference Call.\nAs a platform serving over 600 million users, COVID-19 reminded us of how important PDD has become to our ecosystem of users, merchants and the business partners.\nAs a platform serving 628 million users in China and potentially more in the future.\nWe are building invaluable trust with our 628 million users and 5.1 million merchants in this time of crisis.\nSo through live streamings we are encouraging merchants to bring platform users into their day-to-day to share with them interesting [Indecipherable] parts about their products.", "text": "Pinduoduo Inc (NASDAQ:PDD)  Q1 2020 Earnings Call  , 7:30 a.m. ET  Contents:  Prepared Remarks  Questions and Answers  Call Participants  Prepared Remarks:  Operator  Ladies and gentlemen, welcome to Pinduoduo First Quarter 2020 Earnings Conference Call. [Operator Instructions] After the management's prepared remarks, there will be a Q&A session. [Operator Instructions]  I would now like to turn the conference over to your first speaker today, Mr. Nick Shu [Phonetic]. Please go ahead, sir."}, "News 6": {"title": "Alibaba Drops After Projecting Slowing Growth in Uncertain Times", "keywords": ["growth", "financial", "market", "drops", "billion", "yuan", "tmall", "alibabas", "uncertain", "sales", "times", "quarter", "slowing", "revenue", "projecting", "alibaba"], "publish_date": "2020-05-25", "url": "https://finance.yahoo.com/news/alibaba-drops-projecting-slowing-growth-020816738.html", "summary": "(Bloomberg) -- Alibaba Group Holding Ltd. slid after projecting revenue growth will slow this year, reflecting post-Covid 19 economic uncertainty at home as well as the potential for U.S.-Chinese tensions to disrupt its business.\nThe e-commerce giant forecast sales growth this year of at least 27.5% to more than 650 billion yuan ($91 billion), down from 35% previously and slightly below analysts’ estimates.\nWhile it posted a better-than-expected 22% rise in March quarter revenue of 114.3 billion yuan, that marked its slowest pace of expansion on record.\nChief Financial Officer Maggie Wu said Friday Alibaba’s financial statements have been consistently prepared in accordance with U.S. GAAP accounting measures and were beyond reproach.\nAlibaba’s March-quarter net income was 3.2 billion yuan, down 88% from a year ago when it booked an 18.7 billion yuan one-time gain on investments.", "text": "(Bloomberg) -- Alibaba Group Holding Ltd. slid after projecting revenue growth will slow this year, reflecting post-Covid 19 economic uncertainty at home as well as the potential for U.S.-Chinese tensions to disrupt its business. Its stock slid as much as 4% in Hong Kong Monday, after a drop of almost 6% in New York before the weekend. The e-commerce giant forecast sales growth this year of at least 27.5% to more than 650 billion yuan ($91 billion), down from 35% previously and slightly below analysts’ estimates. While it posted a better-than-expected 22% rise in March quarter revenue of 114.3 billion yuan, that marked its slowest pace of expansion on record. Online shopping began to bounce back from March, executives said Friday."}, "News 7": {"title": "Baidu Investors Fell Out of Love Years Ago", "keywords": ["company", "investors", "business", "baidu", "nasdaq", "fell", "ago", "opinion", "technology", "chinese", "li", "bloomberg", "love"], "publish_date": "2020-05-24", "url": "https://finance.yahoo.com/news/baidu-investors-fell-love-years-210003636.html", "summary": "(Bloomberg Opinion) -- Five years ago, Baidu Inc. founder and Chairman Robin Li sat down with Bloomberg News to explain how foreign investors were getting it wrong.\nAround the time that Li complained foreign investors weren’t getting it, some of his contemporaries decided to move home where they felt Chinese investors had a better understanding and would reward them with higher valuations.\nInvestors in China won’t assign a higher valuation to a returning company unless it has a convincing growth story to tell.\nBaidu was a pioneer when it listed on Nasdaq in 2005, paving the way for dozens of Chinese internet stocks to follow.\nNisha Gopalan is a Bloomberg Opinion columnist covering deals and banking.", "text": "(Bloomberg Opinion) -- Five years ago, Baidu Inc. founder and Chairman Robin Li sat down with Bloomberg News to explain how foreign investors were getting it wrong. Listed on the Nasdaq a decade earlier, shares of the Chinese search-engine provider had taken a beating over the prior year, and Li’s chief complaint was that Americans just didn’t appreciate the coming changes in its business. The trend in China was toward services like delivery and ride-hailing, as well as bookings for restaurants, beauty salons and doctors. This online-to-offline economy would eclipse search revenue, he predicted. Now, it seems that Li has lost patience."}, "no_of_news": 7, "plot_name": "/content/plots/PDD.png"}, "CUKPF": {"company_name": "Carnival Corporation & Plc", "News 1": {"title": "3 Travel and Tourism Stocks Poised for a Bull Run", "keywords": ["company", "tourism", "bull", "stocks", "billion", "travel", "industry", "according", "poised", "pandemic", "run", "carnival", "cruise"], "publish_date": "2020-05-25", "url": "https://www.fool.com/investing/2020/05/25/3-travel-and-tourism-stocks-poised-for-a-bull-run.aspx?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article&yptr=yahoo", "summary": "Here are three high-quality travel stocks that are poised for a bull run.\nWhile the other two, Carnival (NYSE:CCL) and Norwegian Cruise Line (NYSE:NCLH), are based on a rebound in cruise tourism.\nAll three stocks are set to soar as the travel industry bounces back from the pandemic.\nTakeawayThe travel and tourism industry is a high-risk, high-reward place to invest right now.\nOver the long-term, travel and tourism is a huge part of the U.S. economy -- contributing 7.8% of GDP in 2018.", "text": "Travel and tourism are arguably the hardest-hit sectors of the economy during the coronavirus pandemic as governments around the world have instituted lockdowns and travel restrictions to slow the spread of the deadly infection. But while the crisis is far from over, things should eventually get back to normal. And if you're confident in the industry's recovery, this might be the ideal opportunity to scoop up these stocks while they're still so cheap. Here are three high-quality travel stocks that are poised for a bull run. The first pick, Southwest Airlines (NYSE:LUV), is a bet on the resurgence of the U.S airline industry."}, "News 2": {"title": "Bottom Fishers Loading Up on Cruise Ship Stocks", "keywords": ["topped", "support", "loading", "stocks", "upper", "high", "alltime", "stock", "single", "ship", "secondary", "fishers", "cruise", "resistance"], "publish_date": "2020-05-22", "url": "https://www.investopedia.com/bottom-fishers-loading-up-on-cruise-ship-stocks-4845838?utm_campaign=quote-yahoo&utm_source=yahoo&utm_medium=referral&yptr=yahoo", "summary": "Bottom fishers have rounded the wagons on cruise ship stocks and are scooping up shares at a rapid pace, speculating that the industry will bounce back later this year and into 2021.\nTradingView.comRoyal Caribbean Cruises Ltd. (RCL) posted an all-time high at $135.65 in February 2018 and eased into a trading range with support in the upper $80s.\nUnlike Carnival, Royal Caribbean has broken just a single long-term support level, at the 2016 low in the mid-$60s.\nOBV has also lifted to an all-time high, but the company hasn't issued a secondary offering so far, instead relying on higher debt levels.\nThe Bottom LineBottom fishers are loading up on cruise ship stocks, betting on a recovery later this year and in 2021.", "text": "Bottom fishers have rounded the wagons on cruise ship stocks and are scooping up shares at a rapid pace, speculating that the industry will bounce back later this year and into 2021. Healthy advance bookings have underpinned this buying pressure, suggesting that Americans will return to their old travel habits as soon as possible. If true, positions taken at these depressed levels could pay off handsomely in coming quarters. However, there are no guarantees that these companies will survive, because secondary offerings and/or new loans are struggling to match high cash burn rates, raising the threat of bankruptcies in the fourth quarter and beyond. Cruise ship operators are currently targeting the second half of the third quarter for the resumption of operations, but that's equally dangerous because it will take just a single outbreak and quarantine to trigger a fresh wave of cancellations."}, "News 3": {"title": "Do Carnival Insiders Know Something We Should?", "keywords": ["company", "skies", "shares", "stock", "insiders", "future", "buy", "stake", "weisenburger", "know", "carnival", "million"], "publish_date": "2020-05-22", "url": "https://www.fool.com/investing/2020/05/22/do-carnival-insiders-know-something-we-should.aspx?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article&yptr=yahoo", "summary": "Well, some insiders are holding out hope — and one even made a $10 million bet on its future.\nOn April 6, Randall J. Weisenburger, Carnival Corporation Board Director since 2009, placed an order for 1.25 million of the company's stock, at $8 a share.\nThe PIF bought 43.5 million shares for about $348 million in cash.\nWhen big insiders and big governments seize an investment opportunity like this, the rest of us should take notice.\nBut at its current low share price, Carnival may still be worth at least a small to medium-sized position.", "text": "The COVID-19 pandemic has surely sunk Carnival Cruise Line (NYSE:CCL), right? There's no way the company could recover from the immense negative publicity and dockets filling with pending lawsuits, right? Well, some insiders are holding out hope — and one even made a $10 million bet on its future. Even the Kingdom of Saudi Arabia bought an 8.2% stake. Let's see whether these votes of confidence suggest that investors should start boarding."}, "News 4": {"title": "Air bridges not for now but should not rule out in future -UK interior minister", "keywords": ["summer", "solution", "bridges", "uk", "interior", "air", "travelwhen", "future", "minister", "writing", "patel", "rule", "today"], "publish_date": "2020-05-22", "url": "https://finance.yahoo.com/news/air-bridges-not-now-not-163854598.html", "summary": "LONDON, May 22 (Reuters) - Britain should not rule out the idea of so-called air bridges with countries who have low infection rates of COVID-19 in the future, interior minister Priti Patel said on Friday.\nThe British government said it would bring in a 14-day quarantine period for almost all international arrivals from June 8.\nAsked during the government's daily news conference about the prospect of Britons being able to go on a summer holiday abroad this year and whether air bridges could be part of the solution, Patel said: \"The foreign office advice is very clear, nothing but essential travel.\"\n\"When it comes to air bridges ... we should be absolutely open to all ideas, this is not for today but this doesn’t mean we should rule this out in the future,\" she said.\n(Reporting by Estelle Shirbon and Alistair Smout, Writing by Kylie MacLellan)", "text": "LONDON, May 22 (Reuters) - Britain should not rule out the idea of so-called air bridges with countries who have low infection rates of COVID-19 in the future, interior minister Priti Patel said on Friday. The British government said it would bring in a 14-day quarantine period for almost all international arrivals from June 8. Asked during the government's daily news conference about the prospect of Britons being able to go on a summer holiday abroad this year and whether air bridges could be part of the solution, Patel said: \"The foreign office advice is very clear, nothing but essential travel.\" \"When it comes to air bridges ... we should be absolutely open to all ideas, this is not for today but this doesn’t mean we should rule this out in the future,\" she said. (Reporting by Estelle Shirbon and Alistair Smout, Writing by Kylie MacLellan)"}, "News 5": {"title": "Markets are 'worried about intensifying the U.S., China dialogue': Expert", "keywords": ["company", "spelled", "struggled", "report", "dialogue", "intensifying", "expert", "struggle", "successfully", "strategic", "china", "words", "worried", "restructure", "transaction", "markets"], "publish_date": "2020-05-22", "url": "https://finance.yahoo.com/video/markets-worried-intensifying-u-china-144000377.html", "summary": "BusinessMotley FoolIn the company's most recent quarterly report on May 18, management pretty much spelled out that it will struggle to meet the covenants it needs to preserve its credit facilities, and it has struggled to refinance much of its debt that will come due in 2021.\nIn management's words: \"There can be no assurances that the company will be able to successfully restructure its indebtedness, improve its financial position, or complete any strategic transaction.\"\nIn addition, the company has said it has engaged consultants to look at financing alternatives.", "text": "Business  Motley Fool  In the company's most recent quarterly report on May 18, management pretty much spelled out that it will struggle to meet the covenants it needs to preserve its credit facilities, and it has struggled to refinance much of its debt that will come due in 2021. In management's words: \"There can be no assurances that the company will be able to successfully restructure its indebtedness, improve its financial position, or complete any strategic transaction.\" In addition, the company has said it has engaged consultants to look at financing alternatives."}, "News 6": {"title": "Carnival Is Hitting All the Branches of the Ugly Tree", "keywords": ["ccl", "risk", "ugly", "branches", "jobless", "stock", "industry", "claims", "work", "tree", "carnival", "cruise", "hitting", "consumers"], "publish_date": "2020-05-22", "url": "https://finance.yahoo.com/news/carnival-hitting-branches-ugly-tree-143644471.html", "summary": "As a result, CCL stock finds itself down more than 72% year-to-date.\nccl stock MoreSource: Ruth Peterkin / Shutterstock.comHowever, that kind of loss inevitably invites speculators and those who are rookies to the markets.\nSince early April, CCL stock has been steadily creeping higher as positive sentiment trickles in.\nMuch talk has been made of the latest jobless claims report, where 2.4 million have filed for unemployment benefits.\nSince jobless claims hit a peak around late March/early April, the number of people making claims has declined significantly.", "text": "To no one’s surprise, cruise liners like Carnival (NYSE:CCL, NYSE:CUK), Royal Caribbean Cruises (NYSE:RCL) and Norwegian Cruise Line (NYSE:NCLH) have been especially hurt by the novel coronavirus. At this point, they’re all interchangeable. However, Carnival is notable for its now notorious Diamond Princess ship, which became the face of the all-too-familiar quarantining protocol. As a result, CCL stock finds itself down more than 72% year-to-date. ccl stock More  Source: Ruth Peterkin / Shutterstock.com  However, that kind of loss inevitably invites speculators and those who are rookies to the markets."}, "News 7": {"title": "The Best Way to Bet on Carnival Stock as Hungry Bottom-Fishers Loom", "keywords": ["look", "bottomfishers", "business", "ccl", "chart", "loom", "stocks", "price", "hungry", "bet", "sideways", "stock", "best", "way", "carnival", "trading"], "publish_date": "2020-05-22", "url": "https://finance.yahoo.com/news/best-way-bet-carnival-stock-143102232.html", "summary": "The Best Way to Bet on CCL Stock as Hungry Bottom-Fishers Loom MoreSource: FlickrThe likes of Carnival and Royal Caribbean Cruises (NYSE:RCL) have been demolished amid a global pandemic.\nLooking at the CCL Stock ChartsCCL Stock Chart MoreSource: The thinkorswim® platform from TD AmeritradeThe gravity of the situation quickly settles in when we look at the weekly time frame.\nOn the price chart front, we need a breakout, preferably accompanied by high volume to confirm institutions are returning.\nThus far, the past two months appear nothing more than a short spurt of sideways consolidation for CCL stock.\ncarnival cruises stock chart 2 More", "text": "The steep discount in cruise line stocks like Carnival (NYSE:CCL) has bottom fishers everywhere itching to cast a line. Today we’re going to look at the signs that stability is returning to CCL stock and show how you can increase your odds of success by using options contracts. The Best Way to Bet on CCL Stock as Hungry Bottom-Fishers Loom More  Source: Flickr  The likes of Carnival and Royal Caribbean Cruises (NYSE:RCL) have been demolished amid a global pandemic. Who wants to take a trip on a ship which may or may not have the novel coronavirus haunting their halls? Not many."}, "no_of_news": 7, "plot_name": "/content/plots/CUKPF.png"}, "ICPT": {"company_name": "Intercept Pharmaceuticals, Inc.", "News 1": {"title": "ICPT Stock Dives On Unexpected Delay For NASH Treatment", "keywords": ["market", "oca", "fda", "dives", "stock", "data", "delay", "liver", "icpt", "treatment", "nash", "unexpected", "obeticholic"], "publish_date": "2020-05-22", "url": "https://www.investors.com/news/technology/icpt-stock-dives-unexpected-delay-nash-treatment/?src=A00220&yptr=yahoo", "summary": "An unexpected delay for Intercept Pharmaceuticals' (ICPT) liver-disease treatment led ICPT stock to crumble on Friday.\nChardan analyst Michael Morabito expects a short-term impact on ICPT stock.\nHe has a buy rating on ICPT stock.\nICPT Stock Dives On DelayNonalcoholic steatohepatitis, or NASH, is a potentially huge market for Intercept and any drugmaker that can successfully treat it.\nOn the stock market today, ICPT stock tumbled 12.2% to 80.51.", "text": "An unexpected delay for Intercept Pharmaceuticals' (ICPT) liver-disease treatment led ICPT stock to crumble on Friday. X  The Food and Drug Administration was tentatively set to discuss the benefits and risks of Intercept's obeticholic acid in patients with nonalcoholic steatohepatitis on June 9. But the FDA asked for additional information this week and postponed the meeting. Intercept says it expects to submit the new information this week. But that means the FDA will need additional time to look over the new data."}, "News 2": {"title": "Intercept Pharmaceuticals Shares Fall 13% After FDA Delays an Advisory Committee Meeting", "keywords": ["approval", "meeting", "13", "shares", "fda", "data", "pharmaceuticals", "fall", "advisory", "review", "nash", "committee", "treatment", "intercept", "delays", "drugs"], "publish_date": "2020-05-22", "url": "https://www.fool.com/investing/2020/05/22/intercept-pharmaceuticals-shares-fall-13-after-fda.aspx?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article&yptr=yahoo", "summary": "Shares of Intercept Pharmaceuticals (NASDAQ:ICPT) were down 13% at 3 p.m. EDT on Friday after the company disclosed that the Food and Drug Administration plans to postpone an advisory committee meeting to review obeticholic acid as a treatment for liver fibrosis due to nonalcoholic steatohepatitis (NASH).\nThe delay will likely cause the FDA to miss the agency's June 26 goal for completing its review of the marketing application.\nBut biotech investors are rightfully discounting the company's shares because the FDA requested additional data, which suggests that an approval isn't a slam dunk.\nThe agency typically holds advisory committee meetings for new drugs with new mechanisms of action.\nBut, in this case, the need for an advisory committee meeting is about the disease, NASH, which doesn't have any approved drugs to treat it.", "text": "Shares of Intercept Pharmaceuticals (NASDAQ:ICPT) were down 13% at 3 p.m. EDT on Friday after the company disclosed that the Food and Drug Administration plans to postpone an advisory committee meeting to review obeticholic acid as a treatment for liver fibrosis due to nonalcoholic steatohepatitis (NASH). The meeting had been tentatively scheduled for June 9, but Intercept plans to submit additional data requested by the FDA within the next week, so the agency wants to push back the meeting to give itself time to review the additional data. The delay will likely cause the FDA to miss the agency's June 26 goal for completing its review of the marketing application. By itself, the delayed approval, which shouldn't last more than a couple of months, doesn't justify a 13.6% decline in Intercept's valuation. But biotech investors are rightfully discounting the company's shares because the FDA requested additional data, which suggests that an approval isn't a slam dunk."}, "News 3": {"title": "Why Intercept Pharmaceuticals Is Plunging Today", "keywords": ["approval", "fda", "revenue", "pharmaceuticals", "ocaliva", "nash", "fibrosis", "treatment", "intercept", "plunging", "million", "today", "drug"], "publish_date": "2020-05-22", "url": "https://www.fool.com/investing/2020/05/22/why-intercept-pharmaceuticals-is-plunging-today.aspx?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article&yptr=yahoo", "summary": "Shares of Intercept Pharmaceuticals (NASDAQ:ICPT) are plunging on Friday after the company announced some bad news regarding its new drug application (NDA) for Ocaliva as a treatment for fibrosis (buildup of scar tissue) in the liver due to nonalcoholic steatohepatitis (NASH).\nToday Intercept announced that the FDA has decided to postpone this meeting indefinitely.\nThis decision by the FDA will delay the approval process for Ocaliva as a treatment for fibrosis due to NASH.\nThe pharma company estimates that there are about 19 million NASH patients in the U.S., and about 16 million of them suffer from fibrosis.\nEven with today's setback, though, Intercept looks likely to earn FDA approval for Ocaliva as a treatment for fibrosis due to NASH, and the company's losses on the market may represent an opportunity for investors.", "text": "What happened? Shares of Intercept Pharmaceuticals (NASDAQ:ICPT) are plunging on Friday after the company announced some bad news regarding its new drug application (NDA) for Ocaliva as a treatment for fibrosis (buildup of scar tissue) in the liver due to nonalcoholic steatohepatitis (NASH). Intercept's shares are down by 14.4% as of 11:34 a.m. today. So what  Intercept submitted an NDA to the U.S. Food and Drug Administration (FDA) for Ocaliva as a treatment for fibrosis due to NASH back in September 2019, and Ocaliva was granted priority review by the health industry regulator. Also, the FDA tentatively scheduled an advisory committee meeting regarding this application for June 9, 2020."}, "News 4": {"title": "Got $1,000? Here Are the Smartest ETFs to Buy and Hold for 5 Years", "keywords": ["etfs", "investors", "buying", "value", "market", "hold", "miners", "buy", "cloud", "computing", "gold", "smartest", "etf", "1000", "drug"], "publish_date": "2020-05-22", "url": "https://www.fool.com/investing/2020/05/22/got-1000-here-are-the-smartest-etfs-to-buy-and-hol.aspx?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article&yptr=yahoo", "summary": "Global X Cloud Computing ETFThough debatable, one of the more unstoppable industries in the years (or decades) to come will be cloud computing.\nThat's why the Global X Cloud Computing ETF (NASDAQ:CLOU) should be on your buy list.\nBut the payoff could be immense if cloud computing continues to grow by a hearty double-digit percentage for the foreseeable future.\nGenerally speaking, physical gold and gold miners perform their best toward the tail-end of a recession and early on during a recovery.\nHowever, since physical gold offers no yield, the smartest way to play this rise in value is by purchasing gold miners, or more specifically, the VanEck Vectors Gold Miners ETF.", "text": "For 11 years, it was relatively smooth sailing for investors. Following the March 2009 stock market bottom, all three major U.S. indexes ended up at least quadrupling in value, if not delivering even more robust returns. Then the coronavirus disease 2019 (COVID-19) pandemic came along and disrupted the economy, labor force, and stock market like nothing we'd ever seen before. Uncertainties tied to the coronavirus pushed the broad-based S&P 500 into bear market territory in just 17 trading sessions, marking the fastest decline into a bear market in history. Ultimately, the benchmark index fell 34% in a mere 33 calendar days before rebounding to where it is today."}, "News 5": {"title": "Intercept Provides Regulatory Update", "keywords": ["oca", "liver", "update", "intercept", "product", "ability", "including", "provides", "nash", "fibrosis", "candidates", "regulatory", "pbc"], "publish_date": "2020-05-22", "url": "https://finance.yahoo.com/news/intercept-provides-regulatory-120010620.html", "summary": "The FDA has indicated that it will reach out to Intercept in the near future with a new proposed AdCom date.\nIntercept now anticipates that the FDA’s review of its NDA will extend beyond the Prescription Drug User Fee Act (PDUFA) target action date of June 26, 2020.\nOCA has received Breakthrough Therapy designation from the FDA for the treatment of NASH patients with liver fibrosis.\nIn the United States, NASH is currently the second leading cause for liver transplantation overall, and in females, the leading cause.\nFounded in 2002 in New York, Intercept has operations in the United States, Europe and Canada.", "text": "NEW YORK, May 22, 2020 (GLOBE NEWSWIRE) -- Intercept Pharmaceuticals, Inc. (ICPT), a biopharmaceutical company focused on the development and commercialization of novel therapeutics to treat progressive non-viral liver diseases, today announced that based on discussions earlier this week, the U.S. Food and Drug Administration (FDA) has notified Intercept that its tentatively scheduled June 9, 2020 advisory committee meeting (AdCom) relating to the company’s new drug application (NDA) for obeticholic acid (OCA) for the treatment of liver fibrosis due to nonalcoholic steatohepatitis (NASH) has been postponed. The postponement will accommodate the review of additional data requested by the FDA that the company intends to submit within the next week. The FDA has indicated that it will reach out to Intercept in the near future with a new proposed AdCom date. Intercept now anticipates that the FDA’s review of its NDA will extend beyond the Prescription Drug User Fee Act (PDUFA) target action date of June 26, 2020. “While this delay was unanticipated, following our most recent dialogue with the FDA we believe that the additional data being submitted will be important in facilitating a more informed discussion at the AdCom,” said Mark Pruzanski, M.D., President and Chief Executive Officer of Intercept."}, "no_of_news": 5, "plot_name": "/content/plots/ICPT.png"}, "JOBS": {"company_name": "51job, Inc.", "News 1": {"title": "Why 51job Stock Dropped 12% Today", "keywords": ["unless", "stocks", "bill", "51job", "stock", "dropped", "appears", "law", "companies", "12", "chinese", "today"], "publish_date": "2020-05-22", "url": "https://www.fool.com/investing/2020/05/22/why-51job-stock-dropped-12-today.aspx?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article&yptr=yahoo", "summary": "What happenedShares of Chinese job search site 51job (NASDAQ:JOBS) closed trading down 12.1% on Friday.\nThere was no news today affecting 51job specifically.\nNo analysts downgraded 51job stock today, nor did anyone cut price targets on the stock.\nNo, it appears that the only reason 51job stock tumbled was that on Wednesday, the U.S. Senate passed a bill that could force Chinese stocks such as 51job to delist from U.S. stock exchanges.\nTechnically, they'd still own the stock -- but practically, they'd have no easy way to sell it after the law passes.", "text": "What happened  Shares of Chinese job search site 51job (NASDAQ:JOBS) closed trading down 12.1% on Friday. And you've got a problem with that, take it up with your senator. There was no news today affecting 51job specifically. The last time the company reported earnings was some two months ago, and the company's next earnings report isn't due out for another month. No analysts downgraded 51job stock today, nor did anyone cut price targets on the stock."}, "no_of_news": 1, "plot_name": "/content/plots/JOBS.png"}, "YY": {"company_name": "JOYY Inc.", "News 1": {"title": "JOYY Reports First Quarter 2020 Unaudited Financial Results", "keywords": ["million", "financial", "reports", "unaudited", "income", "period", "2020", "2019", "results", "quarter", "nongaap", "joyy", "net"], "publish_date": "2020-05-20", "url": "https://finance.yahoo.com/news/joyy-reports-first-quarter-2020-220010814.html", "summary": "First Quarter 2020 Financial HighlightsFirst Quarter 2020 Operational HighlightsMr. David Xueling Li, Chairman and Chief Executive Officer of JOYY, commented, “First and foremost, we would like to extend our sincere gratitude to our global teams.\nJOYY uses non-GAAP operating income, non-GAAP operating margin, non-GAAP net income attributable to controlling interest of JOYY Inc., non-GAAP net margin attributable to controlling interest of JOYY Inc., non-GAAP net income attributable to common shareholders of JOYY Inc., and basic and diluted non-GAAP net income per ADS, which are non-GAAP financial measures.\nNon-GAAP net margin is non-GAAP net income attributable to controlling interest of JOYY Inc. as a percentage of net revenues.\nAfter the non-GAAP reconciliation, non-GAAP net income attributable to controlling interests of JOYY Inc. is equal to the non-GAAP net income attributable to common shareholders of JOYY Inc.\n9 Non-GAAP net margin is non-GAAP net income attributable to controlling interest of JOYY Inc. as a percentage of net revenues.", "text": "GUANGZHOU, China, May 21, 2020 (GLOBE NEWSWIRE) -- JOYY Inc. (YY) (“JOYY” or the “Company,” formerly known as YY Inc.), a global video-based social media platform, today announced its unaudited financial results for the first quarter of 2020. First Quarter 2020 Financial Highlights  First Quarter 2020 Operational Highlights  Mr. David Xueling Li, Chairman and Chief Executive Officer of JOYY, commented, “First and foremost, we would like to extend our sincere gratitude to our global teams. Your resilience, ingenuity, and dedication have enabled us to continue delivering strong operating and financial results despite the global challenging macro environment due to the COVID-19 pandemic.”  Mr. Li continued, “During the first quarter, our dual-engine growth strategy of combining living streaming with short-form videos continued to produce good results across all of our business segments. Bigo Live, our global live streaming platform, achieved 37.8% year-over-year MAU growth with our continuous global expansion. Driven by the rapid growth of Bigo Live in the developed market, the live streaming revenues of Bigo segment increased 92.4% to RMB1,972.3 million (US$278.5 million) in the first quarter."}, "News 2": {"title": "Some JOYY (NASDAQ:YY) Shareholders Are Down 18%", "keywords": ["shareholders", "growth", "earnings", "market", "price", "share", "stocks", "nasdaqyy", "stock", "18", "revenue", "joyy"], "publish_date": "2020-05-19", "url": "https://finance.yahoo.com/news/joyy-nasdaq-yy-shareholders-down-162212392.html", "summary": "So we wouldn't blame long term JOYY Inc. (NASDAQ:YY) shareholders for doubting their decision to hold, with the stock down 18% over a half decade.\nWhile the share price declined over five years, JOYY actually managed to increase EPS by an average of 19% per year.\nIt is unusual to see such modest share price growth in the face of sustained EPS improvements.\nIn contrast to the share price, revenue has actually increased by 34% a year in the five year period.\nSo take a peek at this free list of interesting companies with past earnings growth (and further growth forecast).", "text": "For many, the main point of investing is to generate higher returns than the overall market. But every investor is virtually certain to have both over-performing and under-performing stocks. So we wouldn't blame long term JOYY Inc. (NASDAQ:YY) shareholders for doubting their decision to hold, with the stock down 18% over a half decade. More recently, the share price has dropped a further 12% in a month. This could be related to the recent financial results - you can catch up on the most recent data by reading our company report."}, "News 3": {"title": "Why Earnings Season Could Be Great for JOYY (YY)", "keywords": ["zacks", "earnings", "stocks", "estimate", "rank", "stock", "yy", "joyy", "season", "positive", "esp", "great"], "publish_date": "2020-05-19", "url": "https://finance.yahoo.com/news/why-earnings-season-could-great-123412829.html", "summary": "Investors are always looking for stocks that are poised to beat at earnings season and JOYY Inc. YY may be one such company.\nThat is because JOYY is seeing favorable earnings estimate revision activity as of late, which is generally a precursor to an earnings beat.\nThis suggests that analysts have very recently bumped up their estimates for YY, giving the stock a Zacks Earnings ESP of +2.52% heading into earnings season.\nA positive reading for the Zacks Earnings ESP has proven to be very powerful in producing both positive surprises, and outperforming the market.\nClearly, recent earnings estimate revisions suggest that good things are ahead for JOYY, and that a beat might be in the cards for the upcoming report.", "text": "Investors are always looking for stocks that are poised to beat at earnings season and JOYY Inc. YY may be one such company. The firm has earnings coming up pretty soon, and events are shaping up quite nicely for their report. That is because JOYY is seeing favorable earnings estimate revision activity as of late, which is generally a precursor to an earnings beat. After all, analysts raising estimates right before earnings — with the most up-to-date information possible — is a pretty good indicator of some favorable trends underneath the surface for YY in this report. In fact, the Most Accurate Estimate for the current quarter is currently at 61 cents per share for YY, compared to a broader Zacks Consensus Estimate of 60 cents per share."}, "no_of_news": 3, "plot_name": "/content/plots/YY.png"}, "F": {"company_name": "Ford Motor Company", "News 1": {"title": "Coronavirus update: U.S. death toll approaches 100,000 as CDC’s testing practices are criticized by health experts", "keywords": ["deaths", "company", "death", "criticized", "cases", "experts", "covid19", "practices", "update", "toll", "billion", "testing", "sales", "stores", "health", "pandemic", "cdcs", "revenue", "coronavirus", "million"], "publish_date": "2020-05-22", "url": "https://www.marketwatch.com/story/coronavirus-update-us-death-toll-approaches-100000-as-cdcs-testing-practices-are-criticized-by-health-experts-2020-05-22?siteid=yhoof2&yptr=yahoo", "summary": "Latest talliesThere are now 5.24 million cases of COVID-19 worldwide and at least 338,762 people have died, according to data aggregated by Johns Hopkins University.\nThe U.S. has the highest case toll in the world at 1.60 million and the highest death toll at 96,013.\nFrance has 182,015 cases and 28,218 deaths, while Germany has 179,776 cases and 8,256 deaths.\nTurkey has 154,500 cases and 4,276 deaths and Iran has 133,521 cases and 7,359 deaths.\nThe company expects full-year net income of $1.6 billion to $2.0 billion, compared with the FactSet consensus of $2.04 billion.", "text": "The U.S. death toll from the coronavirus that causes COVID-19 edged closer to 100,000 on Saturday, as the news emerged that the Centers for Disease Control and Prevention has been combining the results of two different types of tests for the illness in a move that has been sharply criticized by health experts. The CDC has been combining diagnostic test results, which show whether a patient currently has the virus, with antibody test results that measure whether someone has ever had the virus, the Atlantic magazine reported. The CDC confirmed the report to MarketWatch. “This is not merely a technical error,” the Atlantic wrote. “States have set quantitative guidelines for reopening their economies based on these flawed data points.”  The story cited Ashish Jha, the K. T. Li Professor of Global Health at Harvard and the director of the Harvard Global Health Institute, as saying the two tests provide totally different signals."}, "News 2": {"title": "Trump calls Dana Nessel the ‘Wacky Do Nothing Attorney General of Michigan’ — here’s how she is responding", "keywords": ["dana", "mask", "michigan", "leaders", "responding", "heres", "ford", "wear", "nessel", "state", "wacky", "trump", "general", "social", "attorney", "president", "calls"], "publish_date": "2020-05-22", "url": "https://www.marketwatch.com/story/trump-slams-the-wacky-do-nothing-attorney-general-of-michigan-heres-how-dana-nessel-is-responding-2020-05-22?siteid=yhoof2&yptr=yahoo", "summary": "The leaders of this swing state are swinging back at the president.\nTrump did not wear a mask for the photographed portion of the tour because “I didn’t want to give the press the pleasure of seeing it,” he said on Thursday.\nShe also warned that she planned to have a “very serious conversation” with Ford for bending the rules for the president.\nHe also claimed that automobile companies were leaving the state until he “came along,” and suggested that they might do so again if Nessel punishes Ford.\n“At least he actually managed to remember Dana’s name,” it added, noting Nessel will “continue to stand up to the commander-in-tweet on our behalf.”Gov.", "text": "The leaders of this swing state are swinging back at the president. Trump has been butting heads with Michigan leaders — namely the governor, the secretary of state and the attorney general, who are all female Democrats — which came to a head when the commander-in-chief visited a Detroit-area Ford F, +0.35% plant on Thursday, and only wore a state-mandated face mask for part of the tour. Attorney General Dana Nessel had written an open letter to the president earlier in the week noting that he had “a legal responsibility” to wear a face covering while visiting the Ypsilanti facility, as the social distancing guidance is not only a Ford company policy, but also a state law. Nessel also called it “a social and moral responsibility” for the POTUS to help prevent spreading the virus in a state that has seen more than 53,000 cases and 5,000 deaths from COVID-19. Trump did not wear a mask for the photographed portion of the tour because “I didn’t want to give the press the pleasure of seeing it,” he said on Thursday."}, "News 3": {"title": "GM truck production plans delayed by parts shortage: WSJ", "keywords": ["michigan", "shortage", "postponed", "workers", "wsj", "report", "parts", "production", "according", "plans", "gm", "truck", "delayed"], "publish_date": "2020-05-22", "url": "https://www.marketwatch.com/story/gm-truck-production-plans-delayed-by-parts-shortage-wsj-2020-05-22?siteid=yhoof2&yptr=yahoo", "summary": "A shortage of parts from Mexico is hampering the General Motors Co.'s plans to increase its production of pickup trucks, according to a report by The Wall Street Journal that cited a union official and other people familiar with the matter.\nGM has postponed plans to add more shifts due to the shortage, according to the report.\nThe auto maker doesn't yet have the flow of parts it needs to accelerate production as planned, and it has postponed plans to call back roughly 1,300 workers to factories in Indiana and Michigan.\nA spokesperson for GM told the newspaper that the company continues to plan \"to ramp up production in a gradual cadence,\" without discussing scheduling specifics.\nEarlier this week, Ford Motor Co. F, +0.35% halted production at two plants in Illinois and Michigan also for reasons related to the coronavirus pandemic.", "text": "A shortage of parts from Mexico is hampering the General Motors Co.'s plans to increase its production of pickup trucks, according to a report by The Wall Street Journal that cited a union official and other people familiar with the matter. GM has postponed plans to add more shifts due to the shortage, according to the report. The auto maker doesn't yet have the flow of parts it needs to accelerate production as planned, and it has postponed plans to call back roughly 1,300 workers to factories in Indiana and Michigan. A spokesperson for GM told the newspaper that the company continues to plan \"to ramp up production in a gradual cadence,\" without discussing scheduling specifics. Earlier this week, Ford Motor Co. F, +0.35% halted production at two plants in Illinois and Michigan also for reasons related to the coronavirus pandemic."}, "News 4": {"title": "Toyota, Nissan and Honda gear up for Mexico reboot after COVID-19 lockdowns", "keywords": ["rio", "gear", "safety", "covid19", "mexico", "lear", "workers", "toyota", "nissan", "industry", "motor", "told", "reboot", "honda", "coronavirus", "lockdowns"], "publish_date": "2020-05-25", "url": "https://finance.yahoo.com/news/toyota-nissan-honda-gear-mexico-200655395.html", "summary": "MEXICO CITY, May 25 (Reuters) - Japanese automakers Toyota, Nissan and Honda said they are gradually restarting in Mexico as the nation's automotive industry reboots in line with a broader economic reopening, despite still-high numbers of new coronavirus cases.\nMexican officials in mid-May said the automotive industry could exit the coronavirus lockdown before June 1 if approved safety measures were in place.\nToyota Motor Corp and Nissan Motor Co Ltd told Reuters on Monday that they were preparing to gradually resume operations, and Honda Motor Co Ltd last Friday said it had begun a gradual return to operations.\nThe plant had been the site of a coronavirus outbreak that Lear said killed 18 workers.\nIn a message directed at workers who had completed safety training, Lear offered a 300-peso ($13.30) bonus per 12-hour shift on Saturday and Sunday.", "text": "MEXICO CITY, May 25 (Reuters) - Japanese automakers Toyota, Nissan and Honda said they are gradually restarting in Mexico as the nation's automotive industry reboots in line with a broader economic reopening, despite still-high numbers of new coronavirus cases. Mexican officials in mid-May said the automotive industry could exit the coronavirus lockdown before June 1 if approved safety measures were in place. The three Japanese firms have yet to announce official re-launch dates. Toyota Motor Corp and Nissan Motor Co Ltd told Reuters on Monday that they were preparing to gradually resume operations, and Honda Motor Co Ltd last Friday said it had begun a gradual return to operations. Mexico has reported 68,620 total infections and 7,394 deaths since the pandemic reached the country in late February, prompting worries over re-opening the economy too soon."}, "News 5": {"title": "Hertz files for U.S. bankruptcy protection as car rentals evaporate in pandemic", "keywords": ["company", "car", "hertz", "vehicles", "creditors", "billion", "payments", "rental", "relief", "files", "evaporate", "bankruptcy", "pandemic", "companies", "protection", "rentals"], "publish_date": "2020-05-23", "url": "https://finance.yahoo.com/news/hertz-files-u-bankruptcy-protection-020317223.html", "summary": "Hertz said in a U.S. court filing on Friday that it voluntarily filed for Chapter 11 reorganization.\nA large portion of Hertz's revenue comes from car rentals at airports, which have all but evaporated as potential customers eschew plane travel.\nThe size of Hertz's lease obligations have increased as the value of vehicles declined because of the pandemic.\nHertz earlier signaled it could avoid bankruptcy if it received relief from creditors or financial aid the company and its competitors have sought from the U.S. government.\nEven before the pandemic, Hertz and its peers were under financial pressure as travelers shifted to ride-hailing services such as Uber.", "text": "NEW YORK, May 22 (Reuters) - The more than a century old car rental firm Hertz Global Holdings Inc filed for bankruptcy protection on Friday after its business all but vanished during the coronavirus pandemic and talks with creditors failed to result in needed relief. Hertz said in a U.S. court filing on Friday that it voluntarily filed for Chapter 11 reorganization. Its international operating regions including Europe, Australia and New Zealand were not included in the U.S. proceedings. The firm, whose largest shareholder is billionaire investor Carl Icahn, is reeling from government orders restricting travel and requiring citizens to remain home. A large portion of Hertz's revenue comes from car rentals at airports, which have all but evaporated as potential customers eschew plane travel."}, "News 6": {"title": "Automaker trade opposes effort to freeze U.S. fuel efficiency standards", "keywords": ["opposes", "administration", "automakers", "effort", "efficiency", "fuel", "standards", "freeze", "legal", "trade", "major", "obama", "trump", "automaker", "increases", "far"], "publish_date": "2020-05-22", "url": "https://finance.yahoo.com/news/automaker-trade-opposes-effort-freeze-183000794.html", "summary": "By David ShepardsonWASHINGTON, May 22 (Reuters) - A group representing many major automakers on Friday said it was intervening in a lawsuit that says the Trump administration did not go far enough in weakening -- but not freezing -- Obama administration standards to revise fuel economy standards.\nIn March, the Trump administration said it would require 1.5% annual increases in efficiency through 2026 -- far weaker than the 5% increases in the discarded Obama era rules -- but abandoned its August 2018 proposal to freeze requirements at 2020 levels through 2026.\nThe Competitive Enterprise Institute (CEI) in April asked a federal appeals court to order the administration to reconsider its plan, saying it should have further reduced or frozen the requirements.\nThe Alliance for Automotive Innovation, which represents most major automakers, said Friday it opposed CEI's legal challenge.\nFive automakers -- including Ford Motor Co and Volkswagen AG -- that announced separate agreements with California on fuel economy standards in 2019 are not participating in the legal interevention.", "text": "By David Shepardson  WASHINGTON, May 22 (Reuters) - A group representing many major automakers on Friday said it was intervening in a lawsuit that says the Trump administration did not go far enough in weakening -- but not freezing -- Obama administration standards to revise fuel economy standards. In March, the Trump administration said it would require 1.5% annual increases in efficiency through 2026 -- far weaker than the 5% increases in the discarded Obama era rules -- but abandoned its August 2018 proposal to freeze requirements at 2020 levels through 2026. The Competitive Enterprise Institute (CEI) in April asked a federal appeals court to order the administration to reconsider its plan, saying it should have further reduced or frozen the requirements. The Alliance for Automotive Innovation, which represents most major automakers, said Friday it opposed CEI's legal challenge. Five automakers -- including Ford Motor Co and Volkswagen AG -- that announced separate agreements with California on fuel economy standards in 2019 are not participating in the legal interevention."}, "no_of_news": 6, "plot_name": "/content/plots/F.png"}, "GE": {"company_name": "General Electric Company", "News 1": {"title": "Death toll from Pakistan airliner crash 97, 2 survivors: authorities", "keywords": ["authorities", "syed", "death", "97", "team", "air", "crash", "toll", "passenger", "board", "raza", "survivors", "karachi", "pakistan", "aircraft", "airliner"], "publish_date": "2020-05-23", "url": "https://finance.yahoo.com/news/death-toll-pakistan-airliner-crash-091015128.html", "summary": "By Syed Raza HassanKARACHI, Pakistan, May 23 (Reuters) - The death toll from Friday's passenger aircraft crash in Pakistan's southern city of Karachi has been confirmed at 97 with two survivors, while no fatalities were reported from the dense residential neighbourhood where the aircraft crash-landed, authorities said on Saturday.\nSeconds before the crash, the pilot told air traffic controllers he had lost power from both engines, according to a recording posted on liveatc.net, a respected aviation monitoring website.\nThe team includes three members of the Aircraft Accident and Investigation Board and one from the Pakistan Air Force's safety board.\nFriday's crash is the worst air disaster in Pakistan since 2012, when a Bhoja Air passenger aircraft, a Boeing 737, crashed in Islamabad killing 127 people.\n(Reporting by Syed Raza Hassan; Writing by Gibran Peshimam; Editing by William Mallard)", "text": "By Syed Raza Hassan  KARACHI, Pakistan, May 23 (Reuters) - The death toll from Friday's passenger aircraft crash in Pakistan's southern city of Karachi has been confirmed at 97 with two survivors, while no fatalities were reported from the dense residential neighbourhood where the aircraft crash-landed, authorities said on Saturday. Pakistan International Airlines flight PK 8303, an Airbus A320, was flying from Lahore to Karachi with 99 people on board when it went down at about 2:45 p.m. (0945 GMT) while trying a second landing attempt. \"Final plane crash update: 66 bodies were brought to (Jinnah Postgraduate Medical Centre), 31 bodies were brought to Civil Hospital Karachi,\" the provincial health minister's media coordinator said in a communique, adding that there were no deaths confirmed on the ground. Rescue and debris clearing in the neighbourhood was still underway on Saturday. Seconds before the crash, the pilot told air traffic controllers he had lost power from both engines, according to a recording posted on liveatc.net, a respected aviation monitoring website."}, "News 2": {"title": "General Electric's (GE) Unit Receives Wind Turbine Contract", "keywords": ["company", "renewable", "contract", "onshore", "price", "electric", "receives", "turbine", "ge", "general", "wind", "free", "turbines", "unit", "electrics"], "publish_date": "2020-05-22", "url": "https://finance.yahoo.com/news/general-electrics-ge-unit-receives-143602234.html", "summary": "General Electric Company’s GE unit, GE Renewable Energy, yesterday announced that it has received a contract to supply onshore wind turbines to Powerica Ltd. Financial terms of the contract were not disclosed by the parties involved.\nInside the HeadlinesAs noted, GE Renewable Energy will supply 38 units of 2.7-132 onshore wind turbines to Powerica.\nOf these, 19 onshore wind turbines will be delivered at Powerica’s wind farm based in Rajkot while the rest will be supplied to Khambaliya wind farm.\nThe improvement was primarily driven by onshore wind turbine — including deliveries of 731 new unit and supply of 219 repower kit.\nGeneral Electric Company Price and ConsensusGeneral Electric Company Price and Consensus MoreGeneral Electric Company price-consensus-chart | General Electric Company QuoteThe company’s share price has decreased 45.4% in the past three months compared with a 19.7% decline recorded by the industry.", "text": "General Electric Company’s GE unit, GE Renewable Energy, yesterday announced that it has received a contract to supply onshore wind turbines to Powerica Ltd. Financial terms of the contract were not disclosed by the parties involved. It is worth noting here that General Electric’s share price increased 0.9% on May 21, eventually closing the trading session at $6.48. Powerica engages in providing power solutions for standby, prime power and conventional diesel-related applications. Also, it owns as many as 11 winds farms in Tamil Nadu and Gujarat. Inside the Headlines    As noted, GE Renewable Energy will supply 38 units of 2.7-132 onshore wind turbines to Powerica."}, "News 3": {"title": "Pakistan crash pilot sent Mayday with 'lost engines' -liveatc.net", "keywords": ["attempt", "mayday", "aircraft", "cleared", "liveatcnet", "crash", "controller", "lost", "engines", "land", "pakistan", "pilot", "sent", "second"], "publish_date": "2020-05-22", "url": "https://finance.yahoo.com/news/pakistan-crash-pilot-sent-mayday-121117299.html", "summary": "PARIS, May 22 (Reuters) - The pilot of a crashed Pakistan International Airlines jet sent a Mayday and told controllers the aircraft had lost power from both its engines on its second attempt to land, according to a recording posted on monitoring website liveatc.net.\nAfter the aircraft reportedly called off an earlier attempt to land and went around for a second attempt, a controller radioed the pilot of flight 8303 that he appeared to be turning left, suggesting he was off-course.\nThe pilot replied, \"We are returning back, sir, we have lost engines,\" and the controller cleared the plane to land on either of Karachi airport's two West-Southwest-facing runways.\nTwelve seconds later the pilot called \"Mayday, Mayday, Mayday\" and was again cleared to use either runway.\nThere was no further communication from the aircraft, reported to be an Airbus A320, according to the audio from liveatc.net, a respected source for in-flight recordings.", "text": "PARIS, May 22 (Reuters) - The pilot of a crashed Pakistan International Airlines jet sent a Mayday and told controllers the aircraft had lost power from both its engines on its second attempt to land, according to a recording posted on monitoring website liveatc.net. After the aircraft reportedly called off an earlier attempt to land and went around for a second attempt, a controller radioed the pilot of flight 8303 that he appeared to be turning left, suggesting he was off-course. The pilot replied, \"We are returning back, sir, we have lost engines,\" and the controller cleared the plane to land on either of Karachi airport's two West-Southwest-facing runways. Twelve seconds later the pilot called \"Mayday, Mayday, Mayday\" and was again cleared to use either runway. There was no further communication from the aircraft, reported to be an Airbus A320, according to the audio from liveatc.net, a respected source for in-flight recordings."}, "News 4": {"title": "China’s Got a New Plan to Overtake the U.S. in Tech", "keywords": ["huawei", "wireless", "investment", "chinas", "trillion", "including", "companies", "china", "infrastructure", "overtake", "plan", "tech"], "publish_date": "2020-05-21", "url": "https://finance.yahoo.com/news/china-got-plan-seize-world-210000297.html", "summary": "The new infrastructure initiative is expected to drive mainly local giants from Alibaba and Huawei to SenseTime Group Ltd. at the expense of U.S. companies.\nAs tech nationalism mounts, the investment drive will reduce China’s dependence on foreign technology, echoing objectives set forth previously in the Made in China 2025 program.\nSuch initiatives have already drawn fierce criticism from the Trump administration, resulting in moves to block the rise of Chinese tech companies such as Huawei.\n“Starting this year, we are really beginning to see the money flow through.”The tech investment push is part of a fiscal package waiting to be signed off by China’s legislature, which convenes this week.\nTech leaders including Pony Ma and Jack Ma are espousing the program.", "text": "(Bloomberg) --  Beijing is accelerating its bid for global leadership in key technologies, planning to pump more than a trillion dollars into the economy through the rollout of everything from wireless networks to artificial intelligence. In the masterplan backed by President Xi Jinping himself, China will invest an estimated $1.4 trillion over six years to 2025, calling on urban governments and private tech giants like Huawei Technologies Co. to lay fifth generation wireless networks, install cameras and sensors, and develop AI software that will underpin autonomous driving to automated factories and mass surveillance. The new infrastructure initiative is expected to drive mainly local giants from Alibaba and Huawei to SenseTime Group Ltd. at the expense of U.S. companies. As tech nationalism mounts, the investment drive will reduce China’s dependence on foreign technology, echoing objectives set forth previously in the Made in China 2025 program. Such initiatives have already drawn fierce criticism from the Trump administration, resulting in moves to block the rise of Chinese tech companies such as Huawei."}, "no_of_news": 4, "plot_name": "/content/plots/GE.png"}, "NCLH": {"company_name": "Norwegian Cruise Line Holdings Ltd.", "News 1": {"title": "Why Shares of Norwegian Cruise Line, Royal Caribbean, and Carnival All Jumped on Thursday", "keywords": ["rating", "caribbean", "royal", "line", "stocks", "shares", "price", "jumped", "target", "norwegian", "longterm", "carnival", "cruise"], "publish_date": "2020-05-21", "url": "https://www.fool.com/investing/2020/05/21/why-shares-of-norwegian-cruise-line-royal-caribbea.aspx?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article&yptr=yahoo", "summary": "What happenedVolatility continues to be the name of the game for cruise line stocks in May, and Thursday's trading is no different.\nToday, the catalyst for shares surging was a Credit Suisse analyst initiating relatively positive coverage on cruise line stocks.\nShares of Norwegian Cruise Line (NYSE:NCLH) jumped as much as 12.3%, Royal Caribbean (NYSE:RCL) was up 10.7% early in trading, and Carnival (NYSE:CCL) rose 6.9%.\nHe initiated Norwegian Cruise Line with an outperform rating and a $21 price target, Royal Caribbean with an outperform rating and a $67 price target, and Carnival with a $12 price target and a neutral rating.\nNow whatThe short-term driver of cruise line shares isn't something I would put much energy into as an investor.", "text": "What happened  Volatility continues to be the name of the game for cruise line stocks in May, and Thursday's trading is no different. Today, the catalyst for shares surging was a Credit Suisse analyst initiating relatively positive coverage on cruise line stocks. Shares of Norwegian Cruise Line (NYSE:NCLH) jumped as much as 12.3%, Royal Caribbean (NYSE:RCL) was up 10.7% early in trading, and Carnival (NYSE:CCL) rose 6.9%. Shares of the three companies were up 10.3%, 8%, and 4.8% respectively as of 12:40 p.m. EDT. So what  Cruise line stocks have generally been moving higher this week on optimism that the economy is going to get better and, by extension, cruises will resume operation sometime in 2020."}, "News 2": {"title": "Carnival Is Hitting All the Branches of the Ugly Tree", "keywords": ["ccl", "risk", "ugly", "branches", "jobless", "stock", "industry", "claims", "work", "tree", "carnival", "cruise", "hitting", "consumers"], "publish_date": "2020-05-22", "url": "https://finance.yahoo.com/news/carnival-hitting-branches-ugly-tree-143644471.html", "summary": "As a result, CCL stock finds itself down more than 72% year-to-date.\nccl stock MoreSource: Ruth Peterkin / Shutterstock.comHowever, that kind of loss inevitably invites speculators and those who are rookies to the markets.\nSince early April, CCL stock has been steadily creeping higher as positive sentiment trickles in.\nMuch talk has been made of the latest jobless claims report, where 2.4 million have filed for unemployment benefits.\nSince jobless claims hit a peak around late March/early April, the number of people making claims has declined significantly.", "text": "To no one’s surprise, cruise liners like Carnival (NYSE:CCL, NYSE:CUK), Royal Caribbean Cruises (NYSE:RCL) and Norwegian Cruise Line (NYSE:NCLH) have been especially hurt by the novel coronavirus. At this point, they’re all interchangeable. However, Carnival is notable for its now notorious Diamond Princess ship, which became the face of the all-too-familiar quarantining protocol. As a result, CCL stock finds itself down more than 72% year-to-date. ccl stock More  Source: Ruth Peterkin / Shutterstock.com  However, that kind of loss inevitably invites speculators and those who are rookies to the markets."}, "News 3": {"title": "2 Top Cruise Line Stocks to Buy and 1 to Avoid During the Coronavirus Crisis", "keywords": ["caribbean", "avoid", "demand", "analyst", "stocks", "line", "think", "chaiken", "crisis", "travel", "buy", "industry", "rcl", "credit", "coronavirus", "cruise"], "publish_date": "2020-05-22", "url": "https://finance.yahoo.com/news/2-top-cruise-line-stocks-110238376.html", "summary": "It has been anything but smooth sailing for the cruise industry.\nTo survive, cruise operators have gone into cash preservation mode, entering into liquidity enhancing credit agreements.\nHowever, five-star analyst Benjamin Chaiken, of Credit Suisse, has a more optimistic view of the industry.\nThe analyst does remind clients that not all cruise industry players are set to outperform, recommending that investors avoid one in particular.\nThe Credit Suisse analyst argues that part of the company’s strength is derived from the location in which it operates cruises.", "text": "It has been anything but smooth sailing for the cruise industry. The COVID-19 pandemic and the widespread travel restrictions have caused sailings to be suspended, sending shares to record lows. To survive, cruise operators have gone into cash preservation mode, entering into liquidity enhancing credit agreements. Against this backdrop, investors are hardly lining up to pull the trigger on names within this area of the market. However, five-star analyst Benjamin Chaiken, of Credit Suisse, has a more optimistic view of the industry."}, "News 4": {"title": "Why one analyst thinks now is the time to buy cruise stocks: Morning Brief", "keywords": ["thinks", "analyst", "months", "stocks", "think", "royal", "brief", "chaiken", "target", "buy", "credit", "norwegian", "vacation", "morning", "cruises", "cruise"], "publish_date": "2020-05-22", "url": "https://finance.yahoo.com/news/analyst-buy-cruise-stocks-morning-brief-100959799.html", "summary": "Friday, May 22, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m.\nAnd analysts at Credit Suisse led by Benjamin Chaiken think now is the time to Buy.\nCredit Suisse put a $67 price target on Royal shares, a $21 price target on Norwegian stock, and a $12 target on shares of Carnival.\nShares of Royal and Norwegian rose more than 8% on Thursday following the news; Carnival shares rose over 3%.\n“[Cruise stocks] are at all-time lows, and all three operators are now in cash preservation mode, having entered into liquidity enhancing credit agreements,” Chaiken writes.", "text": "Friday, May 22, 2020  Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. Subscribe  It’s all about value. When COVID-19 first became part of the national conversation in the U.S., no industry was tied more closely to the pandemic than the cruise business. As the CDC outlined in a late March briefing, more than 800 cases and 10 deaths had to at that point been associated with cruiseliners."}, "News 5": {"title": "How Getting Aboard Royal Caribbean Stock Makes Sense Following Earnings", "keywords": ["caribbean", "investors", "earnings", "aboard", "royal", "market", "makes", "sense", "shares", "stock", "operations", "good", "low", "rcl", "getting", "following"], "publish_date": "2020-05-22", "url": "https://finance.yahoo.com/news/getting-aboard-royal-caribbean-stock-090127026.html", "summary": "Yet shares of distressed Royal Caribbean (NYSE:RCL) have been left to drift in bearish technical waters.\nNow though and following earnings, is it time for investors to finally board RCL stock with an eye on calmer conditions ahead?\nHow Getting Aboard RCL Stock Makes Sense Following Earnings MoreSource: Laszlo Halasi / Shutterstock.comThe novel coronavirus and ensuing Covid-19 pandemic have been challenging to say the least for cruise line operator Royal Caribbean.\nRCL Stock Monthly Stock ChartSource: Charts by TradingViewOn the RCL price chart, investors electing to board the stock as an investment should be prepared for volatility.\nStill, it should be appreciated Royal Caribbean’s low is more than 50% beneath current prices.", "text": "A bullish market tide has been lifting most risk assets of late. Yet shares of distressed Royal Caribbean (NYSE:RCL) have been left to drift in bearish technical waters. Now though and following earnings, is it time for investors to finally board RCL stock with an eye on calmer conditions ahead? How Getting Aboard RCL Stock Makes Sense Following Earnings More  Source: Laszlo Halasi / Shutterstock.com  The novel coronavirus and ensuing Covid-19 pandemic have been challenging to say the least for cruise line operator Royal Caribbean. Not that it’s alone."}, "News 6": {"title": "Credit Suisse initiates Royal Caribbean, Norwegian Cruise Lines at outperform", "keywords": ["unmatched", "caribbean", "round", "thinks", "value", "royal", "suisse", "initiates", "credit", "norwegian", "industry", "lines", "outperform", "rating", "cruise", "sectors"], "publish_date": "2020-05-21", "url": "https://finance.yahoo.com/video/credit-suisse-initiates-royal-caribbean-204655698.html", "summary": "On Thursday, Credit Suisse analysts led by Benjamin Chaiken initiated coverage of the cruise line industry with an outperform rating of Royal Caribbean and Norwegian Cruise Lines, and a neutral rating of Carnival Corporation.\nThe firm thinks that while COVID-19 will likely have \"a lasting impact on the cruise industry, the unmatched value proposition of the product will be a driving force behind a recovery\".\nThe Final Round panel discusses the sector’s outlook.", "text": "On Thursday, Credit Suisse analysts led by Benjamin Chaiken initiated coverage of the cruise line industry with an outperform rating of Royal Caribbean and Norwegian Cruise Lines, and a neutral rating of Carnival Corporation. The firm thinks that while COVID-19 will likely have \"a lasting impact on the cruise industry, the unmatched value proposition of the product will be a driving force behind a recovery\". The Final Round panel discusses the sector’s outlook."}, "News 7": {"title": "American Airlines Stock Is Still Too Risky Despite Supposed Resurgence", "keywords": ["airlines", "resurgence", "measures", "supposed", "risky", "stock", "passengers", "despite", "travel", "american", "lines", "pandemic", "flying", "cruise", "funding"], "publish_date": "2020-05-21", "url": "https://finance.yahoo.com/news/american-airlines-stock-still-too-195511179.html", "summary": "With the exception of cruise lines, few have taken it on the chin the way airlines have.\nAAL Stock Is Still Too Risky Despite Supposed Resurgence MoreSource: GagliardiPhotography / Shutterstock.comAirlines and cruise lines are in a similar boat at the moment (pardon the pun).\nOn May 5, Norwegian Cruise Lines (NYSE:NCLH) publicly raised the possibility of bankruptcy.\nInvestorPlace - Stock Market News, Stock Advice & Trading TipsU.S. airlines have a huge problem that the cruise lines don’t.\nWhile cruise lines are docking their ships to wait out the storm, U.S. airlines must continue flying.", "text": "A number of industries have been absolutely pummeled by the novel coronavirus pandemic. With the exception of cruise lines, few have taken it on the chin the way airlines have. International and domestic air travel has plummeted, and the future of air travel looks far from promising. American Airlines (NASDAQ:AAL) shares have dropped by as much as 70% since February. That would make them tempting to buy on the cheap if there was a clear path to recovery."}, "no_of_news": 7, "plot_name": "/content/plots/NCLH.png"}, "BABA": {"company_name": "Alibaba Group Holding Limited", "News 1": {"title": "China asserts ‘strong dissatisfaction’ after U.S. expands tech blacklist for human rights abuses", "keywords": ["expands", "list", "kong", "hong", "security", "asserts", "abuses", "foreign", "commerce", "strong", "blacklist", "department", "human", "dissatisfaction", "china", "chinese", "rights", "tech"], "publish_date": "2020-05-25", "url": "https://www.marketwatch.com/story/china-asserts-strong-dissatisfaction-after-us-expands-tech-blacklist-for-human-rights-abuses-2020-05-25?siteid=yhoof2&yptr=yahoo", "summary": "China on Monday denounced a move by the U.S. Commerce Department to expand its so-called entity list of Chinese companies, which are restricted from doing business with U.S. firms, for alleged human rights abuses in the Xinjian Uighur Autonomous region.\nChina’s foreign ministry professed “strong dissatisfaction” with the decision in a briefing with reporters, according to Bloomberg News.\n“China will continue to take all necessary measures to safeguard the legitimate rights and interests of Chinese enterprises and safeguard national sovereignty, security and development interests.”Stocks in Asia China and Hong Kong closed modestly higher Monday, with the China CSI 000300, +0.78% gaining 0.1% and the Shanghai Composite Index SHCOMP, +0.70% rising 0.3%.\nHong Kong’s Hang Seng Index HSI, +1.87% finished up 0.1%, though it has fallen 6.9% in May, according to FactSet.\nRead more: ‘The worst nightmare is happening before our eyes,’ says democratic legislator after Beijing moves to impose security laws on Hong Kong", "text": "China on Monday denounced a move by the U.S. Commerce Department to expand its so-called entity list of Chinese companies, which are restricted from doing business with U.S. firms, for alleged human rights abuses in the Xinjian Uighur Autonomous region. China’s foreign ministry professed “strong dissatisfaction” with the decision in a briefing with reporters, according to Bloomberg News. See also: ‘It’s time for China to blink first,’ says Rep. Sherman, who leads the drive to delist China stocks  “We urge the United States to correct its mistakes, withdraw the relevant decisions, and stop interfering in China’s internal affairs,” said foreign ministry spokesman Zhao Lijian. “China will continue to take all necessary measures to safeguard the legitimate rights and interests of Chinese enterprises and safeguard national sovereignty, security and development interests.”  Stocks in Asia China and Hong Kong closed modestly higher Monday, with the China CSI 000300, +0.78% gaining 0.1% and the Shanghai Composite Index SHCOMP, +0.70% rising 0.3%. Hong Kong’s Hang Seng Index HSI, +1.87% finished up 0.1%, though it has fallen 6.9% in May, according to FactSet."}, "News 2": {"title": "‘It’s time for China to blink first,’ says Rep. Sherman, who leads the drive to delist China stocks", "keywords": ["drive", "financial", "rep", "stocks", "bill", "foreign", "investor", "delist", "companies", "leads", "china", "blink", "securities", "chinese", "sherman", "markets"], "publish_date": "2020-05-23", "url": "https://www.marketwatch.com/story/its-time-for-china-to-blink-first-says-rep-sherman-who-is-the-leading-push-for-china-delisting-bill-2020-05-23?siteid=yhoof2&yptr=yahoo", "summary": "The bill would require that foreign companies let the Public Company Accounting Oversight Board oversee the auditing of their financial records if they want to raise money by selling stocks or bonds to the American public.\nAll U.S. companies and most foreign entities already work with the PCAOB in this way, but Chinese companies do not.\nThat bill was never intended to exempt foreign countries, Sherman said, but the financial-services industry lobbied to list companies from China, the world’s fastest-growing large economy.\n“The goal here is to demand that China do what every other country has done,” he said.\n“That is to make sure that if they’re tapping into U.S. capital markets, they do it under U.S. capital-market rules.”", "text": "The time has long passed for Washington to force Chinese companies to provide the same investor protections that U.S. companies have for decades, says Democratic Rep. Brad Sherman of California, who is leading the effort in the House of Representatives to force Chinese companies to submit to U.S. securities laws, or be barred from raising money in U.S. financial markets. “The purpose here is not to delist or de-register; it’s to demand that China do what every other country has done and agree that if their companies want to participate in U.S. capital markets, they agree to live by U.S. capital-markets rules,” Sherman argued in an interview with MarketWatch. “It’s time for China to blink first for the benefit of investors.”  See also:An emerging-market debt crisis could be the next front in U.S.-China conflict  Sherman introduced a House version of the Holding Foreign Companies Accountable Act Wednesday night, after the bill passed the Republican-controlled Senate earlier in the day with unanimous support. The bill would require that foreign companies let the Public Company Accounting Oversight Board oversee the auditing of their financial records if they want to raise money by selling stocks or bonds to the American public. All U.S. companies and most foreign entities already work with the PCAOB in this way, but Chinese companies do not."}, "News 3": {"title": "Food Delivery Giant Meituan’s Sales Beat Estimates", "keywords": ["meituans", "business", "food", "giant", "billion", "profitability", "delivery", "travel", "sales", "estimates", "beat", "service", "meituan", "reported"], "publish_date": "2020-05-26", "url": "https://finance.yahoo.com/news/food-delivery-giant-meituan-sales-093019414.html", "summary": "That surge came after Meituan reported better-than-expected sales of 16.8 billion yuan ($2.4 billion) in the three months ended March.\nBacked by Tencent Holdings Ltd., Meituan’s sprawling services from food delivery to in-store dining and hotel booking were among the most vulnerable to nationwide shutdowns.\nIn food delivery, the “long run potential is still there and the profitability level can be much higher” after the company pushes advertising, they added.\nLonger term, the internet services giant will have to grapple with China’s worsening economy, which may further dent consumer spending.\nMeituan reported a lower-than-projected net loss of 1.58 billion yuan, but that was after three successive quarters of profit.", "text": "(Bloomberg) -- Meituan Dianping’s shares soared after it reported a smaller than expected 13% slide in revenue that drove hopes the world’s largest meal delivery business is starting to recover as China emerges from Covid-19 lockdowns. Its shares climbed as much as 9.7%, extending strong gains since China began to return to normal in mid-March and propelling Meituan’s market value to more than $100 billion. That surge came after Meituan reported better-than-expected sales of 16.8 billion yuan ($2.4 billion) in the three months ended March. Morgan Stanley and CICC were among the brokerages that lifted their targets on Meituan, citing resilience across business lines and easing competition. Backed by Tencent Holdings Ltd., Meituan’s sprawling services from food delivery to in-store dining and hotel booking were among the most vulnerable to nationwide shutdowns."}, "News 4": {"title": "Hong Kong Finance Has a Security Blanket", "keywords": ["kong", "investors", "hong", "kongs", "finance", "stock", "alibaba", "city", "companies", "secondary", "chinese", "blanket", "security"], "publish_date": "2020-05-25", "url": "https://finance.yahoo.com/news/hong-kong-finance-security-blanket-220003413.html", "summary": "(Bloomberg Opinion) -- China’s decision to impose a national security law on Hong Kong has spurred speculation of capital flight and an erosion of the city’s status as an international financial center.\nU.S.-listed Chinese technology companies are lining up to sell stock in Hong Kong, seeking refuge from an environment that has become increasingly less hospitable.\nOptimism that more companies will join them drove shares of Hong Kong’s exchange operator up more than 6% on Monday.\nHong Kong Exchanges & Clearing Ltd. surged the most in 18 months Monday even as unrest returned to the city.\nAn exodus of businesses, people and capital may yet imperil Hong Kong’s role as an international financial center.", "text": "(Bloomberg Opinion) -- China’s decision to impose a national security law on Hong Kong has spurred speculation of capital flight and an erosion of the city’s status as an international financial center. As a venue for share offerings, at least, the near-term future is looking bright. For that, the territory can thank worsening U.S.-China relations. U.S.-listed Chinese technology companies are lining up to sell stock in Hong Kong, seeking refuge from an environment that has become increasingly less hospitable. Nasdaq-traded JD.com Inc. and NetEase Inc. are planning secondary listings in the city next month, following a trail blazed by Alibaba Group Holding Ltd. in November."}, "News 5": {"title": "Coronavirus: How Chinese rivals are trying to take Zoom's crown", "keywords": ["million", "tencent", "rivals", "video", "zoom", "meeting", "market", "users", "dingtalk", "zooms", "trying", "china", "version", "chinese", "coronavirus", "crown"], "publish_date": "2020-05-25", "url": "https://finance.yahoo.com/news/coronavirus-chinese-rivals-trying-zooms-071254467.html", "summary": "Since then two big Chinese video conferencing apps have significantly increased the size and reach of their services.\nVooV is the international version of Tencent Meeting, which was launched in December last year, and is currently available in several countries including India, Japan and Singapore.\nAccording to Zoom's own numbers it now has 300 million daily active meeting participants, although it does not publish figures on daily users or registered users.\nSoftware analyst Rishi Jaluria from DA Davidson highlighted how he sees different apps trying to get a slice of this market.\nThe Covid-19 pandemic and the subsequent lockdowns have led to rapid consumer adoption of Zoom, but remember, Zoom isn’t trying to monetise those consumers through advertising or data.\"", "text": "Video meetings have become hugely important as the world adapts to the \"new normal\" of the pandemic. Even as lockdown rules ease, they're a safe, convenient and free way to stay in touch for business and socialising. Zoom has become the app of choice for millions, overshadowing rival products from much larger companies such as Microsoft and Google. But the firm is now facing major challenges from some of China's biggest technology companies. Beijing temporarily blocked the international version of Zoom in September, leaving the market wide open to local players, including Alibaba's DingTalk and Tencent-backed VooV."}, "News 6": {"title": "Alibaba Drops After Projecting Slowing Growth in Uncertain Times", "keywords": ["growth", "financial", "market", "drops", "billion", "yuan", "tmall", "alibabas", "uncertain", "sales", "times", "quarter", "slowing", "revenue", "projecting", "alibaba"], "publish_date": "2020-05-25", "url": "https://finance.yahoo.com/news/alibaba-drops-projecting-slowing-growth-020816738.html", "summary": "(Bloomberg) -- Alibaba Group Holding Ltd. slid after projecting revenue growth will slow this year, reflecting post-Covid 19 economic uncertainty at home as well as the potential for U.S.-Chinese tensions to disrupt its business.\nThe e-commerce giant forecast sales growth this year of at least 27.5% to more than 650 billion yuan ($91 billion), down from 35% previously and slightly below analysts’ estimates.\nWhile it posted a better-than-expected 22% rise in March quarter revenue of 114.3 billion yuan, that marked its slowest pace of expansion on record.\nChief Financial Officer Maggie Wu said Friday Alibaba’s financial statements have been consistently prepared in accordance with U.S. GAAP accounting measures and were beyond reproach.\nAlibaba’s March-quarter net income was 3.2 billion yuan, down 88% from a year ago when it booked an 18.7 billion yuan one-time gain on investments.", "text": "(Bloomberg) -- Alibaba Group Holding Ltd. slid after projecting revenue growth will slow this year, reflecting post-Covid 19 economic uncertainty at home as well as the potential for U.S.-Chinese tensions to disrupt its business. Its stock slid as much as 4% in Hong Kong Monday, after a drop of almost 6% in New York before the weekend. The e-commerce giant forecast sales growth this year of at least 27.5% to more than 650 billion yuan ($91 billion), down from 35% previously and slightly below analysts’ estimates. While it posted a better-than-expected 22% rise in March quarter revenue of 114.3 billion yuan, that marked its slowest pace of expansion on record. Online shopping began to bounce back from March, executives said Friday."}, "News 7": {"title": "Baidu Investors Fell Out of Love Years Ago", "keywords": ["company", "investors", "business", "baidu", "nasdaq", "fell", "ago", "opinion", "technology", "chinese", "li", "bloomberg", "love"], "publish_date": "2020-05-24", "url": "https://finance.yahoo.com/news/baidu-investors-fell-love-years-210003636.html", "summary": "(Bloomberg Opinion) -- Five years ago, Baidu Inc. founder and Chairman Robin Li sat down with Bloomberg News to explain how foreign investors were getting it wrong.\nAround the time that Li complained foreign investors weren’t getting it, some of his contemporaries decided to move home where they felt Chinese investors had a better understanding and would reward them with higher valuations.\nInvestors in China won’t assign a higher valuation to a returning company unless it has a convincing growth story to tell.\nBaidu was a pioneer when it listed on Nasdaq in 2005, paving the way for dozens of Chinese internet stocks to follow.\nNisha Gopalan is a Bloomberg Opinion columnist covering deals and banking.", "text": "(Bloomberg Opinion) -- Five years ago, Baidu Inc. founder and Chairman Robin Li sat down with Bloomberg News to explain how foreign investors were getting it wrong. Listed on the Nasdaq a decade earlier, shares of the Chinese search-engine provider had taken a beating over the prior year, and Li’s chief complaint was that Americans just didn’t appreciate the coming changes in its business. The trend in China was toward services like delivery and ride-hailing, as well as bookings for restaurants, beauty salons and doctors. This online-to-offline economy would eclipse search revenue, he predicted. Now, it seems that Li has lost patience."}, "no_of_news": 7, "plot_name": "/content/plots/BABA.png"}}, "NSE": {"ITC.NS": {"company_name": "ITC Ltd.", "News 1": {"title": "Sensex, Nifty end lower as RBI loan relief hits banks", "keywords": ["stressed", "worlds", "index", "fell", "moratorium", "relief", "loan", "nifty", "slid", "hits", "end", "rbi", "banks", "sensex", "bank", "lower"], "publish_date": "2020-05-20", "url": "https://finance.yahoo.com/news/sensex-nifty-rise-banks-itc-041806811.html", "summary": "If banks remain stressed, India's medium-term potential growth is at risk,\" they said.\nThe NSE Nifty 50 index settled 0.74% lower at 9,039.25, while the S&P BSE Sensex closed down 0.84% at 30,672.59.\nThe Nifty banking index fell 2.5%.\nThe top four drags on the Nifty 50 were banks or finance companies.\nIn India, the Nifty metals index fell 1.9%.", "text": "By Sachin Ravikumar  BENGALURU (Reuters) - Indian shares slid on Friday, as banks fell after the central bank decided to cut policy rates and extend a relief period for loan repayments in an effort to contain the economic fallout of the COVID-19 pandemic. The Reserve Bank of India extended a moratorium on loan repayments by a further three months, as many borrowers are out of jobs due to the weeks-long lockdown that has threatened to push Asia's third-largest economy into recession. While some analysts saw it as a much-needed relief for the economy, banking stocks slid as investors fretted over the impact of the moratorium on banks' already huge pile of non-performing loans (NPLs). Analysts said the moratorium could result in banks delaying the recognition of defaults and NPLs, and that investors were disappointed over the lack of any announcements on a one-time restructuring of bank loans. Steps including a loan restructuring scheme, the possibility of creating a \"bad bank\" for stressed sectors and infusing more liquidity via bank recapitalization bonds could help support India's lenders, economists at HSBC in Mumbai said in a report."}, "no_of_news": 1}, "HDFCBANK.NS": {"company_name": "HDFC Bank Ltd.", "News 1": {"title": "Why Cooper Investors is Bullish on Sony (SNE) and HDFC Bank (HDB) Stocks?", "keywords": ["hdb", "investors", "bank", "sony", "value", "stocks", "cooper", "bullish", "stock", "sne", "fund", "long", "hdfc"], "publish_date": "2020-05-01", "url": "https://finance.yahoo.com/news/why-cooper-investors-bullish-sony-143421877.html", "summary": "During the first quarter of 2020, the Cooper Investors Global Equities Fund (Hedged) returned -18.98%, while the benchmark MSCI ACWI was down 19.97%.\nIn the said letter, Cooper Investors highlighted a few stocks and Sony Corp (NYSE: SNE) is one of them.\nYear-to-date, SNE stock lost 7.5% and on April 30th it had a closing price of $64.25.\nCooper Investors comments on HDFC BankIn the said letter, Cooper Investors also highlighted HDFC Bank Ltd (NYSE:HDB) stock.\nDo you think it is appropriate to buy HDFC Bank stock?", "text": "Cooper Investors, an independently-owned investment firm, recently published its first-quarter Global Equities Fund (Hedged) commentary – a copy of which can be downloaded here. During the first quarter of 2020, the Cooper Investors Global Equities Fund (Hedged) returned -18.98%, while the benchmark MSCI ACWI was down 19.97%. In the said letter, Cooper Investors highlighted a few stocks and Sony Corp (NYSE: SNE) is one of them. Sony Corp engages in designing, manufacturing, and selling electronics and entertainment products. Year-to-date, SNE stock lost 7.5% and on April 30th it had a closing price of $64.25."}, "no_of_news": 1}, "TATASTEEL.NS": {"company_name": "Tata Steel Ltd.", "News 1": {"title": "‘Project Birch’: Treasury draws up last resort bailout plan to rescue Britain’s largest companies", "keywords": ["largest", "support", "scheme", "coronavirus", "resort", "project", "britains", "billion", "rescue", "treasury", "options", "furloughed", "companies", "birch", "draws", "job", "plan"], "publish_date": "2020-05-25", "url": "https://www.marketwatch.com/story/project-birch-treasury-draws-up-last-resort-bailout-plan-to-rescue-britains-largest-companies-2020-05-25?siteid=yhoof2&yptr=yahoo", "summary": "Britain’s finance chief Rishi Sunak has drawn up a bailout plan to rescue strategically important companies, which could see the Treasury support key industries on a “last resort” basis once all other options have been exhausted.\n“We have put in place unprecedented levels of support to help businesses get through this crisis.\nSeveral companies in key sectors including steel, aviation and aerospace are struggling with severe financial difficulties.\nAs of May 19, eight million jobs have now been furloughed with £11.1 billion claimed so far through the Coronavirus Job Retention Scheme (CJRS), according to government data.\nTransport Secretary Grant Schapps mentioned “Project Birch” in Parliament last week in reference to the future of the aviation sector.", "text": "Britain’s finance chief Rishi Sunak has drawn up a bailout plan to rescue strategically important companies, which could see the Treasury support key industries on a “last resort” basis once all other options have been exhausted. Under the plan — dubbed “Project Birch — Sunak has increased the Treasury’s capacity to handle bailouts on a case-by-case basis of viable companies, whose failure will “disproportionately harm the economy” if options including the government’s existing loan schemes or shareholder support haven’t worked. “We have put in place unprecedented levels of support to help businesses get through this crisis. Beyond that, many firms are getting support from established market mechanisms, such as existing shareholders, bank lending and commercial finance,” a spokeswoman from the Treasury said in an emailed statement. “In exceptional circumstances, where a viable company has exhausted all options and its failure would disproportionately harm the economy, we may consider support on a ‘last resort’ basis."}, "News 2": {"title": "Unions hit out at Tata Steel plans to make Netherlands bear bulk of European job cuts", "keywords": ["cwc", "uk", "henrar", "hit", "cuts", "steel", "unions", "tata", "europe", "decision", "union", "netherlands", "plans", "dutch", "bulk", "job", "european"], "publish_date": "2020-05-18", "url": "https://finance.yahoo.com/news/tata-steel-dutch-workers-groups-102901394.html", "summary": "A spokesman for Tata Steel Europe confirmed that Chairman Theo Henrar will leave Tata Steel Netherlands in a decision agreed by \"mutual consultation.\"\nTata Steel Netherlands' Central Works Council (CWC) said in a statement on Monday that Tata Steel Europe aimed to cut its Dutch operations in order to save its loss-making British operations.\n\"The owners of Tata Steel in India are keen to downsize Ijmuiden,\" Roel Berghuis of FNV Steel said in a statement.\n\"Billions of pounds and euros have not been able to make Tata Steel UK profitable.\"\nTata Steel Europe said last month that it had delayed reorganisation plans until after July 1, due to the coronavirus pandemic.", "text": "AMSTERDAM (Reuters) - Labour representatives at Tata Steel's Dutch operations said on Monday that the company plans to cut 1,000 jobs in the Netherlands and that the subsidiary's chairman will step down after opposing the layoffs. A spokesman for Tata Steel Europe confirmed that Chairman Theo Henrar will leave Tata Steel Netherlands in a decision agreed by \"mutual consultation.\" Tata Steel Europe began talks with workers in November over a \"transformation programme\" that would lead to 1,250 job cuts in Europe, following a decision by European Union competition regulators to block a joint venture with Germany’s Thyssenkrupp. Tata Steel Netherlands' Central Works Council (CWC) said in a statement on Monday that Tata Steel Europe aimed to cut its Dutch operations in order to save its loss-making British operations. \"The CWC does not agree to the scrapping of 1,000 jobs in the Netherlands,\" the CWC said."}, "no_of_news": 2}, "BHARTIARTL.NS": {"company_name": "Bharti Airtel Ltd.", "News 1": {"title": "India Stocks Halt Three-Day Drop as Vaccine Report Lifts Asia", "keywords": ["biggest", "economy", "halt", "stocks", "rose", "report", "threeday", "asia", "nifty", "vaccine", "sales", "india", "drop", "results", "sensex", "lifts", "indian", "worst"], "publish_date": "2020-05-19", "url": "https://finance.yahoo.com/news/indian-stocks-rise-vaccine-report-042633015.html", "summary": "(Bloomberg) -- Indian stocks advanced for the first time in four days, tracking a regional rally after early vaccine results sparked speculation economies could rebound quickly.\nThe S&P BSE Sensex rose 0.6% to close at 30,196.17 in Mumbai, while the NSE Nifty 50 Index gained by as much, though the indexes came off the day’s high level.\n“The possibility of a vaccine will bring temporary relief to the market,” said Abhimanyu Sofat, head of research at IIFL Securities Ltd. in Mumbai.\nOf the 19 Nifty 50 companies that have reported March quarter results so far, only five have beaten estimates.\nReliance Industries Ltd. was the biggest drag and Indusind Bank Ltd. was the biggest loser with a 2.4% drop.", "text": "(Bloomberg) -- Indian stocks advanced for the first time in four days, tracking a regional rally after early vaccine results sparked speculation economies could rebound quickly. The S&P BSE Sensex rose 0.6% to close at 30,196.17 in Mumbai, while the NSE Nifty 50 Index gained by as much, though the indexes came off the day’s high level. The rupee rose 0.4% to 75.64 per dollar on Tuesday, while the yield on most-traded 6.45% 2020 bonds fell two basis points to 6.04%. “The possibility of a vaccine will bring temporary relief to the market,” said Abhimanyu Sofat, head of research at IIFL Securities Ltd. in Mumbai. “Overall challenges of reviving the economy after the lockdown will continue to impact prospects for the market.”  While extending its lockdown to May 31, India eased curbs on some businesses, driving a surge in fuel sales in the first half of May from a month earlier as some commerce resumed."}, "News 2": {"title": "Indian shares jump on vaccine optimism; Bharti Airtel surges", "keywords": ["sessions", "bharti", "optimism", "covid19", "hit", "stocks", "shares", "banking", "airtel", "50", "stock", "nifty", "vaccine", "jump", "indian", "surges", "worst"], "publish_date": "2020-05-19", "url": "https://finance.yahoo.com/news/sensex-nifty-jump-vaccine-optimism-041122637.html", "summary": "By Sachin RavikumarBENGALURU (Reuters) - Indian shares followed world markets higher on Tuesday, after three straight sessions of declines, spurred by gains in Bharti Airtel and positive data from an early trial of a potential COVID-19 vaccine.\nOn Tuesday, the blue-chip Nifty 50 was up 2.09% at 9,007.20 by 0500 GMT, while the S&P BSE Sensex <.BSESN> was 2.12% higher at 30,665.07.\nShares in Bharti Airtel Ltd <BRTI.NS> jumped 9% and hit a record high as the telecoms firm reported a 15% rise in revenue.\nThe stock was the biggest boost to the Nifty 50.\n\"If such short-term moves happen, there is a high probability that shorts are getting covered,\" he said, of the banking stocks' rise on Tuesday.", "text": "By Sachin Ravikumar  BENGALURU (Reuters) - Indian shares followed world markets higher on Tuesday, after three straight sessions of declines, spurred by gains in Bharti Airtel and positive data from an early trial of a potential COVID-19 vaccine. The NSE Nifty 50 index <.NSEI> has slid 9% in May so far, with sharp falls in the last three sessions, as India's economic relief measures disappointed markets and domestic COVID-19 infections rose steadily. On Tuesday, the blue-chip Nifty 50 was up 2.09% at 9,007.20 by 0500 GMT, while the S&P BSE Sensex <.BSESN> was 2.12% higher at 30,665.07. Other Asian shares also climbed and oil extended gains after very early data showed U.S.-based Moderna Inc's <MRNA.O> experimental COVID-19 vaccine produced protective antibodies in a small group of healthy volunteers. Shares in Bharti Airtel Ltd <BRTI.NS> jumped 9% and hit a record high as the telecoms firm reported a 15% rise in revenue."}, "News 3": {"title": "Nokia wins network equipment order from India's Bharti Airtel", "keywords": ["radio", "order", "equipment", "indias", "bharti", "deal", "nokia", "wins", "airtel", "future", "india", "connectivity", "telecoms", "network", "pay"], "publish_date": "2020-04-28", "url": "https://finance.yahoo.com/news/nokia-wins-order-bharti-airtel-050832182.html", "summary": "Nokia logo is seen at the Mobile World Congress in Barcelona(Reuters) - Nokia Oyj said on Tuesday it has won a multi-year deal with India's third-largest telecom firm Bharti Airtel Ltd[BRTI.NS] to provide equipment and services.\n\"This is an important agreement for the future of connectivity in one of the world's largest telecoms markets and solidifies our position in India,\" Nokia Chief Executive Officer Rajeev Suri said in a statement.\nNokia said the deal includes Nokia's Single Radio Access Network solution, AirScale Radio Access, Baseband, related Services, and it will be completed by 2022.\nIndia's telecoms department have been seeking carriers to pay 920 billion rupees ($12.1 billion) in overdue levies and interest.\nVodafone Idea Ltd and Bharti Airtel, two of India's top three carriers, have been in the centre of the row.", "text": "Nokia logo is seen at the Mobile World Congress in Barcelona  (Reuters) - Nokia Oyj said on Tuesday it has won a multi-year deal with India's third-largest telecom firm Bharti Airtel Ltd[BRTI.NS] to provide equipment and services. \"This is an important agreement for the future of connectivity in one of the world's largest telecoms markets and solidifies our position in India,\" Nokia Chief Executive Officer Rajeev Suri said in a statement. Nokia said the Indian firm's rollout, which will also lay the foundation for providing 5G connectivity in the future, will see some 300,000 radio network units deployed across nine circles in India, but did not give any financial details of the deal. However, industry analysts said this kind of deal could be valued at around $1 billion. Nokia said the deal includes Nokia's Single Radio Access Network solution, AirScale Radio Access, Baseband, related Services, and it will be completed by 2022."}, "no_of_news": 3}, "TCS.NS": {"company_name": "Tata Consultancy Services Ltd.", "News 1": {"title": "FOCUS-Tech firms sweeten deals for U.S. banks cutting costs in crisis", "keywords": ["deals", "sweeten", "discussions", "cutting", "crisis", "discounts", "industry", "focustech", "clients", "infosys", "talks", "technology", "banks", "firms", "costs", "services", "tech"], "publish_date": "2020-05-18", "url": "https://finance.yahoo.com/news/focus-tech-firms-sweeten-deals-110000089.html", "summary": "We have no option but to use every tactic necessary, including heavy discounts, to gain a competitive edge,\" said one.\nAccenture said it was working with banking clients to address the implications of the crisis but did not comment on pricing talks.\nIt has grown into a nearly $200 billion a year industry over the past two decades, offering technology services to corporate heavyweights across the world.\nDeveloping and maintaining the plumbing of the world's financial services industry accounts for 40% of its revenues, with Wall Street banks among its biggest customers.\nThe top 10 U.S. banks collectively spend roughly $70 billion on technology annually, according to public statements and executives.", "text": "* Tech services companies offer deferrals, discounts - execs  * Big banks' budgets squeezed by fallout from COVID-19 pandemic  * Accenture, TCS, Infosys, Cognizant in talks with banks -execs  * Discussions reflect wider trend in tech outsourcing - insiders  By Anirban Sen  BENGALURU, May 18 (Reuters) - Top technology services firms are offering payment deferrals, discounts of up to 20% and other sweeteners to some U.S. banks to keep their business as the pandemic forces Wall Street to cut tech budgets, according to executives involved in the talks. Large Wall Street banks are widely expected to reduce overall budgets and discretionary tech spending, which includes areas such as technology consulting services, business analytics, research and design and process management projects. Accenture, Tata Consultancy Services, Infosys and Cognizant Technology Solutions - among the world's largest tech services vendors - have offered to do more for them at lower rates, three executives who have taken part in the discussions told Reuters. The aim is to secure new contracts as well as to keep the relationships with the banks ticking over so that they can be expanded once more post-pandemic, they added. At least half a dozen meetings have taken place over the past month between the tech companies and some of the largest U.S. banks including JPMorgan Chase & Co, Bank of America and Citigroup, said the executives who all requested anonymity as the discussions were confidential."}, "News 2": {"title": "PETRONAS partners with TCS to transform its Integrated Value Chain", "keywords": ["chain", "business", "value", "downstream", "partners", "petronas", "tata", "platform", "integrated", "services", "digital", "tcs", "transform", "dove"], "publish_date": "2020-05-14", "url": "https://finance.yahoo.com/news/petronas-partners-tcs-transform-integrated-024500712.html", "summary": "The resulting digitally empowered workforce and end-to-end visibility of the entire value chain has enhanced PETRONAS' ability to respond swiftly and more effectively to meet customer demands and expectations.\n\"At PETRONAS, digital strategy has now become the blueprint of our business strategy and has accelerated new ways of working.\nThrough DOVE, we are able to unlock new value for Downstream by venturing into other segments of the value chain, driving focus towards untapped opportunities for the business.\nDigital, coupled with innovation, has become key to driving business and delivering value to the company and our customers,\" said Datuk Md Arif Mahmood, EVP & CEO, Downstream, PETRONAS.\n\"We are pleased that PETRONAS has chosen to partner with us to transform their operations to better serve their customers,\" said Girish Ramachandran, President, TCS Asia Pacific.", "text": "Tata Consultancy Services-designed Analytics Platform enhances Transparency, Agility, Responsiveness for better Customer Experience and Value Chain Optimization  KUALA LUMPUR, Malaysia and MUMBAI, India, May 14, 2020 /PRNewswire/ -- Tata Consultancy Services (TCS) (BSE: 532540, NSE: TCS), a leading global IT services, consulting and business solutions organization, and Petroliam Nasional Berhad (PETRONAS), Malaysia's fully integrated oil and gas multinational, have announced their collaboration on Project DOVE (Drive Optimisation Value for Enterprise). The DOVE platform, co-designed by TCS, endeavors to elevate data transparency, increase personal accountability and promote enterprise collaboration through advancing digital competencies and tools within PETRONAS by tapping into information from its downstream operating companies as well as updated competitor and market information, creating a data pool for real-time intelligence. The platform is supported by advanced analytical models and tools, such as retail and commercial demand forecasting, vessel scheduling optimisation and product pricing recommendations that enable optimised decision-making. The resulting digitally empowered workforce and end-to-end visibility of the entire value chain has enhanced PETRONAS' ability to respond swiftly and more effectively to meet customer demands and expectations. \"At PETRONAS, digital strategy has now become the blueprint of our business strategy and has accelerated new ways of working."}, "News 3": {"title": "Virus hits Asian energy, exporters hardest, as analysts cut outlook", "keywords": ["outlook", "asian", "refinitiv", "earnings", "month", "cut", "reduced", "analysts", "sector", "data", "profit", "hits", "exporters", "energy", "virus", "companies", "hardest", "south"], "publish_date": "2020-05-11", "url": "https://finance.yahoo.com/news/virus-hits-asian-energy-exporters-083900922.html", "summary": "May 11 (Reuters) - Concerns that extended factory lockdowns and social distancing rules will dent company profits prompted analysts to cut forecasts for Asian companies' 2020 earnings by around 5.4% over the last month, Refinitiv data showed.\nThe reductions take the total cut in earnings estimates to 14.8% so far this year.\nIn the last month, companies dependent on the energy sector faced a 17.8% cut in 2020 forecasts.\nThe profit forecast downgrades followed poor first-quarter earnings results for many Asian companies, which reported a 19% year-on-year fall in bottom line, Refinitiv data found.\nThe consumer discretionary sector, which includes companies selling non-essential durable items such as televisions and automobiles, also faced big downgrades, the data showed.", "text": "May 11 (Reuters) - Concerns that extended factory lockdowns and social distancing rules will dent company profits prompted analysts to cut forecasts for Asian companies' 2020 earnings by around 5.4% over the last month, Refinitiv data showed. The reductions take the total cut in earnings estimates to 14.8% so far this year. The companies most affected are those reliant on exports and on energy, following a collapse in oil prices and in fuel demand because of lockdown restrictions and border closures. In the last month, companies dependent on the energy sector faced a 17.8% cut in 2020 forecasts. Companies in export-reliant economies, South Korea and Thailand, were also hit hard as their profit forecasts were reduced by about 9% and 8.3% respectively."}, "News 4": {"title": "Asian stock valuations hit 3-month high in April - Refinitiv data", "keywords": ["refinitiv", "asian", "month", "hit", "reflect", "valuations", "shares", "high", "stock", "data", "pe", "jumped", "recovery", "ratio", "sharp", "regional", "3month"], "publish_date": "2020-05-06", "url": "https://finance.yahoo.com/news/asian-stock-valuations-hit-3-053927719.html", "summary": "The surge drove the index's 12-month forward price-to-earnings (P/E) ratio to 13.46 at end-April, compared with 11.79 a month earlier.\nSo far, Asia's large- and mid-cap firms have posted a 17% fall in first-quarter net profits, data from Refinitiv Eikon showed.\nNew Zealand was the most expensive with a P/E ratio of 28.3, followed by Thailand and India.\nDespite the sharp recovery last month, Asian shares lagged their global peers in terms of valuations.\nMSCI's World Index gained about 10.6% last month and its P/E ratio jumped to a 16-year high of 16.62.", "text": "May 6 (Reuters) - Asian equities valuations jumped to the highest since January at the end of April, following a sharp recovery in regional shares last month due to the stimulus measures unveiled by governments to mitigate the damage caused by the coronavirus pandemic. MSCI's broadest index of Asia-Pacific shares gained 8.13% in April, recording its best month in more than four years. The surge drove the index's 12-month forward price-to-earnings (P/E) ratio to 13.46 at end-April, compared with 11.79 a month earlier. Asian equities reflect excessive optimism about corporate performance, ANZ Bank said in a report, warning that the first-quarter corporate results might reflect the full scale of the growth shock that would lead to renewed downward pressure on regional equities. So far, Asia's large- and mid-cap firms have posted a 17% fall in first-quarter net profits, data from Refinitiv Eikon showed."}, "no_of_news": 4}, "INFY.NS": {"company_name": "Infosys Ltd.", "News 1": {"title": "Infosys Partners With Rhode Island in Fight Against COVID-19", "keywords": ["location", "islanders", "partners", "covid19", "contact", "infosys", "state", "app", "services", "digital", "island", "fight", "rhode"], "publish_date": "2020-05-19", "url": "https://finance.yahoo.com/news/infosys-partners-rhode-island-fight-180000028.html", "summary": "Infosys Logo MoreLeveraging existing Infosys technologies, the company developed a mobile app that will help Rhode Islanders follow required health and safety guidelines, monitor their own activities and support the Rhode Island Department of Health by providing accurate data with user consent.\nThe application, called \"CRUSH COVID RI,\" will utilize Infosys' Location Based Services platform to create individualized location diaries, while protecting user privacy.\nThe mobile app will serve as a one stop shop for pandemic response, connecting Rhode Islanders with resources about quarantine and isolation supports, symptom monitoring, and up-to-date disease information from the Rhode Island Department of Health.\n\"We have been asking Rhode Islanders to keep a diary of who they come into contact with, each day,\" said Governor Raimondo.\nI encourage all Rhode Islanders to download this app and be proactive in crushing COVID-19.\"", "text": "Employs proven technology to support contact tracing efforts and safely get state back to work  PROVIDENCE, Rhode Island, May 19, 2020 Infosys (NYSE: INFY), a global leader in next-generation digital services and consulting, today announced that it is partnering with the State of Rhode Island in launching a privacy-first contact tracing solution to help Rhode Islanders and state officials slow the spread of coronavirus throughout the state. This is part of the state's effort to safely reopen businesses while reducing occurrences of community transmission. Infosys Logo More  Leveraging existing Infosys technologies, the company developed a mobile app that will help Rhode Islanders follow required health and safety guidelines, monitor their own activities and support the Rhode Island Department of Health by providing accurate data with user consent. The application, called \"CRUSH COVID RI,\" will utilize Infosys' Location Based Services platform to create individualized location diaries, while protecting user privacy. The mobile app will serve as a one stop shop for pandemic response, connecting Rhode Islanders with resources about quarantine and isolation supports, symptom monitoring, and up-to-date disease information from the Rhode Island Department of Health."}, "News 2": {"title": "Tech firms sweeten deals for U.S. banks cutting costs in crisis", "keywords": ["deals", "sweeten", "wall", "street", "cutting", "crisis", "industry", "clients", "spending", "infosys", "technology", "banks", "firms", "costs", "services", "tech"], "publish_date": "2020-05-18", "url": "https://finance.yahoo.com/news/tech-firms-sweeten-deals-u-110846980.html", "summary": "Large Wall Street banks are widely expected to reduce overall budgets and discretionary tech spending, which includes areas such as technology consulting services, business analytics, research and design and process management projects.\nAccenture, Tata Consultancy Services, Infosys and Cognizant Technology Solutions - among the world's largest tech services vendors - have offered to do more for them at lower rates, three executives who have taken part in the discussions told Reuters.\nIt has grown into a nearly $200 billion a year industry over the past two decades, offering technology services to corporate heavyweights across the world.\nDeveloping and maintaining the plumbing of the world's financial services industry accounts for 40% of its revenues, with Wall Street banks among its biggest customers.\nSWEETNESS HAS LIMITSBanks are not, however, slashing tech spending as heavily as sectors such as travel, hospitality and retail.", "text": "FILE PHOTO: The Wall Street sign is pictured at the New York Stock exchange (NYSE) in the Manhattan borough of New York City  By Anirban Sen  BENGALURU (Reuters) - Top technology services firms are offering payment deferrals, discounts of up to 20% and other sweeteners to some U.S. banks to keep their business as the pandemic forces Wall Street to cut tech budgets, according to executives involved in the talks. Large Wall Street banks are widely expected to reduce overall budgets and discretionary tech spending, which includes areas such as technology consulting services, business analytics, research and design and process management projects. Accenture, Tata Consultancy Services, Infosys and Cognizant Technology Solutions - among the world's largest tech services vendors - have offered to do more for them at lower rates, three executives who have taken part in the discussions told Reuters. The aim is to secure new contracts as well as to keep the relationships with the banks ticking over so that they can be expanded once more post-pandemic, they added. At least half a dozen meetings have taken place over the past month between the tech companies and some of the largest U.S. banks including JPMorgan Chase & Co, Bank of America and Citigroup, said the executives who all requested anonymity as the discussions were confidential."}, "News 3": {"title": "FOCUS-Tech firms sweeten deals for U.S. banks cutting costs in crisis", "keywords": ["deals", "sweeten", "discussions", "cutting", "crisis", "discounts", "industry", "focustech", "clients", "infosys", "talks", "technology", "banks", "firms", "costs", "services", "tech"], "publish_date": "2020-05-18", "url": "https://finance.yahoo.com/news/focus-tech-firms-sweeten-deals-110000089.html", "summary": "We have no option but to use every tactic necessary, including heavy discounts, to gain a competitive edge,\" said one.\nAccenture said it was working with banking clients to address the implications of the crisis but did not comment on pricing talks.\nIt has grown into a nearly $200 billion a year industry over the past two decades, offering technology services to corporate heavyweights across the world.\nDeveloping and maintaining the plumbing of the world's financial services industry accounts for 40% of its revenues, with Wall Street banks among its biggest customers.\nThe top 10 U.S. banks collectively spend roughly $70 billion on technology annually, according to public statements and executives.", "text": "* Tech services companies offer deferrals, discounts - execs  * Big banks' budgets squeezed by fallout from COVID-19 pandemic  * Accenture, TCS, Infosys, Cognizant in talks with banks -execs  * Discussions reflect wider trend in tech outsourcing - insiders  By Anirban Sen  BENGALURU, May 18 (Reuters) - Top technology services firms are offering payment deferrals, discounts of up to 20% and other sweeteners to some U.S. banks to keep their business as the pandemic forces Wall Street to cut tech budgets, according to executives involved in the talks. Large Wall Street banks are widely expected to reduce overall budgets and discretionary tech spending, which includes areas such as technology consulting services, business analytics, research and design and process management projects. Accenture, Tata Consultancy Services, Infosys and Cognizant Technology Solutions - among the world's largest tech services vendors - have offered to do more for them at lower rates, three executives who have taken part in the discussions told Reuters. The aim is to secure new contracts as well as to keep the relationships with the banks ticking over so that they can be expanded once more post-pandemic, they added. At least half a dozen meetings have taken place over the past month between the tech companies and some of the largest U.S. banks including JPMorgan Chase & Co, Bank of America and Citigroup, said the executives who all requested anonymity as the discussions were confidential."}, "News 4": {"title": "NICE Actimize and Infosys Announce Strategic Partnership to Offer End-to-End Financial Crime Solutions", "keywords": ["offer", "financial", "actimize", "customer", "organizations", "announce", "solutions", "partnership", "endtoend", "infosys", "strategic", "nice", "digital", "crime", "services"], "publish_date": "2020-05-13", "url": "https://finance.yahoo.com/news/nice-actimize-infosys-announce-strategic-111500501.html", "summary": "Leveraging their respective experiences across financial crime management, NICE Actimize and Infosys will provide their market-leading regulatory and compliance solutions and services to support multiple industry sectors.\nThis offering will include ‘Infosys Actimize Digital Suite’, a set of accelerators designed for faster time to market and predictability in implementation.\nAjay Vij, Senior Vice President and Head of Financial Services Business EMEA for Infosys, said, \"We look forward to elevating our partnership with NICE Actimize, known for its market-leading financial crime solutions.\nNICE Actimize’s financial crime leadership combined with Infosys’ proven expertise in delivering business solutions will create significant efficiencies for financial services organizations.\"\nWe welcome the opportunity to roll out our leading financial crime solutions within Infosys’ massive network.\"", "text": "The next-generation suite of financial crime solutions will allow organizations to protect their customers using the industry’s leading solutions and services  NICE Actimize, a NICE (Nasdaq: NICE) business and a leader in Autonomous Financial Crime Management and Infosys (NYSE: INFY), a global leader in next-generation digital services and consulting, together today announced the expansion in their strategic collaboration. This global partnership will allow Infosys to offer its best-in-class delivery capabilities and resell NICE Actimize’s end-to-end financial crime software solutions through either a cloud or on-premises environment to a growing customer base around the world. Leveraging their respective experiences across financial crime management, NICE Actimize and Infosys will provide their market-leading regulatory and compliance solutions and services to support multiple industry sectors. Among the benefits of this collaborative approach, client organizations will create an efficient path to overcome emerging and rapidly evolving digital threats, and improve operational efficiencies while delivering exceptional customer experience. This offering will include ‘Infosys Actimize Digital Suite’, a set of accelerators designed for faster time to market and predictability in implementation."}, "News 5": {"title": "Infosys Selected as the Digital Transformation Partner for GLOBALFOUNDRIES' Digital Leadership Program", "keywords": ["globalfoundries", "partner", "selected", "global", "transformation", "industry", "infosys", "clients", "program", "india", "risks", "digital", "leadership", "statements"], "publish_date": "2020-05-13", "url": "https://finance.yahoo.com/news/infosys-selected-digital-transformation-partner-101000322.html", "summary": "BENGALURU, India, May 13, 2020 /PRNewswire/ -- Infosys (NYSE: INFY), a global leader in next-generation digital services and consulting, has been selected by GLOBALFOUNDRIES® (GF®), the world's leading specialty foundry, as its partner for the company's Digital Transformation program.\nGF will leverage Infosys' domain expertise and industry experience to transform and optimize GF's IT assets to scale its digital capabilities.\nAnand Swaminathan, EVP and Global Industry Leader - Communications, Media and Technology, Infosys, said, \"Together with GlobalFoundries we are embarking on an industry leading digital transformation program.\nWe are excited to partner with them on this digital leadership program which we believe will set a new benchmark for the industry.\"\nWe enable clients in 46 countries to navigate their digital transformation.", "text": "BENGALURU, India, May 13, 2020 /PRNewswire/ -- Infosys (NYSE: INFY), a global leader in next-generation digital services and consulting, has been selected by GLOBALFOUNDRIES® (GF®), the world's leading specialty foundry, as its partner for the company's Digital Transformation program. Through this partnership, Infosys will provide expertise and analytical solutions to optimize the overall efficiency and agility of GF's manufacturing and business operations. Infosys_Logo More  The partnership will enable GF to seamlessly transform its legacy solutions and adopt advanced cloud capabilities to rationalize existing workloads, thereby realizing GF's digital strategy through process automation while achieving lower cost of ownership and ensuring compliance requirements. It will also help GF derive value and insights from the data generated across its globally dispersed operations. GF will leverage Infosys' domain expertise and industry experience to transform and optimize GF's IT assets to scale its digital capabilities."}, "no_of_news": 5}}, "FOREX": {"INR=X": {"currency_pair": "USD/INR", "News 1": {"title": "Stock Market Latest Updates: Sensex drops 260 points, Nifty below 9,000-mark; Axis Bank, Bajaj Auto among major losers", "keywords": ["latest", "updates", "market", "drops", "stock", "major", "nifty", "futures", "points", "uschina", "sensex", "bank", "losers"], "publish_date": "2020-05-22", "url": "https://finance.yahoo.com/news/stock-market-today-live-updates-035050177.html", "summary": "Stock Market Latest Updates: Sensex drops 260 points, Nifty below 9,000-mark; Axis Bank, Bajaj Auto among major losersWashington: Asian shares were set for another retreat on Friday as US.-China tensions curbed investor risk appetite and caused global equity markets to stumble.\nHong Kong futures fell 1.59 percent and Nikkei futures were trading below the Nikkei 225 index's previous close, pointing to opening loss of 0.1 percent.\nThe move drew a warning from President Donald Trump, who said the United States would react 'very strongly' against it.\nBrazil's real BRBY jumped after the central bank said it was ready to increase support for the currency.\nAlso See: Stock Market Latest Updates: Sensex surges over 600 points, Nifty above 9,050-level; HDFC, Tata Steel among major gainersStock Market Latest Updates: Indices give up intra-day gains as Sensex, Nifty end in red; ICICI Bank, HUL among major losersStock Market Latest Updates: Indices end 3-day losing streak, Sensex up 167 points, Nifty above 8,850; Bharti Airtel at record highRead more on Business by Firstpost.", "text": "Stock Market Latest Updates: Sensex drops 260 points, Nifty below 9,000-mark; Axis Bank, Bajaj Auto among major losers  Washington: Asian shares were set for another retreat on Friday as US.-China tensions curbed investor risk appetite and caused global equity markets to stumble. Hong Kong futures fell 1.59 percent and Nikkei futures were trading below the Nikkei 225 index's previous close, pointing to opening loss of 0.1 percent. Australian S&P/ASX 200 futures eased 0.13 percent. Global equities pulled back after Beijing was set to impose new national security legislation on Hong Kong. The move drew a warning from President Donald Trump, who said the United States would react 'very strongly' against it."}, "News 2": {"title": "Rupee Opens Lower On Weak Equities", "keywords": ["versus", "opened", "lower", "higher", "rupee", "highest", "oneday", "opens", "dollar", "dollarrupee", "weak", "previous", "equities"], "publish_date": "2020-05-22", "url": "https://finance.yahoo.com/news/rupee-opens-lower-weak-equities-035556522.html", "summary": "Rupee on Friday (May 22, 2020) opened lower at 75.72 versus its previous close of 75.61 per US dollar.\nhe sentiment in the rupee has been hit owing to weakness in equities and highest one-day spike in coronavirus cases today at 6066.\nIn the bond market, the yield on 10-year government bond opened at 5.75% versus its previous closing of 5.777%.\nBrent crude was up 14 cents, or 0.4%, at $36.20 per barrel by 0040 GMT.\nMeanwhile, Indian benchmark indices on rising US-China tension and adding the highest one-day corona positive cases declined in trade, with Nifty down byGoodReturns.inAlso Read:Rupee Opens Higher At 75.61 Per US DollarRupee Opens Higher At 75.48 Per US DollarRupee Opens Higher At 75.56 Per US Dollar", "text": "Rupee on Friday (May 22, 2020) opened lower at 75.72 versus its previous close of 75.61 per US dollar. he sentiment in the rupee has been hit owing to weakness in equities and highest one-day spike in coronavirus cases today at 6066. In the bond market, the yield on 10-year government bond opened at 5.75% versus its previous closing of 5.777%. Oil prices on Friday were up on indications of recovery in fuel demand as business and other social coronavirus-led restrictions are being eased across the world. Brent crude was up 14 cents, or 0.4%, at $36.20 per barrel by 0040 GMT."}, "News 3": {"title": "Stock Market Latest Updates: Sensex rises over 100 points, Nifty at 9,106; ITC, Asian Paints, Maruti among top gainers", "keywords": ["latest", "updates", "market", "higher", "paints", "maruti", "stock", "nifty", "points", "rises", "prices", "sensex", "coronavirus", "equities"], "publish_date": "2020-05-21", "url": "https://finance.yahoo.com/news/stock-market-today-live-updates-032508192.html", "summary": "Stock Market Latest Updates: Sensex rises over 100 points, Nifty at 9,106; ITC, Asian Paints, Maruti among top gainersWashington: Asian shares were poised to open higher on Thursday after global equities and crude prices rallied overnight on hopes of a rapid economic recovery and government support.\nOn Wall Street, the Dow Jones Industrial Average rose 1.52 percent, the S&P 500 gained 1.67 percent, and the Nasdaq Composite added 2.08 percent.\nGold prices were slightly lower, under pressure from increased risk appetite, which lifted equities.\nEarlier, bullion was boosted by doubts about the development of a coronavirus vaccine and a wave of government stimulus.\nAlso See: Stock Market Latest Updates: Sensex plummets 886 points, Nifty below 9,150-mark; Tech Mahindra, Infosys among top losersStock Market Latest Updates: Indices give up intra-day gains as Sensex, Nifty end in red; ICICI Bank, HUL among major losersStock Market Latest Updates: Sensex declines 242 points, Nifty slips below 9,200-mark; ONGC, NTPC among major losersRead more on Business by Firstpost.", "text": "Stock Market Latest Updates: Sensex rises over 100 points, Nifty at 9,106; ITC, Asian Paints, Maruti among top gainers  Washington: Asian shares were poised to open higher on Thursday after global equities and crude prices rallied overnight on hopes of a rapid economic recovery and government support. Hong Kong futures edged higher. Nikkei futures were trading above the Nikkei 225 index's previous close. Australian shares were also set to rise. Global equities have received a boost this week as governments around the world gradually loosened their coronavirus lockdown restrictions, raising investor hopes the economic impact of the pandemic would be short-lived."}, "News 4": {"title": "Rupee Opens Higher At 75.61 Per US Dollar", "keywords": ["versus", "opened", "trading", "7561", "higher", "rupee", "opens", "dollar", "view", "tracking", "yield", "previous", "bond"], "publish_date": "2020-05-21", "url": "https://finance.yahoo.com/news/rupee-opens-higher-75-61-044910242.html", "summary": "Rupee on Thursday (May 21, 2020) opened higher at 75.61 versus its previous close of 75.80 per US dollar.\nIn the bond market, the yield on 10-year government bond opened at 5.77% versus its previous closing of 5.78%.\nOn the contrary, Kotak Securities holds that losses in the home currency shall remain capped due to strong corporate inflows.\nMeanwhile, Indian benchmark indices tracking strength in the Asian markets was trading on a positive note with Nifty up 0.51% at 9110 points.\nGoodReturns.inAlso Read:Rupee Opens Higher At 75.56 Per US DollarRupee Opens Stronger At 75.77 Per US DollarSwiggy Starts Home Delivery Service For Liquor Bottles: How To Order?", "text": "Rupee on Thursday (May 21, 2020) opened higher at 75.61 versus its previous close of 75.80 per US dollar. In the bond market, the yield on 10-year government bond opened at 5.77% versus its previous closing of 5.78%. Fitch Ratings is of the view that India is set to see a rating cut owing to elevated public debt levels as well as fiscal deficit in double-digits. On the contrary, Kotak Securities holds that losses in the home currency shall remain capped due to strong corporate inflows. Meanwhile, Indian benchmark indices tracking strength in the Asian markets was trading on a positive note with Nifty up 0.51% at 9110 points."}, "News 5": {"title": "Stock Market Latest Updates: Indices end 3-day losing streak, Sensex up 167 points, Nifty above 8,850; Bharti Airtel at record high", "keywords": ["latest", "updates", "record", "market", "shares", "losing", "stock", "gain", "nifty", "vaccine", "points", "streak", "prices", "sensex"], "publish_date": "2020-05-19", "url": "https://finance.yahoo.com/news/stock-market-today-live-updates-033037697.html", "summary": "Stock Market Latest Updates: Indices end 3-day losing streak, Sensex up 167 points, Nifty above 8,850; Bharti Airtel at record highWashington: Asian shares were set to rise on Tuesday after data from an early-stage trial for a coronavirus vaccine lifted hopes for a near-term economic recovery, sending global equity markets and oil prices surging.\nHong Kong futures were up 1.8 percent and Australian shares were also set to open higher.\nNikkei futures were trading above the Nikkei 225 index's previous close, pointing to an opening gain of about 2 percent.\nOn Wall Street, the benchmark S&P 500 posted its biggest one-day percentage gain in almost six weeks, gaining 3.15 percent.\nAlso See: Stock Market Latest Updates: Sensex falls 190 points, Nifty below 9,200-mark; Reliance Industries, Asian Paints among top losersStock market today LIVE Updates: Sensex jumps over 300 points, Nifty above 8,900-mark; L&T, Tata Steel among gainersStock Market Latest Updates: Sensex surges 637 points, Nifty above 9,350; Axis Bank zooms over 7%, Ultra Cement among top gainersRead more on Business by Firstpost.", "text": "Stock Market Latest Updates: Indices end 3-day losing streak, Sensex up 167 points, Nifty above 8,850; Bharti Airtel at record high  Washington: Asian shares were set to rise on Tuesday after data from an early-stage trial for a coronavirus vaccine lifted hopes for a near-term economic recovery, sending global equity markets and oil prices surging. Hong Kong futures were up 1.8 percent and Australian shares were also set to open higher. Nikkei futures were trading above the Nikkei 225 index's previous close, pointing to an opening gain of about 2 percent. Data from Moderna Inc's COVID-19 vaccine, the first to be tested in the United States, showed that it produced protective antibodies in a small group of healthy volunteers, the company said on Monday. Shares of the pharmaceutical company surged."}, "no_of_news": 5}, "EURUSD=X": {"currency_pair": "EUR/USD", "News 1": {"title": "EUR/USD Mid-Session Technical Analysis for May 25, 2020", "keywords": ["look", "eurusd", "25", "range", "retracement", "2020", "technical", "swing", "dollar", "yields", "analysis", "zone", "trend", "main", "midsession"], "publish_date": "2020-05-25", "url": "https://finance.yahoo.com/news/eur-usd-mid-session-technical-140032896.html", "summary": "Daily Swing Chart Technical AnalysisThe main trend is up according to the daily swing chart, however, momentum shifted to the downside on May 21.\nThe main trend will change to down on a move through the last swing bottom at 1.0766.\nIts retracement zone at 1.0892 to 1.0831 has been acting like support.\nIts retracement zone at 1.0937 to 1.0987 has been acting like resistance.\nIts retracement zone at 1.1066 to 1.1167 is the primary upside target.", "text": "The Euro is trading slightly lower against the U.S. Dollar, but the volume behind the selling pressure is a little tough to gauge due to the thin-U.S.-Memorial Day volume. Traders did say that the U.S. Dollar is garnering some support as worries about a standoff between the United States and China over civil liberties in Hong Kong fueled demand for safe-haven currencies. The dollar likely firmed after a senior White House official said Beijing’s plan to impose a security law on the former British colony of Hong Kong could lead to U.S. sanctions, which could worsen an already tense relationship between the world’s two-largest economies. At 13:21 GMT, the EUR/USD is trading 1.0898, down 0.0004 or -0.04%. Daily EUR/USD More  Euro Zone Bond Yields Steady  Euro Zone bond yields were steady on Monday, as the market overlooked a paper from Austria, Sweden, Denmark and the Netherlands opposing the EU’s planned grants-based recovery funds and awaited the European Commission’s own release later this week."}, "News 2": {"title": "Economic Data Puts the EUR in Focus, with Geopolitics and COVID-19 to also Influence", "keywords": ["economic", "uk", "calendar", "cases", "covid19", "day", "provide", "eur", "data", "stats", "dollar", "focus", "writing", "influence", "puts", "geopolitics"], "publish_date": "2020-05-25", "url": "https://finance.yahoo.com/news/economic-data-puts-eur-focus-014621710.html", "summary": "Earlier in the Day:It was a particularly quiet day on the economic calendar this morning.\nThe Day Ahead:For the EURIt’s a relatively busy day ahead on the economic calendar.\nAway from the economic calendar, expect the news wires to also influence.\nFor the PoundIt’s a quiet day ahead on the economic calendar.\nFor the LoonieIt’s a quiet day on the economic calendar.", "text": "Earlier in the Day:  It was a particularly quiet day on the economic calendar this morning. There were no material stats out through the Asian session to provide any direction. A lack of stats left the markets in the hands of chatter from the weekend and the latest COVID-19 news and numbers. At the end of last week, news had hit the wires of China’s security law heading for Hong Kong, leading to some caution through the Asian markets. Strong words from both the U.S and China as tensions have built tested market risk appetite early on."}, "News 3": {"title": "Euro steadies in a big week for Europe's policymakers", "keywords": ["steadies", "kong", "hong", "national", "europes", "policymakers", "week", "euro", "fund", "109", "dollar", "recovery", "big", "european"], "publish_date": "2020-05-25", "url": "https://finance.yahoo.com/news/dollar-edges-higher-hong-kong-001445384.html", "summary": "Euro currency bills are pictured at the Croatian National Bank in ZagrebBy Saikat ChatterjeeLONDON (Reuters) - The euro steadied around the $1.09 level on Monday in a potentially big week for European policymakers as they debate the outlines of a recovery fund aimed at helping member nations.\nThe Franco-German plan sent the euro rallying above $1.10 last week before the much-expected counter proposal by the four countries pushed it back below $1.09 <EUR=EBS>.\nThe rival proposals come before the European Commission's own plans for the recovery fund on Wednesday and any watered down proposals from the original plan would be perceived as euro negative.\nMore turbulence for U.S.-China relations is prompting some investors such as UBS Wealth Management to hold a \"defensive\" position in Hong Kong.\nChina's proposed national security legislation for Hong Kong could lead to U.S. sanctions and threaten the city's status as a financial hub, White House National Security Adviser Robert O'Brien said on Sunday.", "text": "Euro currency bills are pictured at the Croatian National Bank in Zagreb  By Saikat Chatterjee  LONDON (Reuters) - The euro steadied around the $1.09 level on Monday in a potentially big week for European policymakers as they debate the outlines of a recovery fund aimed at helping member nations. Austria, Netherlands, Denmark and Sweden want loans from a time-limited fund for nations struggling to recover from the pandemic, rather than the grants proposed by France and Germany last week for the European Union's coronavirus recovery plan. The Franco-German plan sent the euro rallying above $1.10 last week before the much-expected counter proposal by the four countries pushed it back below $1.09 <EUR=EBS>. The rival proposals come before the European Commission's own plans for the recovery fund on Wednesday and any watered down proposals from the original plan would be perceived as euro negative. On the other hand, \"if the Franco-German debt proposal (miraculously) passes the test during the coming week, we reckon that it would be a major euro positive event,\" Nordea strategists said."}, "News 4": {"title": "EUR/USD Price Forecast – Euro Finding Support During Holiday", "keywords": ["support", "finding", "holiday", "eurusd", "going", "united", "level", "price", "quite", "forecast", "euro", "session", "candlestick", "ema", "bit", "likely", "day"], "publish_date": "2020-05-25", "url": "https://finance.yahoo.com/news/eur-usd-price-forecast-euro-133056557.html", "summary": "The Euro initially fell during the trading session on Monday but bounced enough to form a bit of a hammer by the time the US session started.\nWith that in mind, I would not read too much into the candlestick other than to show that the 1.09 level is a magnet for price.\nThis makes quite a bit of sense, considering that the level is essentially halfway between the floor and the ceiling of the consolidation that we have been in for some time.\nEUR/USD Video 26.05.20If we break down below the bottom of the candlestick for the Monday session is highly likely that we then go down to the 1.08 level, possibly even the 1.0750 level.\nFurthermore, just above that 1.10 level is the 200 day EMA, which of course attracts quite a bit of attention in and of itself.", "text": "The Euro initially fell during the trading session on Monday but bounced enough to form a bit of a hammer by the time the US session started. That being said, the US session was hampered as far as liquidity is concerned due to the fact that Memorial Day was being celebrated in the United States, and of course there were holidays in the United Kingdom, and several other Asian countries. With that in mind, I would not read too much into the candlestick other than to show that the 1.09 level is a magnet for price. This makes quite a bit of sense, considering that the level is essentially halfway between the floor and the ceiling of the consolidation that we have been in for some time. EUR/USD Video 26.05.20  If we break down below the bottom of the candlestick for the Monday session is highly likely that we then go down to the 1.08 level, possibly even the 1.0750 level."}, "News 5": {"title": "German labour agency expects deficit of 30.5 bln eur this year - Handelsblatt", "keywords": ["german", "handelsblatt", "bln", "eur", "billion", "expects", "labour", "deficit", "thomas", "euros", "showing", "305", "seythal", "shorttime", "unemployment", "working", "agency"], "publish_date": "2020-05-25", "url": "https://finance.yahoo.com/news/german-labour-agency-expects-deficit-100342859.html", "summary": "BERLIN, May 25 (Reuters) - Germany's Federal Labour Agency expects a deficit of 30.5 billion euros ($33.25 billion) this year due to increases in unemployment and use of a government short-time working scheme, newspaper Handelsblatt reported on Monday.\nThe business daily cited a report drafted by the agency for the parliamentary budget committee as showing it expected a deficit of 4.4 billion euros next year and 1.3 billion euros in 2022.\n($1 = 0.9173 euros) (Reporting by Michelle Martin; editing by Thomas Seythal)", "text": "BERLIN, May 25 (Reuters) - Germany's Federal Labour Agency expects a deficit of 30.5 billion euros ($33.25 billion) this year due to increases in unemployment and use of a government short-time working scheme, newspaper Handelsblatt reported on Monday. The business daily cited a report drafted by the agency for the parliamentary budget committee as showing it expected a deficit of 4.4 billion euros next year and 1.3 billion euros in 2022. ($1 = 0.9173 euros) (Reporting by Michelle Martin; editing by Thomas Seythal)"}, "News 6": {"title": "EUR/USD, NZD/USD and USD/CHF Still Waiting for a Proper Signal", "keywords": ["signal", "waiting", "eurusd", "situation", "line", "proper", "price", "upper", "triangle", "nzdusd", "rectangle", "pattern", "usdchf", "todays", "trend", "today"], "publish_date": "2020-05-25", "url": "https://finance.yahoo.com/news/eur-usd-nzd-usd-usd-095425712.html", "summary": "We will try to adjust to the current situation and in today’s analysis and show you three instruments which are still waiting for a proper trading signal.\nThe next pair is the NZDUSD which is still in a sideways trend, so a big rectangle pattern.\nMost recently, we had an upswing aiming for the upper line of the rectangle and after that – a correction.\nThe correction is shaped like a flag, so it’s promoting a breakout of its upper line and another test of the 0.616 level.\nIn case the price reverses and breaks the upper line of the triangle then we could get a buy signal.", "text": "Today is Memorial Day in US and Spring Bank Holiday in UK which means the markets should be relatively quiet and we shouldn’t expect any rapid movements or major changes on most instruments. We will try to adjust to the current situation and in today’s analysis and show you three instruments which are still waiting for a proper trading signal. First, we need to quickly update you about the situation on the EURUSD which we mentioned at the end of the last week. The price moved downwards as we had expected. Today we saw a breakout attempt of the 1.088 support level."}, "News 7": {"title": "EUR/USD Daily Forecast – Volatility Slows in Holiday-Thinned Trading", "keywords": ["stimulus", "support", "holidaythinned", "eurusd", "holiday", "week", "start", "forecast", "daily", "pair", "subdued", "germany", "slows", "volatility", "half", "trading", "second"], "publish_date": "2020-05-25", "url": "https://finance.yahoo.com/news/eur-usd-daily-forecast-volatility-093643146.html", "summary": "EUR/USD eased lower in the second half of last week and is seen trading within a tight range near the 1.0900 handle to start the new week.\nVolatility is subdued as a result of the Spring Break holiday in the UK and the Memorial Day holiday in the US.\nGDP figures from Germany showed a 2.2% contraction in the first quarter which marked the largest decline in output since the financial crisis.\nThe exchange rate rallied nearly 2% in the first half of the week after pulling back from an important resistance level.\nThere is a confluence of support that has come into play on a daily chart stemming from the 20 and 50-day moving averages.", "text": "EUR/USD eased lower in the second half of last week and is seen trading within a tight range near the 1.0900 handle to start the new week. Volatility is subdued as a result of the Spring Break holiday in the UK and the Memorial Day holiday in the US. GDP figures from Germany showed a 2.2% contraction in the first quarter which marked the largest decline in output since the financial crisis. As it is the second consecutive quarterly decline, Germany has officially entered a recession. The report showed a small increase in employment although there was a sharp drop in the average number of hours worked as a large portion of the German workforce has moved to reduced hours because of the virus outbreak."}, "no_of_news": 7}, "JPY=X": {"currency_pair": "USD/JPY", "News 1": {"title": "USD/JPY Price Forecast – US Dollar Continues Same Consolidation", "keywords": ["safety", "going", "significant", "continues", "price", "level", "little", "forecast", "consolidation", "session", "yen", "dollar", "words", "way", "usdjpy", "lower"], "publish_date": "2020-05-25", "url": "https://finance.yahoo.com/news/usd-jpy-price-forecast-us-134621121.html", "summary": "With that in mind, I look at the ¥108 level as an area that offers significant resistance.\nIf we were to break above, there then we have to focus on the 200 day EMA which is just above.\nIn other words, it is very tight all the way up to that level.\nUSD/JPY Video 26.05.20To the downside, if we were to break down a little bit the ¥107 level is a significant support level, followed by the 160 and level.\nAfter all, the Japanese yen is significant as far as safety is concerned, even more so than the US dollar under certain circumstances.", "text": "The US dollar has done truly little against the Japanese yen during the trading session on Monday, as some of the largest countries in the world had the holiday session, leading to a lack of liquidity. With that in mind, I look at the ¥108 level as an area that offers significant resistance. If we were to break above, there then we have to focus on the 200 day EMA which is just above. After that, then the ¥109 level is the next target. In other words, it is very tight all the way up to that level."}, "News 2": {"title": "GBP/JPY Price Forecast – British Pound Quiet on Memorial Day against Yen", "keywords": ["look", "offered", "united", "pound", "price", "level", "sense", "market", "forecast", "memorial", "pair", "yen", "quiet", "gbpjpy", "day", "significant", "british"], "publish_date": "2020-05-25", "url": "https://finance.yahoo.com/news/gbp-jpy-price-forecast-british-133609316.html", "summary": "The British pound gapped slightly higher against the Japanese yen to kick off the day in Asia, but with multiple countries around the world, including the United States and the United Kingdom, having holidays, the markets did truly little.\nThat being said, we can look at this market and see that the ¥132 level is an area that has offered significant resistance and has offered significant support previously.\nGBP/JPY Video 26.05.20Keep in mind that this pair is extremely sensitive to risk appetite, which of course is all over the place right now.\nIf that is going to be the case, then it makes sense that the Japanese yen would be bought.\nFor a look at all of today’s economic events, check out our economic calendar.", "text": "The British pound gapped slightly higher against the Japanese yen to kick off the day in Asia, but with multiple countries around the world, including the United States and the United Kingdom, having holidays, the markets did truly little. That being said, we can look at this market and see that the ¥132 level is an area that has offered significant resistance and has offered significant support previously. Because of this, it is likely that the market is going to continue to respect that is the top of the range, and I will be looking to sell this pair if we get anywhere near there. If we break down below the ¥131 level significantly, then it opens up a move down to the ¥130 level, followed very quickly by the ¥129 level. GBP/JPY Video 26.05.20  Keep in mind that this pair is extremely sensitive to risk appetite, which of course is all over the place right now."}, "News 3": {"title": "USD/JPY Weekly Price Forecast – US Dollar Grinding Back and Forth Against Yen", "keywords": ["grinding", "going", "rallies", "level", "price", "point", "think", "forecast", "yen", "forth", "dollar", "weekly", "bit", "reach", "prefer", "simply", "usdjpy", "massive"], "publish_date": "2020-05-22", "url": "https://finance.yahoo.com/news/usd-jpy-weekly-price-forecast-143733974.html", "summary": "The US dollar has rallied a bit during the trading week, breaking towards the ¥108 level before dropping a bit.\nI think we are simply going to go back and forth between these ranges, and therefore have to pay attention.\nAt this point, I do believe that we are more skewed to the downside, so I prefer fading rallies more than anything else.\nIf we were to break down below the ¥105 level, that is likely going to reach towards the ¥102.50 level.\nOverall, I prefer fading rallies when I get an opportunity.", "text": "The US dollar has rallied a bit during the trading week, breaking towards the ¥108 level before dropping a bit. At this point, the market looks as if it is probably going to continue to try to rollover a bit, but the one thing that is worth paying attention to is that we are currently paying attention to three different levels, the ¥109 level above as massive resistance, the ¥107 level as a magnet for price, and then the ¥105 level as massive support. I think we are simply going to go back and forth between these ranges, and therefore have to pay attention. USD/JPY Video 25.05.20  Remember that this pair is somewhat sensitive to risk appetite, but both of these are also “safety currency”, it is just that relatively speaking the Japanese yen is a bit more “safe.” Having said that, I think we are simply going back and forth in the 400 point range, and it does make sense that the levels come into play every time we reach them. At this point, I do believe that we are more skewed to the downside, so I prefer fading rallies more than anything else."}, "News 4": {"title": "GBP/JPY Weekly Price Forecast – British Pound Continues Tight Range Against Japanese Yen", "keywords": ["pound", "price", "continues", "range", "level", "forecast", "continue", "point", "particular", "noise", "yen", "japanese", "traders", "weekly", "looking", "ultimately", "longerterm", "likely", "gbpjpy", "tight"], "publish_date": "2020-05-22", "url": "https://finance.yahoo.com/news/gbp-jpy-weekly-price-forecast-142446220.html", "summary": "The British pound rallied significantly during the week, but then gave back the gains rather quickly at the ¥132 level.\nThe weekly chart looks very noisy down here, as we are at extreme lows.\nUltimately, this is a market that is going to continue to see noise due to the fact that the area just below the ¥129 level has been fought over so drastically.\nAt this point, fading rallies should continue to offer opportunities, and therefore it is likely that we will see selling pressure every time it gets ahead of itself.\nUltimately though, longer-term traders are probably better served looking at shorter-term charts when it comes to trading this particular pair and in this particular environment.", "text": "The British pound rallied significantly during the week, but then gave back the gains rather quickly at the ¥132 level. The weekly chart looks very noisy down here, as we are at extreme lows. Ultimately, this is a market that is going to continue to see noise due to the fact that the area just below the ¥129 level has been fought over so drastically. I believe at this point it is likely we will continue to see traders try to build up a little bit of momentum in this area, but if we were to break down below it is likely that we will then flush lower, perhaps all the way down to the ¥125 level. GBP/JPY Video 25.05.20  To the upside, if we can take out the ¥132 level it is likely that we could go looking towards ¥135 level where I would see even more resistance and would be much more willing to start shorting."}, "News 5": {"title": "USD/JPY Price Forecast – US Dollar Continues to Grind Back and Forth Against Yen", "keywords": ["seen", "trading", "rallies", "continues", "price", "market", "type", "range", "forecast", "backandforth", "session", "yen", "forth", "dollar", "bit", "grind", "usdjpy", "probably"], "publish_date": "2020-05-22", "url": "https://finance.yahoo.com/news/usd-jpy-price-forecast-us-131634968.html", "summary": "The US dollar has gone back and forth during the session on Friday against the Japanese yen as we are dancing around the 50 day EMA.\nFurthermore, one thing that you should pay attention to is that every time the market rallies we have seen a bit of exhaustion.\nThe market simply sees this as a back-and-forth type of situation and therefore it will probably continue to be a bit difficult.\nUSD/JPY Video 25.05.20Furthermore, the market seems to be stuck in a bit of a range between ¥108 and ¥107.\nI do not see any reason why this market will break out of this range, so ultimately fading rallies probably works out best.", "text": "The US dollar has gone back and forth during the session on Friday against the Japanese yen as we are dancing around the 50 day EMA. Furthermore, the ¥107.50 level has been a magnet for price. Furthermore, one thing that you should pay attention to is that every time the market rallies we have seen a bit of exhaustion. From the very beginning of the session, it has been very choppy during the day in the USD/JPY pair. The market simply sees this as a back-and-forth type of situation and therefore it will probably continue to be a bit difficult."}, "News 6": {"title": "GBP/JPY Price Forecast – British Pound Rolls Over Against Yen", "keywords": ["underneath", "rallies", "pound", "price", "level", "market", "quite", "forecast", "continue", "yen", "rolls", "japanese", "possibly", "upside", "gbpjpy", "british"], "publish_date": "2020-05-22", "url": "https://finance.yahoo.com/news/gbp-jpy-price-forecast-british-130809297.html", "summary": "The British pound has initially tried to rally during the trading session on Friday but found the ¥132 level quite resilient as far as selling is concerned, and we have drifted lower from there.\nUltimately, this is a market that I think will start looking towards the ¥130 level underneath, possibly even the ¥129 level.\nAfter all, the Japanese yen is considered to be a “safety currency”, so this pair tends to continue falling if there is a lot of negativity out there.\nGBP/JPY Video 25.05.20If we can break down below the lows underneath, somewhere closer to the ¥129 level, it is likely that we could go to the ¥127.50 level, possibly even down to the ¥125 level.\nWith that in mind, it is crucial that you keep your position size relatively small but look at rallies as opportunities to pick up the Japanese yen “on the cheap.”This article was originally posted on FX EmpireMore From FXEMPIRE:", "text": "The British pound has initially tried to rally during the trading session on Friday but found the ¥132 level quite resilient as far as selling is concerned, and we have drifted lower from there. Ultimately, this is a market that I think will start looking towards the ¥130 level underneath, possibly even the ¥129 level. Because of this, the market is continuing to “sell the rallies”, which makes quite a bit of sense considering how many negative headlines there are out there just waiting to cause issues. After all, the Japanese yen is considered to be a “safety currency”, so this pair tends to continue falling if there is a lot of negativity out there. I do believe that is going to continue to be the case, so therefore I like the idea of fading short-term rallies every time we get an opportunity to."}, "News 7": {"title": "Dollar Climbs as Hong Kong Security Law Revives U.S.-China Tension", "keywords": ["climbs", "kong", "hong", "tension", "interest", "fell", "yuan", "twomonth", "target", "02", "tensions", "uschina", "law", "revives", "dollar", "traded", "security"], "publish_date": "2020-05-22", "url": "https://finance.yahoo.com/news/dollar-climbs-hong-kong-security-025038051.html", "summary": "By Peter NurseInvesting.com - The U.S. dollar was in demand during early European trade Friday as simmering U.S.-China tensions flared up, prompting investors to seek the traditional safe haven.\nAt 2:45 AM ET (0645 GMT), the U.S. Dollar Index, which tracks the greenback against a basket of six other currencies, stood at 99.627, up 0.2%, EUR/USD dropped 0.2% to 1.0925, while GBP/USD fell 0.2% to 1.2203.\nThe latest source of Sino-U.S. disagreement came after Beijing moved to impose a new security law on Hong Kong after last year's pro-democracy unrest.\nUSD/TRY traded 0.2% higher at 6.7946 and USD/ZAR up 0.8% at 17.7113.\nRelated ArticlesU.K. Posts Largest Budget Deficit Since Modern Records BeganIndia Unexpectedly Cuts Interest Rates as GDP Set to ShrinkDollar Up on Back of Increasing U.S.-China Tensions Over HK National Security Laws", "text": "By Peter Nurse  Investing.com - The U.S. dollar was in demand during early European trade Friday as simmering U.S.-China tensions flared up, prompting investors to seek the traditional safe haven. At 2:45 AM ET (0645 GMT), the U.S. Dollar Index, which tracks the greenback against a basket of six other currencies, stood at 99.627, up 0.2%, EUR/USD dropped 0.2% to 1.0925, while GBP/USD fell 0.2% to 1.2203. The latest source of Sino-U.S. disagreement came after Beijing moved to impose a new security law on Hong Kong after last year's pro-democracy unrest. The decision drew a warning from President Donald Trump that Washington would react \"very strongly\" against the attempt to gain more control over the former British colony. The yuan has also been hit by China's decision to omit an economic growth target for 2020, which renewed concerns that the fallout from the coronavirus pandemic will last longer than originally expected."}, "no_of_news": 7}, "GBPUSD=X": {"currency_pair": "GBP/USD", "News 1": {"title": "GBP/USD Price Forecast – British Pound Quiet During Holiday", "keywords": ["holiday", "united", "pound", "price", "point", "level", "continue", "gbpusd", "forecast", "various", "read", "looking", "states", "quiet", "british"], "publish_date": "2020-05-25", "url": "https://finance.yahoo.com/news/gbp-usd-price-forecast-british-134037368.html", "summary": "The British pound has rallied slightly during the trading session on Monday, but I would not read too much into this considering that both the United States and the United Kingdom were away for various holidays.\nFurthermore, the Asian countries had various holidays going on as well, so I would not read too much into the candlestick other than it was a quiet day.\nGBP/USD Video 26.05.20Looking at the chart, it certainly looks as if the British pound is struggling a bit in general, so it makes sense to me that we do rollover given enough time.\nAt this point in time, I do believe that we are going to continue to see sellers, especially near the 1.23 level.\nAt this point, I do not have a scenario in which I am looking to buy the British pound, because clearly it continues to fail every time it rallies.", "text": "The British pound has rallied slightly during the trading session on Monday, but I would not read too much into this considering that both the United States and the United Kingdom were away for various holidays. Furthermore, the Asian countries had various holidays going on as well, so I would not read too much into the candlestick other than it was a quiet day. GBP/USD Video 26.05.20  Looking at the chart, it certainly looks as if the British pound is struggling a bit in general, so it makes sense to me that we do rollover given enough time. The 1.23 level above has been rather resistive, and I expect that to continue, as there are plenty of concerns out there to keep this market somewhat low. At this point, the United States dollar course will continue to be a bullish currency, due to the fact that the global economy is a bit of a mixed, and quite frankly unsettled economy at the moment."}, "News 2": {"title": "Economic Data Puts the EUR in Focus, with Geopolitics and COVID-19 to also Influence", "keywords": ["economic", "uk", "calendar", "cases", "covid19", "day", "provide", "eur", "data", "stats", "dollar", "focus", "writing", "influence", "puts", "geopolitics"], "publish_date": "2020-05-25", "url": "https://finance.yahoo.com/news/economic-data-puts-eur-focus-014621710.html", "summary": "Earlier in the Day:It was a particularly quiet day on the economic calendar this morning.\nThe Day Ahead:For the EURIt’s a relatively busy day ahead on the economic calendar.\nAway from the economic calendar, expect the news wires to also influence.\nFor the PoundIt’s a quiet day ahead on the economic calendar.\nFor the LoonieIt’s a quiet day on the economic calendar.", "text": "Earlier in the Day:  It was a particularly quiet day on the economic calendar this morning. There were no material stats out through the Asian session to provide any direction. A lack of stats left the markets in the hands of chatter from the weekend and the latest COVID-19 news and numbers. At the end of last week, news had hit the wires of China’s security law heading for Hong Kong, leading to some caution through the Asian markets. Strong words from both the U.S and China as tensions have built tested market risk appetite early on."}, "News 3": {"title": "GBP/JPY Price Forecast – British Pound Quiet on Memorial Day against Yen", "keywords": ["look", "offered", "united", "pound", "price", "level", "sense", "market", "forecast", "memorial", "pair", "yen", "quiet", "gbpjpy", "day", "significant", "british"], "publish_date": "2020-05-25", "url": "https://finance.yahoo.com/news/gbp-jpy-price-forecast-british-133609316.html", "summary": "The British pound gapped slightly higher against the Japanese yen to kick off the day in Asia, but with multiple countries around the world, including the United States and the United Kingdom, having holidays, the markets did truly little.\nThat being said, we can look at this market and see that the ¥132 level is an area that has offered significant resistance and has offered significant support previously.\nGBP/JPY Video 26.05.20Keep in mind that this pair is extremely sensitive to risk appetite, which of course is all over the place right now.\nIf that is going to be the case, then it makes sense that the Japanese yen would be bought.\nFor a look at all of today’s economic events, check out our economic calendar.", "text": "The British pound gapped slightly higher against the Japanese yen to kick off the day in Asia, but with multiple countries around the world, including the United States and the United Kingdom, having holidays, the markets did truly little. That being said, we can look at this market and see that the ¥132 level is an area that has offered significant resistance and has offered significant support previously. Because of this, it is likely that the market is going to continue to respect that is the top of the range, and I will be looking to sell this pair if we get anywhere near there. If we break down below the ¥131 level significantly, then it opens up a move down to the ¥130 level, followed very quickly by the ¥129 level. GBP/JPY Video 26.05.20  Keep in mind that this pair is extremely sensitive to risk appetite, which of course is all over the place right now."}, "News 4": {"title": "GBP/USD Struggles to Gain Downside Momentum After Failure at Key Resistance", "keywords": ["struggles", "failure", "channel", "exchange", "gain", "momentum", "gbpusd", "key", "week", "downside", "rate", "members", "early", "posted", "bank", "resistance"], "publish_date": "2020-05-25", "url": "https://finance.yahoo.com/news/gbp-usd-struggles-gain-downside-100932327.html", "summary": "GBP/USD gained early last week but sellers dominated a critical resistance area and the exchange rate pared some gains in the second half of the week.\nThere were important developments last week, and the reaction in the exchange rate points to underlying strength.\nHowever, despite the more dovish tone from central bank members last week, the pound to dollar exchange rate still closed the week with a small gain.\nThis creates a notable diversion between what is expected in terms of monetary policy and how the exchange rate is reacting.\nDownside momentum is lacking following a rejection of key resistance last week.", "text": "GBP/USD gained early last week but sellers dominated a critical resistance area and the exchange rate pared some gains in the second half of the week. There were important developments last week, and the reaction in the exchange rate points to underlying strength. Throughout the week, several members of the Bank of England discussed their latest views on monetary policy. The predominant theme was that policymakers are looking at methods to ease further and are not dismissing unconventional measures such as negative interest rates. This is in sharp contrast to the message after the BoE met earlier this month."}, "News 5": {"title": "GBP/USD Aims at 1.20 Target After Breakout", "keywords": ["fibonacci", "break", "aims", "price", "gbpusd", "50", "target", "120", "breakout", "bearish", "wave", "analysis", "zone", "resistance"], "publish_date": "2020-05-25", "url": "https://finance.yahoo.com/news/gbp-usd-aims-1-20-071715326.html", "summary": "The target of the bearish break is aiming at the round 1.20 level.\nThere is a confluence of Wizz 7 and 161.8% Fibonacci target (red circles).\nIf price action, however, breaks above the resistance line (orange), then a deeper retracement towards the 50% Fibonacci level is expected.\nGood trading,Chris SvorcikThe analysis has been done with the indicators and template from the SWAT method (simple wave analysis and trading).\nFor more daily technical and wave analysis and updates, sign-up up to our newsletterFor a look at all of today’s economic events, check out our economic calendar.", "text": "Dear traders, the GBP/USD is in a clear downtrend. But price will first need to break the support zone (green line)… Otherwise there is a risk of a deeper pullback towards the 50% Fibonacci resistance. Let’s review. 1 hour chart  The GBP/USD bearish breakout would confirm (green check) the downtrend continuation. The bearish trend looks strong when considering the Moving Averages (MA)."}, "News 6": {"title": "GBP/USD Daily Forecast – Support At 1.2170 In Sight", "keywords": ["support", "economic", "12250", "uk", "level", "gbpusd", "daily", "forecast", "downside", "dollar", "sight", "upside", "12170", "resistance"], "publish_date": "2020-05-25", "url": "https://finance.yahoo.com/news/gbp-usd-daily-forecast-support-070505395.html", "summary": "Technical AnalysisGBP/USD has settled near the first material support level at 1.2170.\nIf this level is breached to the downside, GBP/USD will likely gain additional downside momentum and head towards the next support level at the recent lows at 1.2080.\nIn this scenario, GBP/USD should have better chances to get below the support at 1.2080.\nI’d note that GBP/USD has recently failed to settle above the key resistance level at 1.2250 and confirmed the existing downside trend.\nOn the upside, the above-mentioned major resistance at 1.2250 is the first important resistance level for GBP/USD.", "text": "GBP/USD Video 25.05.20. U.S. – China Tensions Provide Support To The U.S. Dollar  GBP/USD is flat in a quiet trading session as the financial markets in the U.S. and UK are closed for holidays. The U.S. Dollar Index, which measures the strength of the U.S. dollar against a broad basket of currencies, has settled near the 100 level. In recent days, the U.S. dollar was supported by increasing U.S. – China tensions due to Hong Kong security law. The U.S. has already signaled that the implementation of the law may lead to U.S. sanctions, worsening an already challenging relationship between the two biggest economies at a time when the world economy tries to recover from the acute phase of the coronavirus crisis."}, "News 7": {"title": "The Week Ahead – Geopolitics, Central Banks and COVID-19 in Focus", "keywords": ["economic", "numbers", "covid19", "pound", "include", "week", "central", "figures", "ahead", "stats", "focus", "expect", "banks", "markets", "geopolitics"], "publish_date": "2020-05-24", "url": "https://finance.yahoo.com/news/week-ahead-geopolitics-central-banks-022320858.html", "summary": "On the MacroIt’s a busy week ahead on the economic calendar, with 57 stats in focus in the week ending 22nd May.\nFor the Dollar:It’s a relatively busy week ahead on the economic data front.\nFor the EUR:It’s another busy week ahead on the economic data front.\nOut of AsiaFor the Aussie Dollar:It’s another quiet week ahead for the Aussie Dollar.\nKey stats include 1st quarter construction work done and private new CAPEX on Wednesday and Thursday.", "text": "On the Macro  It’s a busy week ahead on the economic calendar, with 57 stats in focus in the week ending 22nd May. In the week prior, 57 stats had also been in focus. For the Dollar:  It’s a relatively busy week ahead on the economic data front. A quiet 1st half of the week leaves May consumer confidence figures in focus on Tuesday. The markets will be looking for a pickup in confidence as the government eases lockdown measures."}, "no_of_news": 7}, "EURJPY=X": {"currency_pair": "EUR/JPY", "News 1": {"title": "Morgan Stanley says it's now neutral on euro due to the French-German recovery fund proposal", "keywords": ["frenchgerman", "risk", "catalyst", "trade", "euro", "proposal", "neutral", "fund", "downside", "yen", "recovery", "vs", "morgan", "stanley"], "publish_date": "2020-05-21", "url": "https://www.marketwatch.com/story/morgan-stanley-says-its-now-neutral-on-euro-due-to-the-french-german-recovery-fund-proposal-2020-05-21?siteid=yhoof2&yptr=yahoo", "summary": "Morgan Stanley said it's turned neutral on the euro due to what it said was the \"bold\" Franco-German proposal for a 500 billion euro recovery fund, saying the \"proposal takes out the downside tail risk for the euro and euro crosses.\"\nIt no longer recommends a short euro vs. Japanese yen EURJPY, +0.34% trade and says the euro vs. the dollar EURUSD, +0.21% \"could trade in the 1.0690-1.1150 range for some time but is now more likely to break out to the upside than the downside.\"\nEquity investors should view the proposed recovery fund primarily as a potential catalyst to drive regional risk premia lower, rather than a catalyst for stronger growth, the bank said.", "text": "Morgan Stanley said it's turned neutral on the euro due to what it said was the \"bold\" Franco-German proposal for a 500 billion euro recovery fund, saying the \"proposal takes out the downside tail risk for the euro and euro crosses.\" It no longer recommends a short euro vs. Japanese yen EURJPY, +0.34% trade and says the euro vs. the dollar EURUSD, +0.21% \"could trade in the 1.0690-1.1150 range for some time but is now more likely to break out to the upside than the downside.\" Equity investors should view the proposed recovery fund primarily as a potential catalyst to drive regional risk premia lower, rather than a catalyst for stronger growth, the bank said."}, "no_of_news": 1}}, "INDICES": {"^DJI": {"Index Name": "Dow Jones Industrial Average", "News 1": {"title": "Dow Jones Futures Jump; Apple, Tesla, AMD Near Buy Points In Coronavirus Stock Market Rally", "keywords": ["coronavirus", "near", "market", "stocks", "jones", "dow", "stock", "week", "rose", "buy", "futures", "points", "rally", "sp", "jump", "tesla"], "publish_date": "2020-05-26", "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-coronavirus-stock-market-rally-apple-tesla-amd-buy-points/?src=A00220&yptr=yahoo", "summary": "Dow Jones Futures TodayDow Jones futures rose 2.1% vs. fair value.\nStock Market Update: The Bull Rages To Higher GroundCoronavirus Stock Market RallyThe coronavirus stock market rally quietly had another strong week.\nThe S&P 500 confirmed the coronavirus stock market rally on April 2, with the Nasdaq following through on April 6.\nBut moved higher during the market crash and the coronavirus stock market rally.\nThe real concern with AMD stock isn't its performance vs. the broader stock market rally but relative to other data-center chip stocks.", "text": "Dow Jones futures rose sharply early Tuesday morning, along with S&P 500 futures and Nasdaq futures, after U.S. markets were closed for Memorial Day. The coronavirus stock market rally powered ahead last week, with the Nasdaq nearing all-time highs and the S&P 500 closing in on a key level. Apple (AAPL), Microsoft (MSFT), Google parent Alphabet (GOOGL), Tesla (TSLA) and Advanced Micro Devices (AMD) are all near buy points. X  None of these stocks seem particularly eager to break out, despite a strong week for the coronavirus market rally. Apple stock and Google stock both edged past buy points last week, but never closed above them."}, "News 2": {"title": "Stock market news live updates: Stock futures open higher, Dow futures gain 200+ points", "keywords": ["trial", "updates", "recently", "weeks", "market", "higher", "gain", "dow", "stock", "data", "rose", "open", "futures", "points", "coronavirus", "live"], "publish_date": "2020-05-25", "url": "https://finance.yahoo.com/news/stock-market-news-live-may-26-2020-221306503.html", "summary": "Stock futures jumped Monday evening, pacing toward advances Tuesday when traders return from the Memorial Day holiday weekend in the U.S. Contracts on each of the S&P 500, Dow and Nasdaq rose more than 1% shortly after futures began trading after 6 p.m.\nIndividual companies and institutions also announced new developments around potential coronavirus treatments and vaccines over the long weekend.\nNovavax (NVAX) said Monday it began human testing of its coronavirus vaccine candidate, and expects preliminary results around the trial in July.\nET Monday: Stock futures open higherHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:01 p.m.\nFind live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay", "text": "Stock futures jumped Monday evening, pacing toward advances Tuesday when traders return from the Memorial Day holiday weekend in the U.S. Contracts on each of the S&P 500, Dow and Nasdaq rose more than 1% shortly after futures began trading after 6 p.m. ET. Overseas, equities in Asia also rose, though market participants continued to eye developments around Hong Kong after China announced a new national security law that would give it more control over Hong Kong, potentially stirring up further volatility in the region and further straining relations with the U.S., with whom Hong Kong holds special trade status. Developments around the coronavirus outbreak still remained front and center for many market participants, though signs of improving consumer behavior in the U.S. after weeks of social distancing have recently started to take hold. Transportation Security Administration (TSA) data showed the number of travelers passing through checkpoints north of 250,000 for each of Saturday and Sunday, which, while still well below the more than 2 million during the same days last year, was well above the just 87,534 travelers from mid-April."}, "News 3": {"title": "Dow Jones Stocks To Buy And Watch In Coronavirus Stock Market Rally: Apple, Microsoft", "keywords": ["coronavirus", "stocks", "market", "point", "jones", "dow", "stock", "ibd", "shares", "buy", "johnson", "microsoft", "rally", "watch"], "publish_date": "2020-05-25", "url": "https://www.investors.com/research/dow-jones-stocks/?src=A00220&yptr=yahoo", "summary": "Top Dow Jones stocks to watch in May are Apple (AAPL), Home Depot (HD), Intel (INTC), Johnson & Johnson (JNJ) and Microsoft (MSFT).\nThe three biggest losers through April were Boeing (BA), Exxon Mobil (XOM) and Dow (DOW) with declines of 56.7%, 33.4% and 33%, respectively.\nPotential Dow Jones stocks to buy and watch in May that are in or near buy zones include tech giants Apple, Intel and Microsoft.\nJohnson & Johnson StockOn April 23, Johnson & Johnson cleared a 154.60 buy point in a cup base.\nYOU MAY ALSO LIKE:Top Growth Stocks To Buy And WatchCoronavirus Stock Market Crash Survival GuideIBD's ETF Stock Market StrategySee Updates To IBD Stock ListsLooking For The Next Big Stock Market Winners?", "text": "The Dow Jones Industrial Average rallied sharply in April, as the stock market snapped back from the coronavirus crash. Top Dow Jones stocks to watch in May are Apple (AAPL), Home Depot (HD), Intel (INTC), Johnson & Johnson (JNJ) and Microsoft (MSFT). X  Apple and Microsoft offer new buy points amid ongoing breakout moves. Home Depot is also approaching a new alternate buy point amid its latest breakout move. Meanwhile, Intel is just above its newest buy point."}, "News 4": {"title": "Is the stock market closed today? Here’s everything investors need to know about Memorial Day trading hours and closures", "keywords": ["investors", "holiday", "welcome", "nasdaq", "york", "market", "exchange", "stock", "hours", "memorial", "heres", "closed", "remain", "know", "need", "day", "trading", "today"], "publish_date": "2020-05-22", "url": "https://www.marketwatch.com/story/is-the-stock-market-closed-today-heres-everything-investors-need-to-know-about-memorial-day-trading-hours-and-closures-2020-05-22?siteid=yhoof2&yptr=yahoo", "summary": "Memorial Day will take on an even more somber tone this year.\nFor its part, the financial market has been attempting to claw back mightily from a rout inspired by the economic impacts of the viral outbreak.\nThe Nasdaq Inc. NDAQ, +1.18% , which operates the Nasdaq will be closed on Monday, Memorial Day; and the New York Stock Exchange, owned by Intercontinental Exchange Inc. ICE, +0.98% , also will be shuttered for the holiday.\nThe Securities Industry and Financial Markets Association, a brokerage-industry trade group that sets procedures for the bond market, advises bond dealers to close an hour early, at 2 p.m. Eastern on Friday, and remain closed on Monday.\nRegular trading for U.S. oil CL.1, +3.42% on the New York Mercantile Exchange and metals GC.1, -0.47% on Comex will be closed for Memorial Day.", "text": "Memorial Day will take on an even more somber tone this year. The occasion honors the women and men who died serving their country, and the holiday has become an unofficial start to summer, synonymous with backyard barbecues and festive parades. This year, however, the public-health crisis that has stricken the globe will offer an additional dimension to the act of service, sacrifice and patriotism in America. Coronavirus has claimed over 97,000 American lives and 45 million jobs, by one measure, and accelerated seismic shifts in the economy, hastening the bankruptcies of some major retail chains, including J.C. Penney Co. JCPNQ, +7.23% , Pier 1 Imports Inc. PIRRQ, +7.14% and Hertz Global Holdings Inc. HTZ, -7.49%  And most Americans are still largely shut in at home, as baseball stadiums and malls remain empty. That said, the holiday is likely to be viewed as a welcome point for reflection about what’s transpired over the past month, with public-health professionals, store workers and delivery staff on the front lines of the battle against an invisible assailant."}, "News 5": {"title": "Are stock investors too complacent about a full-scale blowup between China and the U.S.? Here’s what Wall Street experts say", "keywords": ["fullscale", "investors", "say", "world", "wall", "experts", "market", "street", "think", "case", "schatz", "stock", "heres", "china", "trump", "complacent", "told", "president"], "publish_date": "2020-05-23", "url": "https://www.marketwatch.com/story/are-stock-investors-too-complacent-about-a-full-scale-blowup-between-china-and-the-us-heres-what-wall-street-experts-say-2020-05-23?siteid=yhoof2&yptr=yahoo", "summary": "China and the U.S. are back in the headlines — but are investors paying sufficient attention to the risks of a geopolitical clash?\nHere’s everything investors need to know about Memorial Day trading hours and closuresIndeed, caustic rhetoric between the No.\nAs the worries with China heat up, we do think investors could be a little too complacent here and now,” said Ryan Detrick, senior market strategist at LPL Financial.\nAs for China, Schatz says he believes Trump is unlikely to jeopardize deepening the economic pain the U.S. is facing by locking horns with his counterpart President Xi Jinping.\n“I don’t think Trump et al will do anything to further jeopardize the economy and what will be a nascent recovery.", "text": "China and the U.S. are back in the headlines — but are investors paying sufficient attention to the risks of a geopolitical clash? Read: Is the stock market closed today? Here’s everything investors need to know about Memorial Day trading hours and closures  Indeed, caustic rhetoric between the No. 1 and 2 economies in the world is intensifying — again. It may feel as if the animus between the global superpowers couldn’t come at a more inopportune time: in the middle of a pandemic, which notably was first identified in Wuhan, China in December, and has infected more than 5 million people around the world, according to data aggregated by Johns Hopkins University."}, "no_of_news": 5}, "^BSESN": {"Index Name": "S&P BSE SENSEX", "News 1": {"title": "Prospect of $35 billion telecom deal shows M&A not entirely sidelined by coronavirus pandemic", "keywords": ["virgin", "uk", "mobile", "deal", "entirely", "billion", "liberty", "global", "sidelined", "shows", "telecom", "telefónica", "pandemic", "ma", "prospect", "cable", "coronavirus", "million"], "publish_date": "2020-05-04", "url": "https://www.marketwatch.com/story/liberty-global-and-telefonica-in-advanced-talks-to-create-28-billion-uk-telecoms-group-2020-05-04?siteid=yhoof2&yptr=yahoo", "summary": "Liberty Global declined to comment.\nIn midday Monday trades Liberty Global shares were up 0.4% while the Telefónica ADRs were off 2.8%.\nA deal with Liberty Global would help it significantly reduce the Spanish telecommunications giant’s heavy debt load, which stood at almost €37 billion at the end of 2019.\nLiberty Global bought Virgin Media, which offers pay-television, broadband and phone packages in the U.K., in a cash-and-stock deal worth $23.3 billion in 2013.\nIn the U.K., Virgin competes with Sky, which is owned by Comcast CMCSA, -0.53% , in pay TV, and with BT and Sky in broadband.", "text": "Spain’s Telefónica TEF, +3.04% said on Monday that it is in talks with U.S. tycoon John Malone’s cable group Liberty Global over a possible merger of their U.K. operations, in a deal that would create a new television and mobile company with a combined value of almost £28 billion, including debt and anticipated synergies. The Spanish telecom group said discussions to combine its O2 mobile business with Liberty Global’s LBTYA, -0.26% Virgin Media cable network were in “negotiation phase,” and it couldn't guarantee the precise terms of the deal or the probability of its success. However, people close to the situation said the talks were at an advanced stage and a deal could be announced as early as Thursday, when Telefónica is due to report its first-quarter earnings. If it’s pulled off, the deal would radically reshape the U.K telecommunications industry, creating a competitor to the country’s current top operator BT Group BT.A, +0.95% by combining the 34 million customers on O2’s mobile network with Virgin Media’s 3.3 million mobile customers and its 6 million broadband users. Analysts at New Street Research said a combination of O2 and Virgin Media could create a business worth £28 billion, including debt and synergies."}, "no_of_news": 1}, "^GSPC": {"Index Name": "S&P 500", "News 1": {"title": "Global Stocks Climb, Shrugging Off China Tensions: Markets Wrap", "keywords": ["climb", "signs", "stocks", "index", "wrap", "global", "rose", "futures", "weekend", "yields", "china", "sp", "remain", "bloomberg", "markets", "shrugging", "tensions"], "publish_date": "2020-05-26", "url": "https://finance.yahoo.com/news/asian-stocks-look-set-gains-220826039.html", "summary": "(Bloomberg) -- Asian stocks climbed with U.S. and European futures Tuesday despite escalating geopolitical risks, with Japan leading gains as the world’s third-largest economy reopened.\nFutures on the S&P 500 were up on Friday’s close, suggesting a positive open on Wall Street.\nShares rose in Tokyo, Sydney and Seoul, while Hong Kong stocks also pushed higher, showing signs of stabilizing after weekend unrest.\nThese are the main moves in markets:StocksJapan’s Topix Index rose 2.1% as of 1:31 p.m. in Tokyo.Futures on the S&P 500 were up 1.9% from Friday.Australia’s S&P/ASX 200 Index gained 2.4%.Kospi Index rose 1.8%.Hong Kong’s Hang Seng Index rose 1.9%.Shanghai Composite Index rose 0.7%.Euro Stoxx 50 futures rose 1.3%.\nBondsU.S. 10-year Treasury yields rose two basis points to 0.68%.Australia’s 10-year bond yields rose one basis point to 0.87%.", "text": "(Bloomberg) -- Asian stocks climbed with U.S. and European futures Tuesday despite escalating geopolitical risks, with Japan leading gains as the world’s third-largest economy reopened. Treasuries dipped in early trading after the three-day U.S. weekend, while the dollar retreated. Futures on the S&P 500 were up on Friday’s close, suggesting a positive open on Wall Street. Shares rose in Tokyo, Sydney and Seoul, while Hong Kong stocks also pushed higher, showing signs of stabilizing after weekend unrest. Shanghai saw more modest gains."}, "News 2": {"title": "Dow Jones Futures Jump; Apple, Tesla, AMD Near Buy Points In Coronavirus Stock Market Rally", "keywords": ["coronavirus", "near", "market", "stocks", "jones", "dow", "stock", "week", "rose", "buy", "futures", "points", "rally", "sp", "jump", "tesla"], "publish_date": "2020-05-26", "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-coronavirus-stock-market-rally-apple-tesla-amd-buy-points/?src=A00220&yptr=yahoo", "summary": "Dow Jones Futures TodayDow Jones futures rose 2.1% vs. fair value.\nStock Market Update: The Bull Rages To Higher GroundCoronavirus Stock Market RallyThe coronavirus stock market rally quietly had another strong week.\nThe S&P 500 confirmed the coronavirus stock market rally on April 2, with the Nasdaq following through on April 6.\nBut moved higher during the market crash and the coronavirus stock market rally.\nThe real concern with AMD stock isn't its performance vs. the broader stock market rally but relative to other data-center chip stocks.", "text": "Dow Jones futures rose sharply early Tuesday morning, along with S&P 500 futures and Nasdaq futures, after U.S. markets were closed for Memorial Day. The coronavirus stock market rally powered ahead last week, with the Nasdaq nearing all-time highs and the S&P 500 closing in on a key level. Apple (AAPL), Microsoft (MSFT), Google parent Alphabet (GOOGL), Tesla (TSLA) and Advanced Micro Devices (AMD) are all near buy points. X  None of these stocks seem particularly eager to break out, despite a strong week for the coronavirus market rally. Apple stock and Google stock both edged past buy points last week, but never closed above them."}, "News 3": {"title": "Global Markets: Japan shares hit 10-week peak, S&P 500 tests 3,000", "keywords": ["3000", "investors", "week", "japan", "wayne", "hit", "shares", "tests", "global", "500", "peak", "trade", "past", "sp", "futures", "dollar", "central", "yields", "markets", "tensions"], "publish_date": "2020-05-26", "url": "https://finance.yahoo.com/news/global-markets-japan-shares-reach-022954249.html", "summary": "MSCI's broadest index of Asia-Pacific shares outside Japan <.MIAPJ0000PUS> added 1.4%, while South Korea <.KS11> rose 1.1%.\nWhile Wall Street had been shut on Monday, E-Mini futures for the S&P 500 climbed 1.3% to test the 3,000 level.\nThe euro was a shade firmer $1.0910, having spent the month so far wandering between $1.0765 and $1.1017.\nAnalysts at CBA felt the dollar could break higher should China-U.S. tensions actually threaten their trade deal.\nBrent crude futures rose 34 cents to $35.87 a barrel, while U.S. crude gained 82 cents to $34.07.", "text": "A passerby walks past in front of a stock quotation board outside a brokerage in Tokyo  By Wayne Cole  SYDNEY (Reuters) - Asian shares forged ahead on Tuesday while U.S. stock futures challenged a major chart barrier as investors looked past Sino-U.S. trade tensions to more stimulus in China and a re-opening world economy. Japan's Nikkei <.N225> led the way with a rise of 2% to its highest since early March when the economic impact of the coronavirus was just becoming clear. MSCI's broadest index of Asia-Pacific shares outside Japan <.MIAPJ0000PUS> added 1.4%, while South Korea <.KS11> rose 1.1%. While Wall Street had been shut on Monday, E-Mini futures for the S&P 500 climbed 1.3% to test the 3,000 level. EUROSTOXX 50 futures added 0.6% and FTSE futures 1.8%."}, "News 4": {"title": "Japan shares hit 10-week peak, S&P 500 tests 3,000", "keywords": ["3000", "investors", "japan", "wayne", "hit", "shares", "tests", "500", "trade", "peak", "central", "week", "sp", "futures", "dollar", "10week", "yields", "usd", "tensions"], "publish_date": "2020-05-26", "url": "https://finance.yahoo.com/news/japan-shares-reach-10-week-003251613.html", "summary": "MSCI's broadest index of Asia-Pacific shares outside Japan <.MIAPJ0000PUS> added 1.4%, while South Korea <.KS11> rose 1.1%.\nWhile Wall Street had been shut on Monday, E-Mini futures for the S&P 500 <ESc1> climbed 1.3% to test the 3,000 level.\nThe euro was a shade firmer $1.0910 <EUR=>, having spent the month so far wandering between $1.0765 and $1.1017.\nAnalysts at CBA felt the dollar could break higher should China-U.S. tensions actually threaten their trade deal.\nBrent crude <LCOc1> futures rose 34 cents to $35.87 a barrel, while U.S. crude <CLc1> gained 82 cents to $34.07.", "text": "By Wayne Cole  SYDNEY (Reuters) - Asian shares forged ahead on Tuesday while U.S. stock futures challenged a major chart barrier as investors looked past Sino-U.S. trade tensions to more stimulus in China and a re-opening world economy. Japan's Nikkei <.N225> led the way with a rise of 2% to its highest since early March when the economic impact of the coronavirus was just becoming clear. MSCI's broadest index of Asia-Pacific shares outside Japan <.MIAPJ0000PUS> added 1.4%, while South Korea <.KS11> rose 1.1%. While Wall Street had been shut on Monday, E-Mini futures for the S&P 500 <ESc1> climbed 1.3% to test the 3,000 level. EUROSTOXX 50 futures <STXEc1> added 0.6% and FTSE futures <FFIc1> 1.8%."}, "News 5": {"title": "Stock market news live updates: Stock futures open higher, Dow futures gain 200+ points", "keywords": ["trial", "updates", "recently", "weeks", "market", "higher", "gain", "dow", "stock", "data", "rose", "open", "futures", "points", "coronavirus", "live"], "publish_date": "2020-05-25", "url": "https://finance.yahoo.com/news/stock-market-news-live-may-26-2020-221306503.html", "summary": "Stock futures jumped Monday evening, pacing toward advances Tuesday when traders return from the Memorial Day holiday weekend in the U.S. Contracts on each of the S&P 500, Dow and Nasdaq rose more than 1% shortly after futures began trading after 6 p.m.\nIndividual companies and institutions also announced new developments around potential coronavirus treatments and vaccines over the long weekend.\nNovavax (NVAX) said Monday it began human testing of its coronavirus vaccine candidate, and expects preliminary results around the trial in July.\nET Monday: Stock futures open higherHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:01 p.m.\nFind live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay", "text": "Stock futures jumped Monday evening, pacing toward advances Tuesday when traders return from the Memorial Day holiday weekend in the U.S. Contracts on each of the S&P 500, Dow and Nasdaq rose more than 1% shortly after futures began trading after 6 p.m. ET. Overseas, equities in Asia also rose, though market participants continued to eye developments around Hong Kong after China announced a new national security law that would give it more control over Hong Kong, potentially stirring up further volatility in the region and further straining relations with the U.S., with whom Hong Kong holds special trade status. Developments around the coronavirus outbreak still remained front and center for many market participants, though signs of improving consumer behavior in the U.S. after weeks of social distancing have recently started to take hold. Transportation Security Administration (TSA) data showed the number of travelers passing through checkpoints north of 250,000 for each of Saturday and Sunday, which, while still well below the more than 2 million during the same days last year, was well above the just 87,534 travelers from mid-April."}, "News 6": {"title": "Stock-market traders brace for ‘dogfight’ as S&P 500 lingers below its 200-day moving average", "keywords": ["brace", "note", "index", "market", "stocks", "500", "sp", "traders", "moving", "stockmarket", "dogfight", "average", "200day", "lingers", "research"], "publish_date": "2020-05-22", "url": "https://www.marketwatch.com/story/stock-market-traders-brace-for-dogfight-as-sp-500-lingers-below-its-200-day-moving-average-2020-05-22?siteid=yhoof2&yptr=yahoo", "summary": "The S&P 500 SPX, +0.23% closed at a record high on Feb. 19, then began a breakneck plunge as worries over the coronavirus outbreak began to grow.\nBut the 200-day moving average has looked more like a cap after the index first approached it around three weeks ago.\nChronic ‘agita’Indeed, jumps above the 200-day moving average since 2009 have “always been met with some agita,” wrote Mark Arbeter, president of Arbeter Investments, in a Thursday note.\nThe index retook the 200-day in June 2010, after a swift decline, paused, and then fell to new corrective lows.\nSome chart watchers, however, remain encouraged by the market’s recent action and see scope for solid gains, at least in the short term, if the S&P 500 clears resistance at the average.", "text": "A move above or below a 200-day moving average — a proxy for changes in an asset’s long-term trend — is always closely watched by traders, but the S&P 500’s long courtship with that key level, as it bounces back from its bear-market plunge, is becoming something of a fixation on Wall Street. But even if stocks do make it back above the 200-day, history indicates that an extended run to the upside is far from guaranteed. “ ‘A breakout is not likely to come easily and we expect a dogfight here around the 200-day.’ ” — Kevin Dempter, analyst at Renaissance Macro Research  The focus on the 200-day might be enhanced by the fact that the average stood Friday at 2,999.67, just a whisker below a big round number. ‘Dogfight’  “The fact that the S&P 500 is coming off a 35% rally and that this 200-DMA lines up with a nice even 3,000 number seemingly makes this area especially important,” said Kevin Dempter, analyst at Renaissance Macro Research, in a Friday note. “A breakout is not likely to come easily and we expect a dogfight here around the 200-day.”  Read:Are stock investors too complacent about a full-scale blowup between China and the U.S.?"}, "no_of_news": 6}}}, "Plots": {"US": {"LiveRamp Holdings, Inc.": {"open": "33.47,33.79,34.67,35.85,36.82,37.34,37.17,35.98,38.1,36.87,37.84,38.71,37.39,37.29,36.2,35.46,36.66,38.75,38.77,38.21,38.72,42.63", "close": "33.66,34.15,35.83,35.06,38.09,37.86,36.73,36.23,36.88,37.1,38.17,37.95,37.21,36.56,36.25,37.04,37.89,39.03,37.82,38.89,38.75,48.17", "high": "34.0,34.54,36.31,36.09,38.51,38.55,37.39,36.8,38.19,37.88,38.53,38.99,37.66,37.84,36.35,37.08,38.02,40.11,39.52,39.1,39.68,49.08", "low": "33.25,33.73,34.49,35.05,35.71,36.87,35.97,35.85,36.64,36.84,37.78,36.56,36.6,36.47,35.01,35.3,36.66,38.5,37.78,37.92,38.38,42.0", "date": "2020-04-23 ,2020-04-24 ,2020-04-27 ,2020-04-28 ,2020-04-29 ,2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ", "volume": "607300,531200,456300,621500,943800,720000,513500,464600,453900,349300,354400,970500,801900,600700,629800,546200,565200,624200,533400,573700,815100,2605400"}, "Pinduoduo Inc.": {"open": "51.53,49.7,51.15,51.23,48.17,48.53,46.55,45.72,47.9,49.65,49.8,50.89,54.43,55.78,59.04,58.38,60.6,62.59,66.96,63.34,59.14,62.61", "close": "49.17,49.57,51.19,48.06,48.86,47.44,45.43,46.37,48.72,49.2,50.05,54.6,54.94,57.83,59.83,60.84,61.3,66.46,63.09,60.9,60.0,68.7", "high": "52.22,50.58,51.88,51.51,49.8,48.87,46.98,47.33,50.05,50.29,50.15,55.12,55.78,60.6,60.98,61.0,62.91,67.08,69.5,63.89,60.75,69.21", "low": "48.95,49.18,50.61,47.83,47.77,46.75,44.8,45.08,47.75,49.02,48.9,50.72,53.84,55.72,57.84,57.35,60.6,62.16,62.77,59.78,57.02,60.13", "date": "2020-04-23 ,2020-04-24 ,2020-04-27 ,2020-04-28 ,2020-04-29 ,2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ", "volume": "8326400,4514800,4717600,6675600,4901000,4777000,5553300,4830900,9004900,4172200,4682800,7446400,4824800,11057300,10451600,6802200,7098500,7802400,9726100,12679900,12113200,25121000"}, "Carnival Corporation & Plc": {"open": "10.9,11.0,10.6,12.3,14.5,14.0,13.8,12.0,13.5,13.0,11.4,11.41,12.05,10.5,11.0,10.9,9.25,12.4,10.55,12.0,10.5,12.03", "close": "10.9,10.6,10.6,12.47,15.5,15.5,12.0,11.8,12.2,11.2,11.4,12.85,12.5,10.5,11.0,10.08,9.25,12.4,10.55,10.5,10.5,11.94", "high": "10.9,11.5,10.6,12.6,16.5,15.5,15.5,12.0,13.5,13.0,11.4,13.5,40.0,10.5,11.0,10.9,9.25,12.4,10.55,12.0,10.5,12.03", "low": "10.9,10.32,10.6,12.3,12.75,14.0,12.0,11.0,11.8,11.0,11.4,11.41,12.05,10.5,11.0,9.25,9.25,12.4,10.55,10.5,10.5,11.94", "date": "2020-04-23 ,2020-04-24 ,2020-04-27 ,2020-04-28 ,2020-04-29 ,2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ", "volume": "500,2200,0,2000,15800,4600,1100,2200,1000,6800,100,3700,2300,200,400,5600,300,200,2500,900,0,102900"}, "Intercept Pharmaceuticals, Inc.": {"open": "81.4,81.72,85.95,88.92,84.71,83.75,81.0,76.66,80.12,86.13,91.04,86.34,88.33,91.62,89.15,84.03,82.15,86.37,86.05,88.5,92.14,80.01", "close": "80.53,83.5,86.72,82.62,83.69,81.92,77.0,78.64,80.35,88.38,84.83,87.8,90.44,89.05,85.08,82.78,84.61,86.13,87.05,92.04,91.69,80.51", "high": "83.0,83.63,88.59,89.0,85.15,85.03,81.0,78.74,82.1,91.26,91.04,88.99,92.25,95.98,91.38,85.05,84.97,88.08,87.73,92.08,94.51,81.62", "low": "79.91,79.44,84.2,82.37,82.62,81.52,74.85,75.37,79.0,83.86,84.3,85.17,88.3,89.04,83.27,81.57,80.75,84.77,85.45,87.54,90.13,76.31", "date": "2020-04-23 ,2020-04-24 ,2020-04-27 ,2020-04-28 ,2020-04-29 ,2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ", "volume": "382600,399900,534800,453700,432100,422800,551700,761900,586100,1143800,435200,425600,716400,1087300,859900,687400,479000,524200,516200,578200,471600,3276900"}, "51job, Inc.": {"open": "67.57,67.31,65.7,64.32,63.89,60.44,57.57,57.57,56.81,57.14,60.29,63.36,65.01,62.92,62.91,59.25,58.39,60.26,61.99,63.77,64.18,64.05", "close": "66.76,64.51,64.13,63.76,61.67,59.94,57.62,56.59,55.89,60.38,61.49,64.84,62.78,62.89,59.85,58.36,59.82,61.97,63.27,65.15,64.89,57.05", "high": "69.06,67.52,66.28,65.56,64.76,61.94,59.13,58.26,58.11,60.88,61.49,65.68,65.01,63.89,63.1,59.25,59.86,62.87,64.24,65.15,65.01,64.4", "low": "66.58,64.5,64.13,63.15,61.62,59.28,56.52,55.7,55.8,56.08,59.57,60.59,62.78,62.32,59.16,55.13,58.12,60.0,60.86,63.48,62.19,57.0", "date": "2020-04-23 ,2020-04-24 ,2020-04-27 ,2020-04-28 ,2020-04-29 ,2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ", "volume": "101700,123400,320500,258000,301600,219600,190800,204800,317700,272500,122800,187600,141900,174100,133700,571400,297600,288500,380000,144900,192200,342600"}, "JOYY Inc.": {"open": "60.57,60.18,59.85,59.8,57.55,57.68,59.25,52.56,54.34,53.0,54.35,55.36,55.0,53.53,55.46,52.19,52.9,56.47,61.04,65.17,62.1,61.76", "close": "60.13,59.33,59.07,57.2,57.47,60.96,53.25,53.45,52.33,53.48,54.29,55.0,53.34,55.48,53.24,53.35,54.85,59.71,63.15,65.75,63.46,55.83", "high": "61.5,60.49,60.2,59.85,59.66,61.69,59.37,54.75,55.28,54.2,54.7,55.87,55.0,56.25,55.74,53.88,55.3,60.11,63.91,66.45,64.53,61.88", "low": "59.52,58.24,59.0,56.8,57.28,57.12,53.01,51.71,52.3,52.52,53.83,54.38,53.27,53.4,52.47,50.71,52.51,56.47,59.8,63.39,60.57,55.81", "date": "2020-04-23 ,2020-04-24 ,2020-04-27 ,2020-04-28 ,2020-04-29 ,2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ", "volume": "487400,603100,396800,615100,675200,1219900,1301900,1036400,764300,730000,595900,415800,513700,864000,817200,770900,726300,1094600,1186000,1994000,1464400,1528200"}, "Ford Motor Company": {"open": "4.8,4.93,4.91,5.49,5.33,5.16,5.02,4.88,4.99,5.05,4.9,4.96,5.18,5.15,5.0,4.64,4.8,5.12,5.27,5.38,5.45,5.68", "close": "4.89,4.87,5.17,5.38,5.26,5.09,4.92,4.86,4.97,4.87,4.87,5.24,5.12,4.98,4.72,4.89,4.9,5.31,5.3,5.49,5.63,5.65", "high": "4.98,4.96,5.19,5.54,5.5,5.24,5.05,4.97,5.09,5.09,4.98,5.25,5.19,5.22,5.01,4.92,4.94,5.33,5.45,5.54,5.69,5.73", "low": "4.77,4.8,4.88,5.22,5.21,5.06,4.9,4.77,4.94,4.82,4.85,4.95,5.05,4.97,4.66,4.52,4.75,5.12,5.15,5.37,5.44,5.5", "date": "2020-04-23 ,2020-04-24 ,2020-04-27 ,2020-04-28 ,2020-04-29 ,2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ", "volume": "61959800,54352500,91082800,106222800,126393000,93437900,82660100,84214700,96301300,89390400,67222900,101333800,75593900,70965200,100192300,108061100,80544700,136241400,94836300,87685400,87098200,76656500"}, "General Electric Company": {"open": "6.46,6.59,6.38,6.57,6.68,6.56,6.67,6.3,6.28,6.2,6.06,6.21,6.24,6.22,6.0,5.62,5.61,5.74,6.29,6.33,6.42,6.48", "close": "6.52,6.26,6.43,6.8,6.58,6.8,6.5,6.21,6.2,5.98,6.11,6.29,6.19,6.0,5.79,5.7,5.49,6.27,6.21,6.42,6.48,6.41", "high": "6.74,6.6,6.47,6.92,6.9,6.82,6.74,6.31,6.46,6.25,6.26,6.33,6.25,6.28,6.02,5.9,5.66,6.49,6.37,6.47,6.55,6.48", "low": "6.43,6.25,6.33,6.57,6.52,6.41,6.41,6.15,6.16,5.97,6.06,6.16,6.13,6.0,5.48,5.48,5.48,5.74,6.09,6.29,6.33,6.27", "date": "2020-04-23 ,2020-04-24 ,2020-04-27 ,2020-04-28 ,2020-04-29 ,2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ", "volume": "82796100,155976800,107038200,140668600,225228000,175711100,120376500,136852400,116998500,117253600,100663300,93934600,71843000,95652200,235745300,140205400,128486200,255278700,108485100,91287400,98821100,69586200"}, "Norwegian Cruise Line Holdings Ltd.": {"open": "10.95,11.37,11.04,12.33,14.44,16.22,15.25,12.57,12.75,11.79,11.4,12.83,12.16,11.89,11.0,9.94,10.52,11.88,12.92,12.76,12.96,14.72", "close": "11.47,10.86,11.44,13.09,16.41,16.4,13.84,14.44,11.18,11.12,12.0,12.43,11.73,11.09,10.31,10.76,10.92,12.88,12.43,12.78,14.03,13.9", "high": "11.69,11.48,11.87,13.38,16.46,17.48,15.74,14.48,13.22,11.94,12.5,13.13,12.29,11.96,11.03,11.33,11.37,13.47,13.15,13.01,14.35,15.0", "low": "10.92,10.66,10.91,11.93,14.08,15.18,13.7,12.22,11.03,10.88,11.39,12.0,11.53,11.07,9.9,9.24,10.32,11.76,11.88,12.08,12.81,13.72", "date": "2020-04-23 ,2020-04-24 ,2020-04-27 ,2020-04-28 ,2020-04-29 ,2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ", "volume": "23018700,22325500,28614000,37342600,62157700,57984400,43335600,39664500,155971800,128458000,82249000,77121000,42542100,36548900,55477600,68694300,45461300,104714100,65613300,63558500,77421100,65214400"}, "Alibaba Group Holding Limited": {"open": "210.24,205.89,207.55,204.81,202.93,206.25,195.75,194.76,196.38,197.67,198.0,199.8,202.78,206.95,203.62,195.5,200.7,212.5,216.73,220.0,211.29,203.23", "close": "205.24,204.36,203.69,201.15,206.7,202.67,194.48,191.15,195.02,195.17,196.49,201.19,205.4,200.31,199.46,201.3,203.68,215.28,217.2,216.79,212.16,199.7", "high": "210.56,206.5,207.78,205.19,207.08,206.7,197.38,195.0,198.27,198.91,198.09,203.02,206.64,208.05,204.68,201.77,204.49,215.47,220.59,221.16,214.58,204.88", "low": "203.46,202.82,202.03,199.41,202.51,199.29,192.86,189.53,194.2,194.93,194.78,198.68,202.38,200.02,197.98,194.03,200.1,210.37,215.19,210.58,209.53,198.99", "date": "2020-04-23 ,2020-04-24 ,2020-04-27 ,2020-04-28 ,2020-04-29 ,2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ", "volume": "20424000,14682400,17286800,17203800,19117800,20107400,22276200,25709400,22957200,18598900,16164600,23830100,17883700,17826800,22429700,20025900,17209500,23646800,21438100,38324100,29850700,51979300"}}, "NSE": {"ITC Ltd.": {"open": "180.25,180.0,180.5,184.9,181.75,175.0,171.4,164.0,163.95,160.0,158.45,173.4,164.5,162.2,166.0,166.5,171.95,175.6,188.0,190.0", "close": "179.85,179.45,182.15,182.05,174.05,173.9,163.9,161.0,158.25,158.45,165.05,165.4,163.8,164.65,164.75,170.75,175.75,188.95,186.35,193.4", "high": "182.3,180.8,182.9,184.9,181.75,177.45,171.4,165.85,164.15,163.5,165.9,173.6,168.25,165.5,167.3,171.65,177.0,190.45,191.9,194.95", "low": "179.3,178.05,179.65,180.45,170.65,172.0,160.5,160.5,157.1,158.0,157.5,164.5,161.95,161.15,163.15,165.1,171.0,172.65,184.6,189.0", "date": "2020-04-27 ,2020-04-28 ,2020-04-29 ,2020-04-30 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-26 ", "volume": "13085703,17802635,21461067,30164713,30294317,17707577,65586734,24249585,25307015,18095473,21387527,20015124,14949993,14950243,20801299,20142171,25320734,58382197,39013770,15439806"}, "HDFC Bank Ltd.": {"open": "945.15,943.8,935.0,1001.4,957.5,938.0,919.0,940.5,942.0,937.0,901.0,951.0,898.0,890.5,888.0,860.85,836.45,861.45,850.0,857.0", "close": "929.7,931.4,977.1,1001.8,923.0,911.45,946.4,925.0,929.05,915.8,901.55,927.65,893.7,888.15,836.65,830.65,857.1,859.55,838.85,866.0", "high": "957.4,943.8,992.7,1019.0,960.0,944.0,950.0,943.3,943.95,954.0,909.4,960.0,911.0,892.4,888.0,867.3,864.0,884.0,870.3,871.75", "low": "926.3,922.0,934.1,992.1,917.5,908.05,905.65,921.35,925.2,914.0,871.1,922.1,890.0,875.0,831.3,826.1,832.2,852.3,833.05,851.0", "date": "2020-04-27 ,2020-04-28 ,2020-04-29 ,2020-04-30 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-26 ", "volume": "13710536,14720718,27938889,21896567,13361162,14836429,16892923,10915865,10403742,14275392,24784209,22173483,19777445,12174814,23324982,23730346,20007153,24239454,21023716,4469003"}, "Tata Steel Ltd.": {"open": "274.0,273.9,273.0,289.95,285.0,279.0,274.1,275.45,282.8,275.55,273.3,287.5,272.0,270.0,274.1,271.95,272.0,283.9,279.0,277.5", "close": "271.65,273.55,282.65,298.3,273.6,272.65,277.75,275.85,272.9,276.2,273.95,276.55,268.55,273.45,266.6,272.0,283.2,283.7,274.45,281.65", "high": "276.9,275.4,286.15,304.5,286.15,282.4,280.45,282.85,284.0,283.0,276.8,288.0,275.2,276.8,276.2,280.4,284.0,286.25,280.25,283.55", "low": "270.5,269.55,271.25,288.7,270.1,271.0,272.05,274.65,272.0,275.0,264.5,273.5,267.3,268.8,262.45,267.5,270.1,278.5,273.3,277.0", "date": "2020-04-27 ,2020-04-28 ,2020-04-29 ,2020-04-30 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-26 ", "volume": "12410612,8547105,19876569,23633372,12891459,12182330,9507731,8958376,9877755,10907408,15040297,14723116,10796902,14989665,11615367,16897094,14421812,13035811,10656739,3054330"}, "Bharti Airtel Ltd.": {"open": "498.05,497.45,490.95,503.1,502.45,538.0,531.75,545.35,540.0,533.05,533.0,568.4,551.1,543.5,556.9,558.5,605.0,590.5,597.0,572.0", "close": "494.05,485.65,496.0,514.3,532.5,528.05,546.0,528.05,530.05,536.2,559.85,555.95,539.85,554.1,538.05,598.8,594.05,594.55,593.2,570.95", "high": "503.05,497.45,498.4,515.95,540.0,553.7,551.45,545.35,545.8,548.5,564.0,569.75,562.5,556.9,559.0,603.5,612.0,604.5,597.4,576.45", "low": "491.1,484.1,487.05,495.2,499.9,526.05,530.05,524.45,528.3,532.1,530.5,549.3,535.1,539.4,535.2,557.0,588.6,585.4,587.0,568.0", "date": "2020-04-27 ,2020-04-28 ,2020-04-29 ,2020-04-30 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-26 ", "volume": "9888710,11512936,8217429,19799159,34019449,29936905,25594154,15532117,13592411,14223754,22616585,21113369,13180860,14486140,21586050,71908985,35741865,20292552,11416299,44824901"}, "Tata Consultancy Services Ltd.": {"open": "1832.3,1865.0,1874.0,1980.0,1966.0,1955.1,1939.8,1910.0,1939.1,1909.0,1933.4,1994.0,1910.0,1916.0,1907.0,1903.0,1950.0,1946.0,1977.1,2015.0", "close": "1836.6,1859.05,1905.65,2014.45,1930.45,1932.75,1903.6,1891.65,1893.4,1935.3,1949.5,1949.65,1902.35,1892.9,1945.6,1948.65,1953.6,1991.2,2020.35,2003.9", "high": "1875.0,1868.0,1912.55,2032.0,1966.0,1977.0,1953.7,1934.45,1939.5,1951.4,1956.5,1994.0,1923.1,1917.4,1952.95,1966.45,1962.9,1998.0,2032.0,2024.0", "low": "1825.0,1832.6,1850.05,1942.2,1913.65,1927.0,1893.6,1883.35,1886.25,1909.0,1910.25,1925.65,1891.1,1865.2,1872.1,1903.0,1931.7,1941.15,1961.25,1981.0", "date": "2020-04-27 ,2020-04-28 ,2020-04-29 ,2020-04-30 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-26 ", "volume": "3374741,2678505,4241510,5915544,3729348,2905528,3517431,3166754,2686530,2449841,3256595,2656665,2263146,3173682,3727694,3198693,2778505,3400908,3663418,1003978"}, "Infosys Ltd.": {"open": "661.05,673.0,666.0,700.0,689.8,681.75,676.9,665.55,672.25,682.5,678.5,694.8,659.0,664.8,659.85,664.0,668.5,666.5,675.0,693.0", "close": "664.6,660.7,676.55,715.5,673.7,673.7,665.9,664.95,674.2,682.9,687.65,694.15,658.15,652.3,663.9,668.6,669.55,672.2,692.35,698.35", "high": "681.0,677.0,682.0,720.0,701.2,685.6,681.45,674.35,680.9,698.55,691.0,699.9,671.75,664.8,670.55,674.8,673.0,679.45,695.85,699.45", "low": "661.05,653.05,658.0,698.1,670.35,670.0,664.05,662.45,668.5,678.0,675.5,683.75,652.6,646.7,653.0,655.0,659.65,665.4,673.5,688.45", "date": "2020-04-27 ,2020-04-28 ,2020-04-29 ,2020-04-30 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-26 ", "volume": "7183306,7296571,8639056,16253821,9122740,6393053,7934250,4779548,8400321,7370186,7356039,8287101,16888262,9255353,10435442,5902208,5794636,7213225,11867731,1565514"}}, "FOREX": {"USD/INR": {"open": "76.2715,76.655,76.465,75.61,75.72,75.59100000000001,75.63,76.17,76.55,76.08,75.525,75.9276,75.3685,75.4272,75.485,75.82,75.6,75.7,75.78,75.625,75.985,75.946", "close": "76.2715,76.1863,76.465,75.2585,75.72,75.6005,75.85,76.17,76.1513,76.08,75.525,76.31,75.68,75.4262,75.485,75.82,75.6001,76.0,75.78,75.625,75.985,75.66", "high": "76.785,76.655,76.465,75.75,76.145,75.805,76.1158,76.17,76.55,76.08,76.26,76.31,75.68,75.73,76.1855,76.092,76.04,76.0,75.92,76.2095,76.1295,75.946", "low": "75.8875,75.7904,75.41199999999999,74.805,75.07300000000001,75.3525,75.38,75.5903,75.7095,75.26,75.0395,75.0413,75.044,75.34100000000001,75.3193,75.6124,75.5275,75.46300000000001,75.416,75.61,75.7575,75.64", "date": "2020-04-27 ,2020-04-28 ,2020-04-29 ,2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-25 ,2020-05-26 "}, "EUR/USD": {"open": "1.0824,1.0827,1.0832,1.0877,1.0945,1.0957,1.0905,1.084,1.0801,1.0837,1.084,1.0809,1.0846,1.0822,1.0806,1.0819,1.0916,1.093,1.0979,1.0952,1.0909,1.0896", "close": "1.0824,1.0825,1.0837,1.0877,1.0945,1.0959999999999999,1.0904,1.0839,1.0799,1.0837,1.084,1.0809,1.0847,1.0824,1.0807,1.0821,1.0915,1.0928,1.0983,1.0953,1.0908,1.0922", "high": "1.0859999999999999,1.089,1.0874,1.097,1.1016,1.0958,1.0921,1.0845,1.0816,1.0873,1.0853,1.088,1.0893,1.0825,1.085,1.0913,1.0975,1.0999,1.1009,1.0955,1.0915,1.0925", "low": "1.0812,1.0811,1.0832,1.0836,1.0935,1.0901,1.0827,1.0784,1.0768,1.0816,1.0804,1.0785,1.0831,1.0777,1.0791,1.0801,1.0903,1.0929,1.0939,1.0886,1.0872,1.0896", "date": "2020-04-27 ,2020-04-28 ,2020-04-29 ,2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-25 ,2020-05-26 "}, "USD/JPY": {"open": "107.50399999999999,107.286,106.75200000000001,106.601,107.305,106.751,106.68299999999999,106.431,106.21,106.39,106.905,107.588,107.163,106.914,107.361,107.229,107.37700000000001,107.819,107.59899999999999,107.634,107.74,107.679", "close": "107.495,107.28299999999999,106.741,106.61,107.285,106.738,106.697,106.45200000000001,106.191,106.359,106.919,107.566,107.13799999999999,106.93299999999999,107.365,107.208,107.381,107.81,107.59100000000001,107.631,107.735,107.819", "high": "107.616,107.334,106.758,107.10799999999999,107.399,107.055,106.889,106.431,106.646,106.72,107.728,107.67299999999999,107.251,107.164,107.432,107.495,108.074,107.975,107.84700000000001,107.76,107.772,107.92299999999999", "low": "107.0,106.56200000000001,106.36399999999999,106.416,106.61,106.67200000000001,106.484,106.024,106.139,106.23299999999999,106.775,107.21600000000001,106.762,106.785,106.876,107.06700000000001,107.305,107.346,107.575,107.334,107.63,107.64", "date": "2020-04-27 ,2020-04-28 ,2020-04-29 ,2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-25 ,2020-05-26 "}, "GBP/USD": {"open": "1.2369,1.2422,1.2434,1.2469,1.2581,1.2457,1.2448,1.2445,1.2327,1.2374,1.2416,1.2332,1.2254,1.2239,1.2234,1.2086,1.2203,1.2259,1.2235,1.2226,1.2187,1.219", "close": "1.2367,1.2423,1.2436,1.2471,1.2581,1.2454,1.2446,1.2444,1.2326,1.2376,1.2417,1.2333,1.2255,1.2242,1.2234,1.2086,1.22,1.2256,1.2237,1.2223,1.2186,1.2223", "high": "1.2454,1.2518,1.2486,1.2638,1.2581,1.2469,1.248,1.245,1.2415,1.2464,1.2438,1.2376,1.2337,1.2241,1.2238,1.2224,1.2269,1.2287,1.2249,1.2235,1.2204,1.2223", "low": "1.2361,1.2406,1.239,1.2429999999999999,1.2504,1.2406,1.2422,1.2338,1.227,1.2358,1.2286,1.2289,1.2222,1.2169,1.2116,1.2086,1.2185,1.2223,1.2187,1.2163,1.2165,1.2177", "date": "2020-04-27 ,2020-04-28 ,2020-04-29 ,2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-25 ,2020-05-26 "}, "EUR/JPY": {"open": "116.31,116.117,115.63,115.943,117.44200000000001,116.969,116.33,115.369,114.697,115.285,115.84700000000001,116.294,116.23200000000001,115.694,116.001,116.008,117.19200000000001,117.819,118.12,117.88,117.527,117.334", "close": "116.32,116.135,115.632,115.96,117.411,116.97200000000001,116.331,115.37799999999999,114.675,115.26299999999999,115.887,116.266,116.209,115.708,116.031,115.985,117.20299999999999,117.79700000000001,118.141,117.83,117.51,117.73", "high": "116.48700000000001,116.264,115.902,117.251,117.762,116.991,116.51,115.369,115.05799999999999,115.728,116.508,116.79899999999999,116.39,115.811,116.17200000000001,117.164,118.176,118.196,118.51899999999999,117.969,117.53299999999999,117.78", "low": "116.086,115.729,115.43299999999999,115.56,117.022,116.495,115.45,114.455,114.59200000000001,115.039,115.821,115.95,115.84,115.33,115.485,115.82,117.0,117.73,117.86,116.97,117.09,117.272", "date": "2020-04-27 ,2020-04-28 ,2020-04-29 ,2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-25 ,2020-05-26 "}}, "INDICES": {"Dow Jones Industrial Average": {"open": "23543.09,23628.24,23866.15,24357.17,24490.37,24585.57,24120.78,23581.55,23958.88,23978.88,23837.21,24107.82,24256.45,24292.84,23702.16,23049.06,23454.83,24059.98,24577.48,24455.94,24564.27,24461.98", "close": "23515.26,23775.27,24133.78,24101.55,24633.86,24345.72,23723.69,23749.76,23883.09,23664.64,23875.89,24331.32,24221.99,23764.78,23247.97,23625.34,23685.42,24597.37,24206.86,24575.9,24474.12,24465.16", "high": "23885.36,23826.0,24207.65,24512.24,24764.77,24585.57,24120.78,23769.56,24169.72,24054.59,24094.62,24349.9,24366.21,24382.09,23708.9,23630.86,23730.08,24708.54,24599.5,24649.48,24718.46,24481.64", "low": "23483.35,23417.68,23840.61,24031.2,24453.99,24186.9,23645.3,23361.16,23868.91,23661.14,23834.39,24107.05,24070.22,23761.58,23067.64,22789.62,23354.15,24059.98,24202.96,24455.94,24370.88,24294.07", "date": "2020-04-23 ,2020-04-24 ,2020-04-27 ,2020-04-28 ,2020-04-29 ,2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ", "volume": "389290000,376020000,389390000,400250000,455290000,487840000,418160000,355360000,369710000,377450000,369890000,335760000,352400000,359480000,469950000,472700000,491510000,484190000,374100000,366510000,346770000,255660000"}, "S&P BSE SENSEX": {"open": "31659.04,32101.91,32311.04,33381.19,32748.14,32182.9,31577.63,31677.69,32083.32,32030.34,31342.93,32841.87,31466.33,31296.28,31248.26,30450.74,30159.59,30904.29,30822.78,30864.27", "close": "31743.08,32114.52,32720.16,33717.62,31715.35,31453.51,31685.75,31443.38,31642.7,31561.22,31371.12,32008.61,31122.89,31097.73,30028.98,30196.17,30818.61,30932.9,30672.59,30988.07", "high": "32103.7,32199.91,32897.59,33887.25,32748.14,32264.0,31970.84,31705.25,32088.51,32301.58,31536.89,32845.48,31630.94,31296.28,31248.26,30739.96,30878.31,31188.79,31107.91,31086.7", "low": "31651.58,31661.34,32171.65,33354.93,31632.02,31403.57,31158.75,31362.87,31598.0,31500.87,30844.66,31901.92,31052.65,30770.48,29968.45,30116.82,30157.75,30765.32,30474.88,30835.01", "date": "2020-04-27 ,2020-04-28 ,2020-04-29 ,2020-04-30 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-26 ", "volume": "12900,15600,16000,21100,18300,19200,19200,19900,15900,18100,23100,18400,15200,13000,19500,18700,16100,15500,20600,0"}, "S&P 500": {"open": "2810.42,2812.64,2854.65,2909.96,2918.46,2930.91,2869.09,2815.01,2868.88,2883.14,2878.26,2908.83,2915.46,2939.5,2865.86,2794.54,2829.95,2913.86,2948.59,2953.63,2969.95,2948.05", "close": "2797.8,2836.74,2878.48,2863.39,2939.51,2912.43,2830.71,2842.74,2868.44,2848.42,2881.19,2929.8,2930.19,2870.12,2820.0,2852.5,2863.7,2953.91,2922.94,2971.61,2948.51,2955.45", "high": "2844.9,2842.71,2887.72,2921.15,2954.86,2930.91,2869.09,2844.24,2898.23,2891.11,2901.92,2932.16,2944.25,2945.82,2874.14,2852.8,2865.01,2968.09,2964.21,2980.29,2978.5,2956.76", "low": "2794.26,2791.76,2852.89,2860.71,2912.16,2892.47,2821.61,2797.85,2863.55,2847.65,2876.48,2902.88,2903.44,2869.59,2793.15,2766.64,2816.78,2913.86,2922.35,2953.63,2938.57,2933.59", "date": "2020-04-23 ,2020-04-24 ,2020-04-27 ,2020-04-28 ,2020-04-29 ,2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ", "volume": "5756520000,5374480000,5194260000,5672880000,6620140000,6523120000,4753160000,4723140000,5129590000,4861920000,5164640000,4857160000,4807320000,5107710000,6143130000,5641920000,5477040000,6364290000,4969330000,4992970000,4966940000,3952800000"}}}}