{"News": {"US": {"ZS": {"company_name": "Zscaler, Inc.", "News 1": {"title": "Best Stocks To Buy And Watch Now: 5 Top Stocks For June", "keywords": ["growth", "ibd", "entry", "buy", "watch", "stock", "market", "microsoft", "best", "coronavirus", "earnings", "stocks"], "publish_date": "2020-05-29", "url": "https://www.investors.com/research/best-stocks-to-buy-now/?src=A00220&yptr=yahoo", "summary": "Best Stocks To Buy: The Crucial IngredientsRemember, there are thousands of stocks trading on the NYSE and Nasdaq.\nInvest when the stock market is in a confirmed uptrend and move to cash when the stock market goes into a correction.\nBest Stocks To Buy Or WatchNow let's look at Microsoft stock, Apple stock, PayPal stock, ASML stock and UnitedHealth stock in more detail.\nCheck out IBD Stock Lists and other IBD content to find dozens more of the best stocks to buy or watch.\nASML stock fell 40% in the coronavirus stock market crash from late February to late March before starting its recovery.", "text": "Buying a stock is easy, but buying the right stock without a time-tested strategy is incredibly hard. So what are the best stocks to buy now or put on a watchlist? Microsoft (MSFT), Apple (AAPL), PayPal (PYPL), ASML (ASML) and UnitedHealth (UNH) are looking stronger as the stock market continues to bounce back from the severe coronavirus correction. X  While the long bull market was finally vanquished by the coronavirus crisis, things are looking positive again. The stock market is in a confirmed uptrend, and has recouped much of its loss."}, "News 2": {"title": "Why Zscaler Stock Surged Today", "keywords": ["zpa", "cash", "access", "zscaler", "today", "million", "zscalers", "stock", "applications", "surged", "chaudhry", "working", "business"], "publish_date": "2020-05-29", "url": "https://www.fool.com/investing/2020/05/29/why-zscaler-stock-surged-today.aspx?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article&yptr=yahoo", "summary": "What happenedShares of Zscaler (NASDAQ:ZS) soared on Friday after the cloud-based cybersecurity company delivered blockbuster results for its fiscal third quarter, which ended April 30.\nBy the close of trading, Zscaler's stock was up by 29.4%.\nBetter still, Zscaler's cash production is improving as it scales its operations.\nOperating cash flow climbed 54% to $20.8 million, while free cash flow nearly doubled to $9.1 million.\nZscaler's ZPA is widely regarded as having best-in-class technology for these purposes -- and orders have flooded into the company in recent months.", "text": "What happened  Shares of Zscaler (NASDAQ:ZS) soared on Friday after the cloud-based cybersecurity company delivered blockbuster results for its fiscal third quarter, which ended April 30. By the close of trading, Zscaler's stock was up by 29.4%. So what  Zscaler's revenue jumped 40% year over year to $110.5 million, while billings -- a key metric that reflects new subscription sales -- leaped 55%, to $131.3 million. Those gains were driven by strong sales of Zscaler Private Access (ZPA), a cloud-based service that helps businesses and other organizations provide users with access to their internal applications without the need to grant those users network access. \"The mitigation activities taken by every enterprise in response to the COVID-19 pandemic created an immediate need for strong security and access to the internet and business applications, all while working from anywhere,\" Chairman and CEO Jay Chaudhry said in a press release."}, "News 3": {"title": "Zscaler Stock Pops To All-Time High On Earnings Beat", "keywords": ["pops", "zpa", "ibd", "alltime", "beat", "customers", "zscaler", "surge", "stock", "cloud", "earnings", "stocks", "high"], "publish_date": "2020-05-29", "url": "https://www.investors.com/research/ibd-stock-of-the-day/zscaler-stock-pops-to-high-as-work-from-home-drives-earnings-beat/?src=A00220&yptr=yahoo", "summary": "Zscaler stock soared to an all-time high on Friday after earnings handily beat expectations.\nInvestors may want to put Zscaler stock on a watchlist and look for a new base to form.\nZscaler stock soared 29.4% to close at 98.09 on the stock market today.\nZscaler Stock: Cloud Service replaces VPNsAs more employees worked from home amid the coronavirus pandemic, many companies upgraded virtual private networks, or VPNs.\nPrior to today's surge, Zscaler stock hit an all-time high of 89.54 on July 26, 2019.", "text": "Zscaler Inc Zscaler Inc ZS $ 98.09 $22.29 29.41% 626% IBD Stock Analysis Stock formed a breakaway earnings gap Friday, soaring by double digits  Shares are extended from proper entry point, should be on watchlists  Relative Strength line pointing north; RS Rating stands at 93 out of 99 Composite Rating 92 /99 Industry Group Ranking 17 /197 Emerging Pattern Consolidation Consolidation A sideways pattern that doesn’t fit traditional base definitions. Sometimes will have a handle. Zscaler is the IBD Stock of the Day amid the cybersecurity firm's surge on stellar fiscal third-quarter earnings. Zscaler stock soared to an all-time high on Friday after earnings handily beat expectations. X  The company's earnings, reported late Thursday, trounced estimates."}, "News 4": {"title": "Coronavirus Stock Market Rally Has Wild Swings During Week Amid Sector Rotation, China Tensions; Zscaler, Twitter, Boeing In Focus", "keywords": ["beating", "rotation", "earnings", "growth", "views", "rally", "big", "zscaler", "sales", "tensions", "million", "swings", "stock", "sector", "wild", "twitter", "reported", "coronavirus", "revenue", "week"], "publish_date": "2020-05-29", "url": "https://www.investors.com/news/coronavirus-stock-market-rally-swings-sector-rotation-china-tensions-zscaler-twitter-boeing/?src=A00220&yptr=yahoo", "summary": "The coronavirus stock market rally had some big intraday swings, especially for growth stocks and various Covid-19 plays.\nWorkday reduced fiscal 2021 subscription revenue growth guidance, but raised operating margin guidance.\nAnaplan (PLAN) lost 10 cents a share while revenue climbed 37% to $103.8 million, beating views.\nVeeva Systems (VEEV) reported adjusted Q1 EPS rose 32% as sales grew 38% to $337.1 million in sales, both beating views.\nCostco Earnings MissCostco Wholesale (COST) fell Friday after missing fiscal Q3 earnings views as costs related to the coronavirus pandemic piled up.", "text": "The coronavirus stock market rally had some big intraday swings, especially for growth stocks and various Covid-19 plays. With economic recovery hopes rising, shares of airlines, homebuilders, retailers and other \"real world\" companies soared. Meanwhile, U.S.-China tensions came to the fore, but stocks spiked Friday after President Trump's China speech. Meanwhile, Trump escalated his feud with Twitter (TWTR). Boeing (BA) 737 Max production has restarted."}, "News 5": {"title": "Nasdaq Today: Zoom Stock Leads the Nasdaq 100 Higher; Zscaler Delivers on Earnings", "keywords": ["delivers", "nearly", "leads", "100", "zscaler", "today", "stock", "nasdaq", "video", "pandemic", "investors", "zoom", "businesses", "earnings", "higher", "stocks"], "publish_date": "2020-05-29", "url": "https://www.fool.com/investing/2020/05/29/nasdaq-today-zoom-stock-leads-the-nasdaq-100-highe.aspx?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article&yptr=yahoo", "summary": "Shortly before noon EDT today, the index posted a gain of 0.2%, and the Nasdaq 100 Index of top Nasdaq stocks saw even larger gains of around 0.4%.\nZoom Video Communications (NASDAQ:ZM) was the leading gainer in the Nasdaq 100, and some of the optimism surrounding the video collaboration company came from even stronger gains from cloud security specialist Zscaler (NASDAQ:ZS).\nZooming higherShares of Zoom Video Communications were up nearly 6% at midday on Friday.\nThere's no doubt that Zoom stock is highly valued.\nInvestors should expect Nasdaq stocks to keep making moves that don't necessarily follow the broader market.", "text": "Friday was generally a down day for the broader stock market, but the news for the Nasdaq Composite (NASDAQINDEX:^IXIC) was better. Shortly before noon EDT today, the index posted a gain of 0.2%, and the Nasdaq 100 Index of top Nasdaq stocks saw even larger gains of around 0.4%. That was considerably better than losses of nearly 0.75% for the Dow Jones Industrials. Whenever investors have been nervous about the prospects for the overall economy weathering the coronavirus crisis, they've tended to gravitate toward the companies that are successfully helping businesses and their workers cope during the pandemic. Zoom Video Communications (NASDAQ:ZM) was the leading gainer in the Nasdaq 100, and some of the optimism surrounding the video collaboration company came from even stronger gains from cloud security specialist Zscaler (NASDAQ:ZS)."}, "News 6": {"title": "Zscaler Extends Gains as Cloud Security Demand Ramps Up", "keywords": ["cloud", "ratio", "company", "priceearnings", "ramps", "extends", "revenue", "demand", "zscaler", "million", "cents", "security", "gains", "share", "earnings"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/zscaler-extends-gains-cloud-security-223535120.html", "summary": "The stock price of cloud security company Zscaler Inc. (NASDAQ:ZS) skyrocketed more than 29% on Friday to trade at $98 per share following the company's latest earnings results.\nNon-GAAP earnings of 7 cents per share outperformed Zacks consensus estimate of 2 cents and revenue beat forecasts by 3.85%.\nThe company trades at a forward price-earnings ratio of 333 and a price-earnings to growth ratio (five-year expected) of 7.13.\nFor instance, Palo Alto Networks Inc. (NYSE:PANW) is currently valued at a forward price-earnings ratio of 40.3.\nOn the other hand, Fortinet Inc. (NASDAQ:FTNT) trades at a forward price-earnings ratio of 49.51, a PEG ratio of 2.96 and a price-sales ratio of 10.64.", "text": "The stock price of cloud security company Zscaler Inc. (NASDAQ:ZS) skyrocketed more than 29% on Friday to trade at $98 per share following the company's latest earnings results. Zscaler smashed analysts' expectations on revenue and earnings. Non-GAAP earnings of 7 cents per share outperformed Zacks consensus estimate of 2 cents and revenue beat forecasts by 3.85%. The company provides internet access solutions to customers globally that connect them to externally managed applications such as SaaS. It also offers private access solutions to provide access to internally managed applications hosted in data centers or in private and public clouds."}, "News 7": {"title": "4 Top Stock Trades for Monday: ZS, CGC, OXY, UBER", "keywords": ["resistance", "support", "zs", "average", "trades", "cgc", "20", "uber", "stock", "moving", "prior", "shares", "oxy", "chart"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/4-top-stock-trades-monday-204725429.html", "summary": "With that in mind, let’s look at a few top stock trades for next week.\nTop Stock Trades for Monday No.\n1: Zscaler (ZS)top stock trades for zs MoreClick to EnlargeSource: Chart courtesy of StockCharts.comZscaler (NASDAQ:ZS) shares are ripping higher after better-than-expected earnings.\n3: Occidental Petroleum (OXY)top stock trades for oXY MoreClick to EnlargeSource: Chart courtesy of StockCharts.comOccidental Petroleum (NYSE:OXY) isn’t looking too hot, down 5% on Friday.\n4: Uber (UBER)top stock trades for UBER More", "text": "After a bumpy couple of days, the S&P 500 traded somewhat quietly on Friday, after bouncing off the 3,000 area and 200-day moving average. With that in mind, let’s look at a few top stock trades for next week. Top Stock Trades for Monday No. 1: Zscaler (ZS)  top stock trades for zs More    Click to Enlarge  Source: Chart courtesy of StockCharts.com  Zscaler (NASDAQ:ZS) shares are ripping higher after better-than-expected earnings. Coming into the event, shares were trading higher, grinding up in a modest channel (blue lines) and maintaining about the 20-day moving average."}, "no_of_news": 7, "plot_name": "/content/plots/ZS.png"}, "CGC": {"company_name": "Canopy Growth Corporation", "News 1": {"title": "Cannabis producer Canopy Growth reports another billion-dollar loss", "keywords": ["weed", "growth", "company", "cash", "reports", "canopy", "cannabis", "loss", "million", "market", "klein", "pot", "producer", "billion", "billiondollar"], "publish_date": "2020-05-29", "url": "https://www.marketwatch.com/story/cannabis-producer-canopy-growth-reports-another-billion-dollar-loss-2020-05-29?siteid=yhoof2&yptr=yahoo", "summary": "Canopy Growth Corp. reported its second billion-dollar quarterly loss Friday, as the company remains mired in a turnaround effort.\nCanopy’s CGC, -20.02% WEED, -20.80% fiscal fourth-quarter net loss of C$1.33 billion ($946.4 million) was the second in its history after the Smiths Falls, Ontario based weed producer logged a C$1.28 billion loss in the fiscal first quarter last year.\nCanopy wrote off C$132 million for “obsolete” packaging, flower and biomass inventory.\nOn the conference call, Lee said that Canopy saw less traffic to its physical retail stores because of social-distancing requirements.\nProvinces such as British Columbia, Alberta and Ontario have also re-balanced inventory and were ordering less weed from Canopy.", "text": "Canopy Growth Corp. reported its second billion-dollar quarterly loss Friday, as the company remains mired in a turnaround effort. Canopy’s CGC, -20.02% WEED, -20.80% fiscal fourth-quarter net loss of C$1.33 billion ($946.4 million) was the second in its history after the Smiths Falls, Ontario based weed producer logged a C$1.28 billion loss in the fiscal first quarter last year. A loss of hundreds of millions of dollars was expected, as Canopy announced in March that it expected to record a C$700 million to C$800 million charge related to shutting down two weed facilities in British Columbia and laying off 500 people from related jobs. Chief Financial Officer Mike Lee said Friday on Canopy’s earnings call that C$715 million was noncash, most tied to the cultivation assets it shut down, with roughly C$193 million of impairment charges from exiting international markets. Canopy wrote off C$132 million for “obsolete” packaging, flower and biomass inventory."}, "News 2": {"title": "10 Things to Hate About Canopy Growth's Q4 Update", "keywords": ["growths", "company", "q4", "canadian", "canopys", "sales", "hate", "canopy", "cannabis", "million", "quarter", "update", "revenue", "things"], "publish_date": "2020-05-30", "url": "https://www.fool.com/investing/2020/05/30/10-things-to-hate-about-canopy-growths-q4-update.aspx?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article&yptr=yahoo", "summary": "Here are 10 things to hate about Canopy Growth's Q4 update, along with a couple of things to love.\nA big revenue missAnalysts looked for Canopy to report Q4 revenue of 128.9 million Canadian dollars.\nAn even worse bottom-line missIf you think Canopy's revenue miss was bad, you'll really hate the cannabis producer's bottom line.\nUnfortunately, B2B was its weakest link in Q4 with sales plunging 31% quarter over quarter to CA$36.7 million.\nTwo things to loveWhile there was a lot to hate (or at least strongly dislike) about Canopy Growth's Q4 update, there were two things to love.", "text": "After Aurora Cannabis (NYSE: ACB) posted surprisingly positive Q3 results last week, some might have thought that Canopy Growth (NYSE:CGC) would have good news in its quarterly update this week. It didn't. Canopy announced its fiscal 2020 fourth-quarter and full-year results on Friday and the marijuana stock fell more than 20% in intraday trading, which gives you an idea of how the company performed in Q4. Here are 10 things to hate about Canopy Growth's Q4 update, along with a couple of things to love. 1."}, "News 3": {"title": "Could Canopy Growth Be a Millionaire-Maker Stock?", "keywords": ["company", "growth", "early", "billion", "canopy", "cannabis", "millionairemaker", "stock", "market", "medical", "recreational", "marijuana"], "publish_date": "2020-05-31", "url": "https://www.fool.com/investing/2020/05/31/could-canopy-growth-be-a-millionaire-maker-stock.aspx?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article&yptr=yahoo", "summary": "Canopy Growth (NYSE:CGC) shares aren't anywhere close to their levels in late 2018 and early 2019 as the Canadian adult-use recreational marijuana market was first launching.\nCould Canopy Growth even be a millionaire-maker stock?\nChallengesThe agreement with Acreage, though, exposes the biggest challenge for Canopy Growth.\nAnother key challenge for Canopy Growth is that it remains unprofitable.\nMy view is that Canopy Growth won't be able to make an average investor a millionaire.", "text": "Canopy Growth (NYSE:CGC) shares aren't anywhere close to their levels in late 2018 and early 2019 as the Canadian adult-use recreational marijuana market was first launching. But investors who bought early and held on have still enjoyed tremendous returns. The global cannabis industry is still only in its early stages. If Canopy can remain a top leader in the industry, it could be able to deliver more impressive gains in the future than it has in the past. Could Canopy Growth even be a millionaire-maker stock?"}, "News 4": {"title": "Canopy Growth Corp. (CGC) Q4 2020 Earnings Call Transcript", "keywords": ["2020", "products", "growth", "q4", "chief", "weve", "corp", "cgc", "value", "canopy", "financial", "market", "going", "line", "earnings", "transcript", "business", "think"], "publish_date": "2020-05-30", "url": "https://www.fool.com/earnings/call-transcripts/2020/05/30/canopy-growth-corp-cgc-q4-2020-earnings-call-trans.aspx?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article&yptr=yahoo", "summary": "Before financial markets open today, Canopy issued a news release announcing our financial results for fourth-quarter and fiscal-year 2020 ended March 31, 2020.\nMike Lee -- Chief Financial OfficerThank you very much, David, and good morning, everyone.\nMike Lee -- Chief Financial OfficerDavid, I'd just build on that and say that we're very happy with our portfolio on the high end.\nMike Lee -- Chief Financial OfficerAnd we're still seeing the premium segment as a third of the consumer dollar.\nMike Lee -- Chief Financial OfficerI think the big story on Germany is we now have supply continuity.", "text": "Canopy Growth Corp. (NYSE:CGC)  Q4 2020 Earnings Call  , 10:00 a.m. ET  Contents:  Prepared Remarks  Questions and Answers  Call Participants  Prepared Remarks:  Operator  Good morning. My name is Denise, and I will be your conference operator today. I would like to welcome everyone to Canopy's Growth fourth-quarter and fiscal-year 2020 financial results conference call. [Operator instructions] I will now turn the call over to Judy Hong, vice president, investor relations."}, "News 5": {"title": "Why Tilray and OrganiGram Holdings Got Slammed on Friday", "keywords": ["company", "growth", "organigram", "holdings", "tilray", "exceptional", "quarterly", "canopy", "slammed", "whatcanopy", "revenue", "marijuana"], "publish_date": "2020-05-29", "url": "https://www.fool.com/investing/2020/05/29/why-tilray-and-organigram-holdings-got-slammed-on.aspx?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article&yptr=yahoo", "summary": "What happenedA pair of marijuana stocks, Tilray (NASDAQ:TLRY) and OrganiGram Holdings (NASDAQ:OGI), both dropped notably in price on Friday (by 5.2% and 7%, respectively).\nThe culprit seems to be another weed title, Canopy Growth (NYSE:CGC), which earlier in the day published an awful quarterly earnings release.\nThis affected Tilray and Organigram, even though neither had proprietary bad news to report on Friday.\nNow whatCanopy Growth is trimming expectations, saying that it's enacting a strategic reset to more narrowly focus its business.\nThat should drive investors away from the stock, and if they can't get interested in Canopy Growth, they won't be eager to buy shares of Tilray or OrganiGram, either.", "text": "What happened  A pair of marijuana stocks, Tilray (NASDAQ:TLRY) and OrganiGram Holdings (NASDAQ:OGI), both dropped notably in price on Friday (by 5.2% and 7%, respectively). The culprit seems to be another weed title, Canopy Growth (NYSE:CGC), which earlier in the day published an awful quarterly earnings release. So what  Canopy Growth is a leading company in the sector. Since basically every cannabis business in North America remains very dependent on this continent's market, they have all struggled with the numerous challenges of operating in their industry. Therefore, wherever a big marijuana company goes, the others broadly follow."}, "News 6": {"title": "Stock Market Today With Jim Cramer: Stay Away From Cannabis", "keywords": ["cramer", "press", "growth", "trumps", "away", "today", "stay", "cannabis", "stock", "market", "jim", "quarter", "trump", "china", "stocks"], "publish_date": "2020-05-29", "url": "https://www.thestreet.com/investing/stock-market-today-with-jim-cramer-trump-talks-china-cannabis-marvell?puc=yahoo&cm_ven=YAHOO&yptr=yahoo", "summary": "TheStreet's Katherine Ross discussed today's breaking news in the stock market on StreetLightning with Jim Cramer.\nCramer discusses Trump's press conference discussing China, Marvell having an excellent quarter and the future of cannabis stocks.\nPresident Trump's Press Conference on ChinaPresident Trump ended the U.S.'s relationship with the World Health Organization (WHO).\nListen to which stocks Cramer is looking at after Trump's press conference.\nWant to be alerted before Jim Cramer buys or sells any stock?", "text": "Stocks in the Dow Jones, Nasdaq, and S&P 500 we're mixed all day as the stock market tries to close out another crazy week. President Trump has been at the center of the madness this week when Twitter put a warning label on his tweets sharing misinformation. Trump had another warning label put on a tweet after Twitter declared his tweet about responding to the protests in Minneapolis was glorifying violence. The part of the tweet in question was \"...after the looting starts, the shooting starts\" and Trump tweeted an explanation today. TheStreet's Katherine Ross discussed today's breaking news in the stock market on StreetLightning with Jim Cramer."}, "News 7": {"title": "4 Top Stock Trades for Monday: ZS, CGC, OXY, UBER", "keywords": ["resistance", "support", "zs", "average", "trades", "cgc", "20", "uber", "stock", "moving", "prior", "shares", "oxy", "chart"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/4-top-stock-trades-monday-204725429.html", "summary": "With that in mind, let’s look at a few top stock trades for next week.\nTop Stock Trades for Monday No.\n1: Zscaler (ZS)top stock trades for zs MoreClick to EnlargeSource: Chart courtesy of StockCharts.comZscaler (NASDAQ:ZS) shares are ripping higher after better-than-expected earnings.\n3: Occidental Petroleum (OXY)top stock trades for oXY MoreClick to EnlargeSource: Chart courtesy of StockCharts.comOccidental Petroleum (NYSE:OXY) isn’t looking too hot, down 5% on Friday.\n4: Uber (UBER)top stock trades for UBER More", "text": "After a bumpy couple of days, the S&P 500 traded somewhat quietly on Friday, after bouncing off the 3,000 area and 200-day moving average. With that in mind, let’s look at a few top stock trades for next week. Top Stock Trades for Monday No. 1: Zscaler (ZS)  top stock trades for zs More    Click to Enlarge  Source: Chart courtesy of StockCharts.com  Zscaler (NASDAQ:ZS) shares are ripping higher after better-than-expected earnings. Coming into the event, shares were trading higher, grinding up in a modest channel (blue lines) and maintaining about the 20-day moving average."}, "no_of_news": 7, "plot_name": "/content/plots/CGC.png"}, "BBIO": {"company_name": "BridgeBio Pharma, Inc.", "News 1": {"title": "BridgeBio Pharma’s QED Therapeutics Presents Data on Infigratinib in Cholangiocarcinoma and Urothelial Carcinoma at the American Society of Clinical Oncology 2020 Virtual Scientific Program", "keywords": ["urothelial", "society", "presents", "pharmas", "scientific", "response", "virtual", "infigratinib", "oncology", "treatment", "95", "patients", "program", "secondline", "qed", "carcinoma", "therapeutics", "ci"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/bridgebio-pharma-qed-therapeutics-presents-113010572.html", "summary": "SAN FRANCISCO, May 29, 2020 (GLOBE NEWSWIRE) -- BridgeBio Pharma, Inc. (BBIO) affiliate QED Therapeutics announced today that it will present data at the American Society of Clinical Oncology 2020 Virtual Scientific Program showing clinical advancement for infigratinib, QED’s oral FGFR1-3 inhibitor, in both urothelial carcinoma and cholangiocarcinoma (CCA).\nAll eight patients in the study with upper tract urothelial carcinoma (UTUC) received infigratinib as second-line or later therapy.\nThe response rates were higher for patients with UTUC, with an ORR of 50% (95% CI 15.7–84.3) and a disease control rate of 100%.\nThe median PFS was 6.8 months (95% CI 3.9-7.8 months) for third- and later-line infigratinib treatment compared to 4.6 months (95% CI 2.7-7.2 months) for second-line chemotherapy.\nWe plan to conduct further clinical trials to evaluate the potential for infigratinib to treat patients with other FGFR-driven tumor types and rare disorders.", "text": "SAN FRANCISCO, May 29, 2020 (GLOBE NEWSWIRE) -- BridgeBio Pharma, Inc. (BBIO) affiliate QED Therapeutics announced today that it will present data at the American Society of Clinical Oncology 2020 Virtual Scientific Program showing clinical advancement for infigratinib, QED’s oral FGFR1-3 inhibitor, in both urothelial carcinoma and cholangiocarcinoma (CCA). Title: Infigratinib (BGJ398) in advanced/unresectable or metastatic urothelial carcinoma demonstrates consistent treatment response in both first-line and later-line treatment settings  Abstract: 5038  Presenter: Yung Lyou, City of Hope Comprehensive Cancer Center  An analysis of response rates in patients with advanced/unresectable or metastatic urothelial carcinoma based on the amount of prior lines of treatment showed consistent response to infigratinib. The objective response rate (ORR) for all patients (n=67) was 25% (95% CI 15.5-37.5), while the ORR for patients receiving infigratinib as first-line treatment (n=13) saw a response rate of 31% (95% CI 9.1-61.4) compared to 24% (95% CI 13.5-37.6) for patients receiving infigratinib as a second-line or later treatment (n=54). All eight patients in the study with upper tract urothelial carcinoma (UTUC) received infigratinib as second-line or later therapy. The response rates were higher for patients with UTUC, with an ORR of 50% (95% CI 15.7–84.3) and a disease control rate of 100%."}, "no_of_news": 1, "plot_name": "/content/plots/BBIO.png"}, "DXC": {"company_name": "DXC Technology Company", "News 1": {"title": "Why DXC Technology Stock Tumbled Today", "keywords": ["morgan", "revenue", "tumbled", "impairment", "today", "services", "technology", "segment", "stock", "dxc", "dividend", "reported", "jp", "share"], "publish_date": "2020-05-29", "url": "https://www.fool.com/investing/2020/05/29/why-dxc-technology-stock-tumbled-today.aspx?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article&yptr=yahoo", "summary": "What happenedShares of DXC Technology (NYSE:DXC) slumped on Friday after the IT services provider reported mixed fiscal fourth-quarter results, suspended its dividend, and booked a large goodwill impairment charge.\nSo whatDXC reported fourth-quarter revenue of $4.82 billion, down 8.8% year over year and $40 million below the average analyst estimate.\nRevenue in the global business services segment rose 5.3% to $2.31 billion, while revenue in the global infrastructure services segment tumbled 18.8% to $2.51 billion.\nNow whatDXC's report triggered an analyst downgrade from J.P. Morgan, which knocked down its rating to neutral, and reduced its price target from $25 to $17.\nJ.P. Morgan now sees the turnaround taking longer than expected due to increased uncertainty.", "text": "What happened  Shares of DXC Technology (NYSE:DXC) slumped on Friday after the IT services provider reported mixed fiscal fourth-quarter results, suspended its dividend, and booked a large goodwill impairment charge. The stock was down about 12.9% at 1:10 p.m. EDT. So what  DXC reported fourth-quarter revenue of $4.82 billion, down 8.8% year over year and $40 million below the average analyst estimate. Revenue in the global business services segment rose 5.3% to $2.31 billion, while revenue in the global infrastructure services segment tumbled 18.8% to $2.51 billion. Non-GAAP (adjusted) earnings per share came in at $1.20, down from $2.19 in the prior-year period but $0.24 higher than analysts were expecting."}, "News 2": {"title": "DXC Technology Company (DXC) Q4 2020 Earnings Call Transcript", "keywords": ["2020", "company", "q4", "customers", "customer", "work", "technology", "million", "dxc", "impact", "quarter", "revenue", "right", "earnings", "transcript", "business", "billion"], "publish_date": "2020-05-28", "url": "https://www.fool.com/earnings/call-transcripts/2020/05/28/dxc-technology-company-dxc-q4-2020-earnings-call-t.aspx?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article&yptr=yahoo", "summary": "DXC Technology Company (NYSE:DXC)Q4 2020 Earnings Call, 4:45 p.m.\nAs we discussed in the last couple of earnings calls, DXC's main fundamental challenge has been revenue runoff from existing contracts.\nIn fact, we're making good progress on bringing the new DXC to our customers, which should help stem future revenue run-off.\nOur full quarter revenue -- fourth quarter revenue represents a sequential decline of 3.3% in constant currency.\nAnd then overall, would you say you think these conversations are getting will -- has helped you conservatively capture what you're seeing in that $1 billion impact in '21?", "text": "DXC Technology Company (NYSE:DXC)  Q4 2020 Earnings Call  , 4:45 p.m. ET  Contents:  Prepared Remarks  Questions and Answers  Call Participants  Prepared Remarks:  Operator  Good day, and welcome to the DXC conference call. [Operator Instructions]  At this time, I would like to turn the conference over to Shailesh Murali. Please go ahead, sir. Shailesh Murali -- M&A and Investor Relations  Thank you, and good afternoon, everyone."}, "News 3": {"title": "Friday Morning Market Highlights", "keywords": ["company", "morning", "portfolio", "trades", "sales", "million", "market", "quarter", "shares", "lots", "highlights", "share", "earnings"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/friday-morning-market-highlights-161118361.html", "summary": "US marketsU.S. stocks were in the red on Friday morning as U.S. consumer spending sunk by a record 13.6%.\nBig Lots releases earnings reportShares of Big Lots, Inc. (NYSE:BIG) jumped 1% on Friday morning after the company announced its first-quarter results.\nLooking ahead to the second quarter, the company expects diluted earnings per share to be between 65 and 80 cents.\nLee Ainslie (Trades, Portfolio) initiated a new position of 425,716 shares in Big Lots.\nRobert Olstein reduced his holding 4% to 89,000 shares, Joel Greenblatt (Trades, Portfolio) cut his holding 11% to 80,006 shares and Louis Moore Bacon (Trades, Portfolio) sold out of the stock.", "text": "US markets  U.S. stocks were in the red on Friday morning as U.S. consumer spending sunk by a record 13.6%. The Dow Jones Industrial Average lost 0.60% to 25,247, the S&P 500 index dipped 0.39% to 3,018 and the Nasdaq Composite Index was up 0.03% to 9,372. Gainers  o Dollar General Corp (NYSE:DG) +2.6%  o West Pharmaceutical Services Inc (NYSE:WST) +1.4%  o Arista Networks Inc (NYSE:ANET) +2.1%  o Domino's Pizza Inc (NYSE:DPZ) +2%  o Paycom Software Inc (NYSE:PAYC) +2%  Losers  o DXC Technology Co (NYSE:DXC) -9.2%  o Nordstrom Inc (NYSE:JWN) -8.6%  o Coty Inc (NYSE:COTY) -7.2%  o Harley-Davidson Inc (NYSE:HOG) -5.3%  o Flowserve Corp (NYSE:FLS) -3.3%  o Kohls Corp (NYSE:KSS) -4%  Global markets  The main European stock markets traded in the green.The UK's FTSE 100 fell 1.80%, France's CAC 40 declined 1.10%, Germany's Dax swelled 1.39% and Spain's Ibex 35 was down 1.25%. In Asia, Japan's Nikkei 225 slid 0.18%, India's BSE Sensex jumped 0.69%, Hong Kong's Hang Seng declined 0.74% and China's Shanghai Composite rose 0.22%. Big Lots releases earnings report  Shares of Big Lots, Inc. (NYSE:BIG) jumped 1% on Friday morning after the company announced its first-quarter results."}, "News 4": {"title": "Why DXC Technology's Stock Is Trading Lower Today", "keywords": ["trading", "technologys", "quarterly", "today", "services", "technology", "sales", "stock", "lower", "dxc", "reported", "shares", "earnings"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/why-dxc-technologys-stock-trading-145827408.html", "summary": "DXC Technology Co (NYSE: DXC) shares are trading lower on Friday, after the company reported worse-than-expected fourth-quarter sales results.\nDXC Technology reported quarterly earnings of $1.20 per share, which beat the analyst consensus estimate of 99 cents.\nThe company reported quarterly sales of $4.82 billion, which missed the analyst consensus estimate of $4.89 billion.\nDXC Technology is a vendor-independent IT services provider that started trading in April 2017.\nDXC Technology shares were trading down 8.81% at $15.11 at time of publication on Friday.", "text": "DXC Technology Co (NYSE: DXC) shares are trading lower on Friday, after the company reported worse-than-expected fourth-quarter sales results. DXC Technology reported quarterly earnings of $1.20 per share, which beat the analyst consensus estimate of 99 cents. The company reported quarterly sales of $4.82 billion, which missed the analyst consensus estimate of $4.89 billion. View more earnings on DXC  Following earnings, JPMorgan downgraded the stock from Overweight to Neutral and lowered the price target from $25 to $17. DXC Technology is a vendor-independent IT services provider that started trading in April 2017."}, "News 5": {"title": "DXC Technology (DXC) Q4 Earnings Top Estimates, Revenues Miss", "keywords": ["company", "estimates", "q4", "revenues", "technology", "million", "dxc", "fiscal", "zacks", "quarter", "free", "earnings", "miss", "business", "billion"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/dxc-technology-dxc-q4-earnings-135701769.html", "summary": "At $4.82 billion, revenues fell short of the prior-year quarter’s number by 8.8% and also missed the Zacks Consensus Estimate of $4.92 billion.\nDXC Technology Company.\nPrice, Consensus and EPS Surprise MoreDXC Technology Company.\nprice-consensus-eps-surprise-chart | DXC Technology Company.\nClick to get this free reportNVIDIA Corporation (NVDA) : Free Stock Analysis ReportApple Inc. (AAPL) : Free Stock Analysis ReportFortinet, Inc. (FTNT) : Free Stock Analysis ReportDXC Technology Company.", "text": "DXC Technology DXC reported fourth-quarter fiscal 2020 results, wherein the bottom line beat the Zacks Consensus Estimate but the top line missed the same. However, both figures decreased on a year-over-year basis. The company reported non-GAAP earnings of $1.20 per share, which beat the consensus mark by 23.71%. The figure, however, declined from $2.19 reported a year ago. At $4.82 billion, revenues fell short of the prior-year quarter’s number by 8.8% and also missed the Zacks Consensus Estimate of $4.92 billion."}, "News 6": {"title": "DXC Technology Reports Fourth Quarter and Fiscal 2020 Results", "keywords": ["2020", "continuing", "reports", "income", "results", "technology", "fiscal", "dxc", "quarter", "million", "operations", "fourth", "prior", "share", "compared", "costs"], "publish_date": "2020-05-28", "url": "https://finance.yahoo.com/news/dxc-technology-reports-fourth-quarter-201500220.html", "summary": "Revenue in the fourth quarter was $4,815 million compared with $5,280 million in the year ago period.\nAdjusted EBIT was $352 million in the fourth quarter compared with $827 million in the prior year.\nNet cash provided by operating activities was $288 million in the fourth quarter, compared with $748 million in the year ago period.\nRevenue in fiscal 2020 was $19,577 million compared with $20,753 million in the year ago period.\nReturning Capital to Shareholders; Suspension of DividendDuring the fourth quarter, DXC Technology returned $53 million to shareholders in the form of common stock dividends.", "text": "Q4 earnings per share from continuing operations was $(13.79), including the cumulative impact of certain items of $(14.99) per share, reflecting goodwill impairment, restructuring costs, transaction, separation and integration-related costs, amortization of acquired intangible assets, pension and OPEB actuarial and settlement gains, and a tax adjustment  Q4 non-GAAP earnings per share was $1.20  FY20 earnings per share from continuing operations was $(20.76), including the cumulative impact of certain items of $(26.34)  FY20 non-GAAP earnings per share from continuing operations was $5.58  Q4 net cash from operating activities was $288 million and FY20 net cash from operating activities was $2,350 million  Q4 adjusted free cash flow was $131 million and FY20 adjusted free cash flow was $1,341 million  FY20 capital returned to shareholders was $214 million in dividends and $736 million in share repurchases  DXC Technology (NYSE: DXC) today reported results for the three and twelve months ended March 31, 2020. \"I am very proud of how our team at DXC has navigated this world crisis, with an industry leading 99% of our people enabled to work virtually from home,\" said Mike Salvino, president and CEO. \"If COVID-19 taught us anything, it reinforces that what we do is incredibly relevant to today’s market. Our people have done a phenomenal job taking care of themselves and their families, while helping our customers enable their employees to work from home, fix needed upgrades to their IT infrastructure estates, stand-up cloud environments, deal with sudden surges of demand, and innovate. I am pleased with where we ended FY20."}, "no_of_news": 6, "plot_name": "/content/plots/DXC.png"}, "GE": {"company_name": "General Electric Company", "News 1": {"title": "GE’s stock loses nearly 10% in 2 days after CEO Larry Culp warns cash burn will increase", "keywords": ["increase", "larry", "days", "cash", "loses", "nearly", "ceo", "negative", "warns", "ge", "ges", "stock", "recovery", "free", "culp", "covid19", "flow", "billion"], "publish_date": "2020-05-29", "url": "https://www.marketwatch.com/story/ges-stock-loses-more-than-10-in-2-days-after-ceo-larry-culp-warns-cash-burn-will-increase-2020-05-29?siteid=yhoof2&yptr=yahoo", "summary": "Shares of General Electric Co. sank Friday, and have lost nearly 10% over two sessions, after Chief Executive Larry Culp tempered recovery hopes with a more negative outlook for free cash flow.\nThe stock GE, -3.09% dropped 3.1% to close at $6.57, on volume of 129.0 million shares.\nHe provided second-quarter guidance on free cash flow for the first time, suggesting that cash burn could be double what it was in the first quarter.\nThe FactSet consensus for free cash flow is now negative $5.11 billion, compared with a negative $4.02 billion consensus about a week ago.\nOn May 15, about two weeks after GE reported first-quarter results, the stock fell to its lowest close since December 1991.", "text": "Shares of General Electric Co. sank Friday, and have lost nearly 10% over two sessions, after Chief Executive Larry Culp tempered recovery hopes with a more negative outlook for free cash flow. The stock GE, -3.09% dropped 3.1% to close at $6.57, on volume of 129.0 million shares. On Thursday, it had rallied as much as 2.7% to a seven-week high in early trading, before reversing course to close down 7.0%. Thursday’s selloff started accelerating around midmorning, after Culp began speaking as part of the Bernstein Strategic Decisions Conference. He provided second-quarter guidance on free cash flow for the first time, suggesting that cash burn could be double what it was in the first quarter."}, "News 2": {"title": "Why General Electric Stock Just Dropped 5%", "keywords": ["cash", "dropped", "free", "ge", "electric", "stock", "debt", "lot", "general", "tax", "yesterday", "flow", "billion"], "publish_date": "2020-05-29", "url": "https://www.fool.com/investing/2020/05/29/why-general-electric-stock-just-dropped-5.aspx?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article&yptr=yahoo", "summary": "What happenedShares of industrial giant General Electric (NYSE:GE) tumbled 5% in early trading Friday, and remain down 3.6% as of 10:40 a.m. EDT.\nSecond, GE has confirmed a deal to sell its 130-year-old GE Lighting business to Savant Systems in a deal valued at $250 million including GE debt that Savant will assume.\nThird, The Financial Times reported yesterday that the U.K. tax authority is suing General Electric for tax fraud, claiming the company owes about $1 billion in back taxes -- plus interest and penalties on that tax debt.\nNow whatGeneral Electric is a company with a $57 billion market capitalization, but also $57 billion in net debt on its books.\nIt generated $3 billion in free cash flow over the past year, but is on course to burn more than $3 billion in negative free cash flow in this quarter alone.", "text": "What happened  Shares of industrial giant General Electric (NYSE:GE) tumbled 5% in early trading Friday, and remain down 3.6% as of 10:40 a.m. EDT. What precisely is causing GE stock to fall, however, is a matter of opinion. So what  When considering why a stock as gigantic as GE ($57 billion in market capitalization, $93.5 billion in annual sales) is going down, you have to expect that there will be a lot of factors at work. First and foremost, as my colleague Lou Whiteman pointed out yesterday, GE CEO Larry Culp revealed at an investor conference yesterday that free cash flow will be a lot worse than the $2.5 billion Wall Street has been estimating so far -- as much as $3.5 billion to $4.5 billion -- and that GE will end the year burning cash as well. Second, GE has confirmed a deal to sell its 130-year-old GE Lighting business to Savant Systems in a deal valued at $250 million including GE debt that Savant will assume."}, "News 3": {"title": "Better Buy: Baker Hughes vs. Core Laboratories N.V.", "keywords": ["laboratories", "core", "buy", "labs", "services", "vs", "oil", "nv", "better", "hughes", "investors", "baker", "energy", "industry", "companies"], "publish_date": "2020-05-29", "url": "https://www.fool.com/investing/2020/05/29/better-buy-baker-hughes-vs-core-laboratories-nv.aspx?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article&yptr=yahoo", "summary": "That's left services companies like Baker Hughes (NYSE:BKR) and Core Laboratories (NYSE:CLB) reeling as revenues dry up.\nSo it's not surprising that Baker Hughes stock is down roughly 40% so far this year, with Core Labs off by nearly 50%.\nGE, working through a difficult turnaround, has openly stated it wishes to sell its remaining stake in Baker Hughes.\nThat means GE could start selling shares as Baker Hughes' stock recovers, potentially dampening the upside here for a bit.\nIn the end, more conservative types would probably be better off avoiding Baker Hughes, too, at least until the situation with GE is settled.", "text": "Capital spending is the lifeblood of energy services companies. With oil trading at historically low levels, exploration and production (E&P) companies have pulled back hard on spending plans. That's left services companies like Baker Hughes (NYSE:BKR) and Core Laboratories (NYSE:CLB) reeling as revenues dry up. Investors have been fleeing, leading to deep price declines. Is this an opportunity for long-term investors in either company?"}, "News 4": {"title": "Price Over Earnings Overview: General Electric", "keywords": ["longterm", "companys", "past", "overview", "price", "electric", "stock", "performance", "general", "investors", "share", "pe", "earnings", "perform"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/price-over-earnings-overview-general-152636563.html", "summary": "Right now, General Electric Inc. (NYSE:GE) share price is at $6.58, after a 2.95% drop.\nWith questionable short-term performance like this, and great long-term performance, long-term shareholders might want to start looking into the company's price-to-earnings ratio.\nThe P/E ratio measures the current share price to the company's EPS.\nGeneral Electric has a lower P/E than the aggregate P/E of 24.11 of the specialty industrial machinery industry.\nDepending on the earnings makeup of a company, investors may not be able to attain key insights from trailing earnings.", "text": "Right now, General Electric Inc. (NYSE:GE) share price is at $6.58, after a 2.95% drop. Over the past month, the stock went up by 1.15%, but over the past year, it actually decreased by 30.95%. With questionable short-term performance like this, and great long-term performance, long-term shareholders might want to start looking into the company's price-to-earnings ratio. The stock is currently above from its 52 week low by 20.07%. Assuming that all other factors are held constant, this could present itself as an opportunity for investors trying to diversify their portfolio with specialty industrial machinery stocks, and capitalize on the lower share price observed over the year."}, "no_of_news": 4, "plot_name": "/content/plots/GE.png"}, "NLY": {"company_name": "Annaly Capital Management, Inc.", "News 1": {"title": "Why Is Annaly (NLY) Up 1.4% Since Last Earnings Report?", "keywords": ["paa", "excluding", "stock", "quarter", "nly", "prior", "14", "score", "annaly", "reported", "quarters", "earnings", "report"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/why-annaly-nly-1-4-153103829.html", "summary": "It has been about a month since the last earnings report for Annaly Capital Management (NLY).\nWill the recent positive trend continue leading up to its next earnings release, or is Annaly due for a pullback?\nAnnaly Earnings Meet Estimates in Q1, NII DeclinesAnnaly reported first-quarter 2020 core earnings, excluding premium amortization adjustment (PAA), of 21 cents per share, meeting the Zacks Consensus Estimate.\nNII was $51.6 million, marking a steep decline from the prior quarter’s $454.2 million as well as the year-ago period’s $218.5 million.\nIn the reported quarter, average yield on interest-earning assets (excluding PAA) was 2.91%, down from the prior quarter’s 3.25%.", "text": "It has been about a month since the last earnings report for Annaly Capital Management (NLY). Shares have added about 1.4% in that time frame, underperforming the S&P 500. Will the recent positive trend continue leading up to its next earnings release, or is Annaly due for a pullback? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recent earnings report in order to get a better handle on the important drivers. Annaly Earnings Meet Estimates in Q1, NII Declines    Annaly reported first-quarter 2020 core earnings, excluding premium amortization adjustment (PAA), of 21 cents per share, meeting the Zacks Consensus Estimate."}, "no_of_news": 1, "plot_name": "/content/plots/NLY.png"}, "BAC": {"company_name": "Bank of America Corporation", "News 1": {"title": "Older Crowd Embraces Online Banking, Rewards Firms’ Digital Push", "keywords": ["crowd", "banking", "online", "bank", "firms", "crisis", "customers", "clients", "older", "services", "rewards", "embraces", "mobile", "digital", "branches", "push", "business"], "publish_date": "2020-05-31", "url": "https://finance.yahoo.com/news/older-crowd-embraces-online-banking-160000682.html", "summary": "(Bloomberg) -- It took a global pandemic to get many baby boomers to bank online.\nFor JPMorgan Chase & Co., existing online clients are using the offerings more frequently, while Bank of America Corp. found that older customers are seeking out its digital services.\nIn April, 23% of new logins to Bank of America’s online and mobile products were by seniors and boomers, Moynihan said.\nThe pandemic sparked 12% of the people polled to enroll in online or mobile banking.\nBut the bank’s move to boost online services hasn’t always been smooth -- it delayed until next year the digital offering for its wealth-management unit.", "text": "(Bloomberg) -- It took a global pandemic to get many baby boomers to bank online. Lenders have taken notice. Over the past two months, Americans flocked to websites and apps to manage their finances as the coronavirus limited access to branches, according industry executives. For JPMorgan Chase & Co., existing online clients are using the offerings more frequently, while Bank of America Corp. found that older customers are seeking out its digital services. “We may have opened some people’s eyes to the future,” Bank of America Chief Executive Officer Brian Moynihan told investors at a conference last week."}, "News 2": {"title": "Dubai faces 5.5% recession this year as $10 bln debt repayments loom, BofA says", "keywords": ["america", "dubais", "gdp", "faces", "bank", "billion", "loom", "bofa", "debt", "dubai", "governmentrelated", "fiscal", "expected", "repayments", "recession", "55", "bln"], "publish_date": "2020-05-31", "url": "https://finance.yahoo.com/news/dubai-faces-5-5-recession-131621122.html", "summary": "DUBAI, May 31 (Reuters) - Dubai could see a recession of around 5.5% in 2020 as it faces about $10 billion in debt maturities this year while revenues are expected to drop in line with the pattern of the 2009 crisis, Bank of America said in a research note.\nMeasures to stem the spread of the coronavirus have dealt a blow to Dubai's economy, bringing vital industries like tourism and aviation to a near halt.\nFinancing of the fiscal deficit or liquidity injection into government-related entities (GREs) will likely primarily be via loans from ENBD, Bank of America said.\nDubai could also draw on $1.4 billion in deposits at ENBD or issue privately placed bonds.\nCiting IMF data, the bank said Dubai and government-related entities face some $10 billion in debt repayments this year.", "text": "DUBAI, May 31 (Reuters) - Dubai could see a recession of around 5.5% in 2020 as it faces about $10 billion in debt maturities this year while revenues are expected to drop in line with the pattern of the 2009 crisis, Bank of America said in a research note. Measures to stem the spread of the coronavirus have dealt a blow to Dubai's economy, bringing vital industries like tourism and aviation to a near halt. Bank of America estimates that Dubai's fiscal deficit could widen to $4.4 billion, or 3.9% of GDP, and could be as high as 5.3% if interest payments on a loan from Emirates NBD, Dubai's biggest lender, are included. Financing of the fiscal deficit or liquidity injection into government-related entities (GREs) will likely primarily be via loans from ENBD, Bank of America said. Dubai could also draw on $1.4 billion in deposits at ENBD or issue privately placed bonds."}, "News 3": {"title": "Fed's corp bond facility bought 15 ETFs in first days of operations", "keywords": ["days", "corporate", "corp", "bought", "etfs", "purchases", "trades", "showedthe", "feds", "facility", "15", "operations", "transactions", "smccfs", "week", "data", "bond"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/feds-corp-bond-facility-bought-175131399.html", "summary": "May 29 (Reuters) - The Federal Reserve's new facility for corporate bond purchases bought about $1.3 billion of shares in 15 exchange-traded funds in its first week of operation through 158 trades, data released Friday showed.\nThe Secondary Market Corporate Credit Facility made the purchases from 10 securities firms between its launch on May 12 and May 18, the data showed in the Fed's first detailed disclosure of the SMCCF's transactions.\nIts largest holding as of May 19 was the iShares Iboxx US Dollar Investment Grade Corporate Bond ETF at $326.3 million.\n(Reporting By Dan Burns)", "text": "May 29 (Reuters) - The Federal Reserve's new facility for corporate bond purchases bought about $1.3 billion of shares in 15 exchange-traded funds in its first week of operation through 158 trades, data released Friday showed. The Secondary Market Corporate Credit Facility made the purchases from 10 securities firms between its launch on May 12 and May 18, the data showed in the Fed's first detailed disclosure of the SMCCF's transactions. Its largest holding as of May 19 was the iShares Iboxx US Dollar Investment Grade Corporate Bond ETF at $326.3 million. (Reporting By Dan Burns)"}, "News 4": {"title": "U.S. Consumer Spending Plunges While Stimulus Boosts Incomes", "keywords": ["record", "plunges", "income", "stimulus", "month", "spending", "boosts", "sentiment", "prior", "fell", "incomes", "consumer", "report", "showed"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/u-consumer-spending-plunges-government-124739559.html", "summary": "(Bloomberg) -- U.S. consumer spending plunged in April by the most on record as widespread government lockdowns largely prevented Americans from spending federal stimulus payments in the month.\nHousehold outlays fell 13.6% from the prior month, the sharpest drop in more than six decades worth of data, a Commerce Department report showed Friday.\nIncomes posted a record 10.5% increase, compared with estimates for a 5.9% decline, as federal stimulus payments were distributed under the CARES Act, the report said.\nIt showed government social benefits rose by $3 trillion in April, up from a $70.2 billion gain the prior month.\nU.S. stocks fell as investors weighed the decline in consumer spending and awaited President Donald Trump’s latest response in his escalating feud with China.", "text": "(Bloomberg) -- U.S. consumer spending plunged in April by the most on record as widespread government lockdowns largely prevented Americans from spending federal stimulus payments in the month. Household outlays fell 13.6% from the prior month, the sharpest drop in more than six decades worth of data, a Commerce Department report showed Friday. The median estimate in a Bloomberg survey of economists called for a 12.8% decline. Incomes posted a record 10.5% increase, compared with estimates for a 5.9% decline, as federal stimulus payments were distributed under the CARES Act, the report said. It showed government social benefits rose by $3 trillion in April, up from a $70.2 billion gain the prior month."}, "News 5": {"title": "RPT-Crisis-hit Wall Street checks in to Zandi's \"impairment studio\"", "keywords": ["zandi", "street", "checks", "lenders", "studio", "losses", "rptcrisishit", "impairment", "wall", "zandis", "forecasts", "banks", "moodys", "economist", "economy", "scenarios"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/rpt-crisis-hit-wall-street-110000958.html", "summary": "(Repeats with no changes to text)By David HenryNEW YORK, May 29 (Reuters) - When Wall Street doesn't know where the world economy is heading, it books a session at Mark Zandi's \"impairment studio\".\nAt least 59 U.S. lenders, including Truist Financial Corp, , the country's eighth biggest by assets, and smaller lenders have said they used Moody's scenarios, Keefe, Bruyette & Woods research shows.\nWhile bigger lenders have stayed mum about Moody's, a bank economist who declined to be named said they check their numbers against Zandi's forecasts.\nDuring earnings calls, analysts pressed for details on which economic forecasts banks had used.\nSince then, Zandi’s mid-April forecast showed the second-quarter rate of GDP at -30% and mid-May at -33%.", "text": "(Repeats with no changes to text)  By David Henry  NEW YORK, May 29 (Reuters) - When Wall Street doesn't know where the world economy is heading, it books a session at Mark Zandi's \"impairment studio\". Faced with a pandemic-fueled recession with few historical comparisons and a new accounting rule requiring lenders to total up expected losses even before borrowers default, scores of U.S. banks are relying on forecasts from Zandi, the chief economist of Moody's Analytics, to help with their calculations. The exercise is critical to billions of dollars in quarterly earnings and one that, depending on the actions of regulators, could hit capital levels enough to choke a recovery. \"It feels like we're in the center of the universe,\" Zandi, 61, told Reuters. \"But, at the moment, the economy is at the center of everything.\""}, "no_of_news": 5, "plot_name": "/content/plots/BAC.png"}, "MRO": {"company_name": "Marathon Oil Corporation", "News 1": {"title": "Marathon Oil Stock Will Continue to Limp Along as the Pandemic Continues", "keywords": ["ratio", "company", "limp", "cash", "current", "continues", "price", "oil", "million", "stock", "marathon", "continue", "mro", "pandemic"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/marathon-oil-stock-continue-limp-114852024.html", "summary": "Marathon Oil (NYSE:MRO) is one of the many oil and gas producers pushed to the limit due to the novel coronavirus.\nMRO stock has shed 56% of its value since December 2019, whereas the SPDR Energy Select Sector exchange-traded fund dropped 35% in the same period.\nMRO Stock Will Continue to Limp Along as the Pandemic Continues MoreSource: IgorGolovniov / Shutterstock.comMorgan Stanley (NYSE: MS) recently turned bearish on MRO stock due to its challenging outlook and substantial debt levels.\nInvestorPlace - Stock Market News, Stock Advice & Trading TipsMRO Stock and a Dismal Q1The first quarter was tough for Marathon, mainly due to the substantial dip in demand for crude oil and considerable reductions in oil prices.\nMorgan Stanley believes MRO stock should be valued at $5, which is roughly 18% lower than its current price.", "text": "Marathon Oil (NYSE:MRO) is one of the many oil and gas producers pushed to the limit due to the novel coronavirus. MRO stock has shed 56% of its value since December 2019, whereas the SPDR Energy Select Sector exchange-traded fund dropped 35% in the same period. MRO Stock Will Continue to Limp Along as the Pandemic Continues More  Source: IgorGolovniov / Shutterstock.com  Morgan Stanley (NYSE: MS) recently turned bearish on MRO stock due to its challenging outlook and substantial debt levels. CEO Lee Tillman believes the company is undergoing unprecedented challenges. Still, I believe it has enough in the tank to emerge from this crisis as a stronger company with a leaner cost structure and sufficient financial flexibility."}, "News 2": {"title": "US Oil & Gas Rig Tally Sets Record Lows for 3 Straight Weeks", "keywords": ["record", "tally", "22", "analysis", "oil", "count", "straight", "stock", "lows", "sets", "week", "free", "rigs", "gas", "priorweek", "weeks", "rig"], "publish_date": "2020-05-26", "url": "https://finance.yahoo.com/news/us-oil-gas-rig-tally-124812511.html", "summary": "US Removes 21 Oil Rigs: Oil rig count was 237 in the week through May 22, compared with 258 in the week ended May 15.\nNatural Gas Rig Count Flat in US: The natural gas rig count of 79 is in line with the prior-week count.\nGulf of Mexico (GoM) Rig Count Flat: The GoM rig count is 12 units, of which all were oil-directed.\nImportantly, the oil rig count dropped for 10 consecutive weeks in Permian.\nClick to get this free reportTransocean Ltd. (RIG) : Free Stock Analysis ReportMarathon Oil Corporation (MRO) : Free Stock Analysis ReportSchlumberger Limited (SLB) : Free Stock Analysis ReportHalliburton Company (HAL) : Free Stock Analysis ReportDiamond Offshore Drilling, Inc. (DO) : Free Stock Analysis ReportOccidental Petroleum Corporation (OXY) : Free Stock Analysis ReportBaker Hughes Company (BKR) : Free Stock Analysis ReportTo read this article on Zacks.com click here.", "text": "In its weekly release, Baker Hughes Company BKR reported a drop in the U.S. rig count. More on the Rig Count  Baker Hughes’ data, issued at the end of every week since 1944, helps energy service providers gauge the overall business environment of the oil and gas industry. A change in the Houston-based oilfield service player’s rotary rig count affects demand for energy services like drilling, completion and production provided by the likes of Halliburton Company HAL, Schlumberger Limited SLB, Diamond Offshore Drilling, Inc DO and Transocean Ltd. RIG. Details  Total US Rig Count Falls: Rigs engaged in the exploration and production of oil and natural gas in the United States fell to an all-time low of 318 in the week through May 22, compared with the prior-week count of 339. The current national rig count is below the prior year’s 983."}, "no_of_news": 2, "plot_name": "/content/plots/MRO.png"}}, "NSE": {"JSWSTEEL.NS": {"company_name": "JSW Steel Ltd.", "News 1": {"title": "JSW Steel to Focus on Exports, Revisit Costs as Demand Slumps", "keywords": ["tons", "jsw", "revisit", "demand", "focus", "steel", "million", "slumps", "india", "indias", "capacity", "ore", "iron", "exports", "costs"], "publish_date": "2020-05-26", "url": "https://finance.yahoo.com/news/jsw-steel-focus-exports-revisit-072328473.html", "summary": "(Bloomberg) -- JSW Steel Ltd., India’s most valuable steelmaker by market capitalization, will focus on exports, cut costs and delay expansions as the coronavirus pandemic slashes demand at home.\nOnce a bright spot for global demand, steel consumption in India plunged 91% last month while crude steel output tumbled 70% as a nationwide lockdown to combat the pandemic halted activity across industries.\nWith India’s steel consumption forecast to decline by 10% this financial year, the steel mill will focus on exports for at least the next six months, he said.\nA drop in local iron ore prices and imported coking coal rates, together with a weaker Indian currency will make exports more competitive, he said.\nThe company’s total iron ore requirement will be 30 million to 32 million tons this year.", "text": "(Bloomberg) -- JSW Steel Ltd., India’s most valuable steelmaker by market capitalization, will focus on exports, cut costs and delay expansions as the coronavirus pandemic slashes demand at home. Once a bright spot for global demand, steel consumption in India plunged 91% last month while crude steel output tumbled 70% as a nationwide lockdown to combat the pandemic halted activity across industries. Recovery in India’s demand will be gradual and may only gather pace in the second half of the year started April as the industry is facing shortages of labor, logistics and liquidity, according to JSW Steel’s Joint Managing Director Seshagiri Rao. With India’s steel consumption forecast to decline by 10% this financial year, the steel mill will focus on exports for at least the next six months, he said. “For companies like us the strategy is, whatever demand will pick up in India, we will service that demand, and whatever balance is being left out, we will export,” he said in an interview."}, "no_of_news": 1, "plot_name": "/content/nse_plots/JSWSTEEL.NS.png"}, "TATASTEEL.NS": {"company_name": "Tata Steel Ltd.", "News 1": {"title": "‘Project Birch’: Treasury draws up last resort bailout plan to rescue Britain’s largest companies", "keywords": ["project", "support", "plan", "rescue", "birch", "resort", "draws", "scheme", "job", "largest", "treasury", "furloughed", "coronavirus", "companies", "britains", "options", "billion"], "publish_date": "2020-05-25", "url": "https://www.marketwatch.com/story/project-birch-treasury-draws-up-last-resort-bailout-plan-to-rescue-britains-largest-companies-2020-05-25?siteid=yhoof2&yptr=yahoo", "summary": "Britain’s finance chief Rishi Sunak has drawn up a bailout plan to rescue strategically important companies, which could see the Treasury support key industries on a “last resort” basis once all other options have been exhausted.\n“We have put in place unprecedented levels of support to help businesses get through this crisis.\nSeveral companies in key sectors including steel, aviation and aerospace are struggling with severe financial difficulties.\nAs of May 19, eight million jobs have now been furloughed with £11.1 billion claimed so far through the Coronavirus Job Retention Scheme (CJRS), according to government data.\nTransport Secretary Grant Schapps mentioned “Project Birch” in Parliament last week in reference to the future of the aviation sector.", "text": "Britain’s finance chief Rishi Sunak has drawn up a bailout plan to rescue strategically important companies, which could see the Treasury support key industries on a “last resort” basis once all other options have been exhausted. Under the plan — dubbed “Project Birch — Sunak has increased the Treasury’s capacity to handle bailouts on a case-by-case basis of viable companies, whose failure will “disproportionately harm the economy” if options including the government’s existing loan schemes or shareholder support haven’t worked. “We have put in place unprecedented levels of support to help businesses get through this crisis. Beyond that, many firms are getting support from established market mechanisms, such as existing shareholders, bank lending and commercial finance,” a spokeswoman from the Treasury said in an emailed statement. “In exceptional circumstances, where a viable company has exhausted all options and its failure would disproportionately harm the economy, we may consider support on a ‘last resort’ basis."}, "no_of_news": 1, "plot_name": "/content/nse_plots/TATASTEEL.NS.png"}, "HDFC.NS": {"company_name": "Housing Development Finance Corporation Ltd.", "News 1": {"title": "Existing home sales tumble 17.8% in April", "keywords": ["existing", "senate", "far", "fauci", "fall", "sales", "dr", "178", "tumble", "bridge", "testifies", "opening", "schools"], "publish_date": "2020-05-21", "url": "https://finance.yahoo.com/video/existing-home-sales-tumble-17-191138211.html", "summary": "Dr. Fauci testifies before senate, says opening schools in the fall is 'a bridge too far'", "text": "Dr. Fauci testifies before senate, says opening schools in the fall is 'a bridge too far'"}, "no_of_news": 1, "plot_name": "/content/nse_plots/HDFC.NS.png"}, "DRREDDY.NS": {"company_name": "Dr. Reddys Laboratories Ltd.", "News 1": {"title": "Dr. Reddy's (RDY) Q4 Earnings Increase Y/Y, Revenues Beat", "keywords": ["2020", "increase", "company", "q4", "laboratories", "rdy", "revenues", "beat", "reddys", "million", "dr", "fiscal", "yy", "zacks", "reported", "earnings"], "publish_date": "2020-05-21", "url": "https://finance.yahoo.com/news/dr-reddys-rdy-q4-earnings-135601926.html", "summary": "Dr. Reddy's Laboratories Ltd. RDY reported fourth-quarter fiscal 2020 earnings of 61 cents per American Depositary Share (\"ADS\"), compared with 35 cents in the year-ago quarter.\nQuarter in DetailDr. Reddy’s reported revenues under three segments — Global Generics, Pharmaceutical Services & Active Ingredients (“PSAI”), and Proprietary Products and Others.\nFiscal 2020 ResultsThe company reported fiscal 2020 earnings of $1.56 per ADS, up from $1.50 in fiscal 2019.\nOur TakeIn fourth-quarter fiscal 2020, Dr. Reddy’s top and bottom lines registered year-over-year growth.\nDr. Reddys Laboratories Ltd PriceDr. Reddys Laboratories Ltd Price MoreDr. Reddys Laboratories Ltd price | Dr. Reddys Laboratories Ltd QuoteZacks Rank & Key PicksDr. Reddy’s currently has a Zacks Rank #2 (Buy).", "text": "Dr. Reddy's Laboratories Ltd. RDY reported fourth-quarter fiscal 2020 earnings of 61 cents per American Depositary Share (\"ADS\"), compared with 35 cents in the year-ago quarter. Moreover, revenues grew 10% year over year to $588 million. Revenues also surpassed the Zacks Consensus Estimate of $552 million. So far this year, shares of the company have gained 27.5% against the industry’s decline of 7.7%. Quarter in Detail  Dr. Reddy’s reported revenues under three segments — Global Generics, Pharmaceutical Services & Active Ingredients (“PSAI”), and Proprietary Products and Others."}, "News 2": {"title": "Dr. Reddy’s Q4 & FY20 Financial Results", "keywords": ["products", "rs", "q4", "growth", "revenues", "income", "fy20", "reddys", "results", "dr", "yoy", "qoq", "profit", "financial", "billion"], "publish_date": "2020-05-20", "url": "https://finance.yahoo.com/news/dr-reddy-q4-fy20-financial-104500118.html", "summary": "75.39Dr. Reddy’s Laboratories Limited and Subsidiaries Consolidated Income Statement Particulars Q4 FY20 Q4 FY19 YoYGr % Q3 FY20 QoQGr% ($) (Rs.)\n36.4 billion, YoY growth of 20% and QoQ growth of 1%.\nThe Q4 revenues were partially impacted due to logistics related disruptions caused by COVID-19 lock-downs.\n3.4 billion, YoY growth of 80% and QoQ growth of 11%.\n7.2 billion, YoY growth of 6% and QoQ growth of 4%.", "text": "Dr. Reddy’s Laboratories Ltd. (BSE: 500124 | NSE: DRREDDY | NYSE: RDY) today announced its consolidated financial results for the fourth quarter and full year ended March 31, 2020 under International Financial Reporting Standards (IFRS). Q4 Performance Summary FY20 Performance Summary Rs. 4,432 Cr Rs. 17,460 Cr Revenue Revenue [Up: 1% QoQ; Up: 10% YoY] [Up: 13% YoY] 51.5% 53.8% Gross Margin Gross Margin [Q3 FY20: 54.1%; Q4 FY19: 52.4%] [FY19: 54.2%] Rs. 1,218 Cr Rs."}, "News 3": {"title": "Dr. Reddy's to release Q4 and full year FY 20 results on May 20, 2020", "keywords": ["2020", "company", "companys", "q4", "release", "statements", "20", "reddys", "results", "dr", "performance", "fy", "website", "available", "earnings", "91"], "publish_date": "2020-05-07", "url": "https://finance.yahoo.com/news/dr-reddys-release-q4-full-085000043.html", "summary": "Earnings call slated for May 20 @ 5:15 PM IST / 7:45 AM EDTDr. Reddy's Laboratories Ltd. (BSE: 500124, NSE: DRREDDY, NYSE: RDY) will announce results for the fourth quarter and full year ended March 31, 2020 on Wednesday, May 20, 2020 after the Board Meeting.\n(Dial In and other details given below)Play BackThe play back will be available after the earnings call, till May 27th, 2020.\nFor play back dial in phone No: +91 22 7194 5757 | +91 22 6663 5757, and Playback Code is 74886.\nAbout Dr. Reddy’s: Dr. Reddy’s Laboratories Ltd. (BSE: 500124, NSE: DRREDDY, NYSE: RDY) is an integrated pharmaceutical company, committed to providing affordable and innovative medicines for healthier lives.\nDr Reddy’s operates in markets across the globe.", "text": "Earnings call slated for May 20 @ 5:15 PM IST / 7:45 AM EDT  Dr. Reddy's Laboratories Ltd. (BSE: 500124, NSE: DRREDDY, NYSE: RDY) will announce results for the fourth quarter and full year ended March 31, 2020 on Wednesday, May 20, 2020 after the Board Meeting. Summary of Events  Event Date and Time Medium Release of financial results May 20th, after the Board Meeting Stock Exchange, Media, Company website, Business wire, Email Press meet presentation Will be available on the Company’s website Company’s website www.drreddys.com Earnings Call May 20th, 5:15 PM IST / 7:45 AM EDT Hosted by the Company (Details below) Playback of Earnings Call After the earnings call till May 27th, 2020 Details below Transcript of the Earnings call Will be available on the Company’s website URL available on Company’s website, www.drreddys.com  Earnings Call  Following the release, the management of the Company will host an earnings call to discuss the Company’s financial performance. (Dial In and other details given below)  Play Back  The play back will be available after the earnings call, till May 27th, 2020. For play back dial in phone No: +91 22 7194 5757 | +91 22 6663 5757, and Playback Code is 74886. Conference Dial-In Numbers Universal Access Number: +91 22 6280 1219 +91 22 7115 8120 Local Access Number: Available all over India +91 70456 71221 International Toll Free Number: USA: 1 866 746 2133 UK: 0 808 101 1573 Singapore: 800 101 2045 Hong Kong: 800 964 448  No password/pin number is necessary to dial in to any of the above numbers."}, "News 4": {"title": "Dr. Reddy's Laboratories Received Approval for Their NDA, ELYXYB™ (celecoxib oral solution) 25 mg/mL, in the U.S.", "keywords": ["celecoxib", "laboratories", "migraine", "elyxyb", "reddys", "solution", "dr", "treatment", "renal", "patients", "serious", "oral", "mgml", "events", "including", "risk", "nda", "received"], "publish_date": "2020-05-06", "url": "https://finance.yahoo.com/news/dr-reddys-laboratories-received-approval-171500561.html", "summary": "Dr. Reddy’s Laboratories Ltd. (BSE: 500124, NSE: DRREDDY, NYSE: RDY, along with its subsidiaries together referred to as \"Dr. Reddy’s\") today announced approval of ELYXYB (celecoxib oral solution 25 mg/mL) by the U.S. Food and Drug Administration (USFDA).\nErez Israeli, CEO of Dr. Reddy’s Laboratories, commented, \"We are excited about the approval of ELYXYB.\nThe results from pivotal studies with ELYXYB established efficacy of celecoxib in the treatment of migraine with very few adverse events.\nElevations of ALT or AST (less than three times ULN) may occur in up to 15% of patients treated with NSAIDs, including ELYXYB.\nLong-term administration of NSAIDs, including celecoxib, the active ingredient in ELYXYB, has resulted in renal papillary necrosis and other renal injury.", "text": "Dr. Reddy’s Laboratories Ltd. (BSE: 500124, NSE: DRREDDY, NYSE: RDY, along with its subsidiaries together referred to as \"Dr. Reddy’s\") today announced approval of ELYXYB (celecoxib oral solution 25 mg/mL) by the U.S. Food and Drug Administration (USFDA). ELYXYB (previously known as DFN-15) is indicated for the acute treatment of migraine with or without aura in adults. ELYXYB is the latest product emerging from Dr. Reddy’s portfolio of successful acute migraine treatments. The company is working to commercialize this product through partners. Erez Israeli, CEO of Dr. Reddy’s Laboratories, commented, \"We are excited about the approval of ELYXYB."}, "News 5": {"title": "Dr. Reddy's Laboratories Announces the Launch of Desmopressin Acetate Injection USP, 4 mcg/mL in the U.S. Market", "keywords": ["laboratories", "announces", "products", "markets", "statements", "injection", "reddys", "services", "dr", "mcgml", "market", "pharmaceutical", "launch", "desmopressin", "usp", "sungen"], "publish_date": "2020-05-06", "url": "https://finance.yahoo.com/news/dr-reddys-laboratories-announces-launch-073400078.html", "summary": "Dr. Reddy’s Laboratories Ltd. (BSE: 500124, NSE: DRREDDY, NYSE: RDY, along with its subsidiaries together referred to as \"Dr. Reddy’s\") today announced the launch of Desmopressin Acetate Injection USP, 4 mcg/mL Single-dose Ampules, a therapeutic equivalent generic version of DDAVP (desmopressin acetate) Injection , 4 mcg/mL, approved by the U.S. Food and Drug Administration (USFDA).\nMarc Kikuchi, CEO, North America Generics, Dr. Reddy’s Laboratories, commented, \"The launch of Desmopressin Injection demonstrates a strong, growing collaboration with SunGen Pharma.\nIsaac Liu, Ph.D., Co-CEO of SunGen, stated, \"We are pleased to be working with Dr. Reddy’s for this launch.\nDr. Reddy’s Desmopressin Acetate Injection USP, 4 mcg/mL is available in a carton of ten 1 mL single-dose ampules.\nDDAVP is a trademark owned or licensed by Ferring Pharmaceuticals, Inc*IQVIA Retail and Non-Retail MAT March 2020RDY-0520-293About Dr. Reddy’s: Dr. Reddy’s Laboratories Ltd. (BSE: 500124, NSE: DRREDDY, NYSE: RDY) is an integrated pharmaceutical company, committed to providing affordable and innovative medicines for healthier lives.", "text": "Dr. Reddy’s Laboratories Ltd. (BSE: 500124, NSE: DRREDDY, NYSE: RDY, along with its subsidiaries together referred to as \"Dr. Reddy’s\") today announced the launch of Desmopressin Acetate Injection USP, 4 mcg/mL Single-dose Ampules, a therapeutic equivalent generic version of DDAVP (desmopressin acetate) Injection , 4 mcg/mL, approved by the U.S. Food and Drug Administration (USFDA). The DDAVP (desmopressin acetate) Injection USP brand and generic market had U.S. sales of approximately $20.9 million MAT for the most recent twelve months ending in March 2020 according to IQVIA Health*. Marc Kikuchi, CEO, North America Generics, Dr. Reddy’s Laboratories, commented, \"The launch of Desmopressin Injection demonstrates a strong, growing collaboration with SunGen Pharma. We look forward to future opportunities with this company.\" Isaac Liu, Ph.D., Co-CEO of SunGen, stated, \"We are pleased to be working with Dr. Reddy’s for this launch."}, "no_of_news": 5, "plot_name": "/content/nse_plots/DRREDDY.NS.png"}}, "FOREX": {"EURUSD=X": {"currency_pair": "EUR/USD", "News 1": {"title": "The Week Ahead – Stats, Geopolitics, and Central Banks to Test the Markets", "keywords": ["stats", "numbers", "half", "markets", "ahead", "figures", "test", "busy", "central", "economic", "banks", "focus", "sector", "geopolitics", "week"], "publish_date": "2020-05-31", "url": "https://finance.yahoo.com/news/week-ahead-stats-geopolitics-central-020311888.html", "summary": "On the MacroIt’s a busy week ahead on the economic calendar, with 60 stats in focus in the week ending 5th June.\nFor the Dollar:While it’s another busy week ahead on the economic data front.\nFor the EUR:It’s yet another busy week ahead on the economic data front.\nFor the Loonie:It’s a relatively busy week ahead on the economic calendar.\nOut of AsiaFor the Aussie Dollar:It’s a busy week ahead for the Aussie Dollar.", "text": "On the Macro  It’s a busy week ahead on the economic calendar, with 60 stats in focus in the week ending 5th June. In the week prior, 58 stats had also been in focus. For the Dollar:  While it’s another busy week ahead on the economic data front. Some data will garner more attention than others, however. In the first half of the week, we have May’s ISM Manufacturing and Non-Manufacturing PMIs."}, "News 2": {"title": "FOREX-Dollar weak vs. euro as month-end flows weigh", "keywords": ["european", "monthend", "rally", "euro", "steady", "weak", "dollar", "vs", "flows", "straight", "weigh", "talks", "forexdollar", "saqib", "week", "president"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/forex-dollar-weak-vs-euro-195840307.html", "summary": "The euro was 0.13% higher at $1.1091, its fourth straight day of gains.\nMonth-end adjustments to portfolio hedges, after a more than 3% rally in May for U.S. stocks, was also weighing on the dollar, said Stephen Innes, chief global markets strategist at AxiCorp.\n\"The 3%-plus jump in equities this month suggests a medium-sized USD sell program into month-end,\" said Innes.\nThe pound was about little-changed against the euro and the dollar ahead of a new round of Brexit talks next week.\n(Reporting by Saqib Iqbal Ahmed; additional reporting by Julien Ponthus and Tom Westbroolk; editing by Jonathan Oatis and Daniel Wallis)", "text": "* Euro logs 4th straight day of gains vs dollar  * Sterling steady ahead of Brexit talks next week (Updates to U.S. afternoon)  By Saqib Iqbal Ahmed  NEW YORK, May 29 (Reuters) - The dollar edged lower against the euro on Friday, hurt by month-end flows and as the common currency continued to enjoy a boost from the European Union's recently announced plan to prop up the bloc's coronavirus-hit economies with a 750 billion-euro ($828 billion) recovery fund. The greenback was little moved after U.S. President Donald Trump said on Friday he was directing his administration to begin the process of eliminating special treatment for Hong Kong, in response to China's plans to impose new security legislation in the territory. \"I think traders were bracing for the possibility of new tariffs or sanctions or a pullback on Phase 1 which of course didn't happen,\" said John Doyle, vice president of dealing and trading at Tempus Inc in Washington. The euro was 0.13% higher at $1.1091, its fourth straight day of gains. The euro's rally this week has pushed it over its 200-day moving average for the first time since late March and lifted it about 1.7% for the week, its best weekly gain in nine weeks."}, "News 3": {"title": "EUR/USD Mid-Session Technical Analysis for May 29, 2020", "keywords": ["2020", "main", "chart", "11147", "euro", "11066", "uptrend", "analysis", "midsession", "eurusd", "technical", "swing", "retracement", "29", "zone"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/eur-usd-mid-session-technical-183351308.html", "summary": "At 18:17 GMT, the EUR/USD is trading at 1.1093, up 0.0014 or -0.12%.\nDaily EUR/USD MoreDaily Swing Chart Technical AnalysisThe main trend is up according to the daily swing chart.\nThe EUR/USD is currently testing its retracement zone at 1.1066 to 1.1167.\nIts retracement zone at 1.0987 to 1.0937 is the nearest support zone.\nThis is a potential trigger point for an acceleration to the downside with the short-term retracement zone at 1.0987 to 1.0937 the next likely downside target zone.", "text": "The Euro is trading higher at the mid-session on Friday as traders await a key press conference from President on China in a move that could have a dramatic effect on investor sentiment. On Friday, the greenback extended its slide against the surging Euro, hurt by month-end flows and as the common currency continued to enjoy a boost from the European Union’s recently announced plan to prop up the bloc’s coronavirus-hit economies with a 750 billion-Euro ($828 billion) recovery fund. At 18:17 GMT, the EUR/USD is trading at 1.1093, up 0.0014 or -0.12%. This is down from an intraday high of $1.1145. An early session gain by the Euro was driven by optimism generated by the European Commission’s stimulus plan announced earlier this week, as well as investors’ improved appetite for risk-taking as global economies gradually move to reopen after coronavirus-linked shutdowns, analysts said."}, "News 4": {"title": "FOREX-Dollar weak vs. euro; Trump news conference on China on tap", "keywords": ["european", "currency", "euro", "steady", "weak", "dollar", "vs", "tap", "conference", "market", "trump", "talks", "china", "forexdollar", "strategist", "week"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/forex-dollar-weak-vs-euro-153057112.html", "summary": "The euro was 0.32% higher at $1.1112, on pace for its fourth straight day of gains.\n\"The 3%-plus jump in equities this month suggests a medium-sized USD sell program into month-end,\" said Innes.\nIf he was serious with trade tariffs, that would have a meaningful impact\", said Moh Siong Sim, a currency strategist at Bank of Singapore.\nThe pound was about flat against the euro and the dollar ahead of a new round of Brexit talks next week.\n(Reporting by Saqib Iqbal Ahmed; additional reporting by Julien Ponthus and Tom Westbroolk; editing by Jonathan Oatis)", "text": "* Trump plans China news conference for Friday  * Sterling steady vs. Euro ahead of Brexit talks next week (New throughout, updates prices, market activity, comments to U.S. market open; previous LONDON)  By Saqib Iqbal Ahmed  NEW YORK, May 29 (Reuters) - The dollar extended its slide against a surging euro on Friday, hurt by month-end flows and as the common currency continued to enjoy a boost from the European Union's recently announced plan to prop up the bloc's coronavirus-hit economies with a 750 billion-euro ($828 billion) recovery fund. The dollar, a safe-haven currency, found some support as traders awaited U.S. President Donald Trump's response to China's tightening control over Hong Kong, which could worsen tensions between the two powers over the financial hub. The euro was 0.32% higher at $1.1112, on pace for its fourth straight day of gains. The euro's rally this week has pushed it over its 200-day moving average for the first time since late March and lifted it about 2% for the week, its best weekly gain in nine weeks. Much of the euro's move was driven by optimism generated by the European Commission's stimulus plan announced earlier this week, as well as investors' improved appetite for risk-taking as global economies gradually move to reopen after coronavirus-linked shutdowns, analysts said."}, "News 5": {"title": "EUR/USD Weekly Price Forecast – The Euro Explodes to The Upside", "keywords": ["right", "euro", "price", "forecast", "weekly", "volatility", "economic", "market", "lot", "pair", "eurusd", "upside", "explodes", "quite", "stronger", "think"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/eur-usd-weekly-price-forecast-152654712.html", "summary": "The Euro market rallied against the US dollar on the majority of the week, reaching towards the 1.1150 level before pulling back a bit early on Friday.\nQuite frankly, we are facing a significant amount of resistance just above and this is a completely messy chart at the moment.\nEUR/USD Video 01.06.20A lot of what we are seeing is a reaction “unified bonds” that the European Union is selling.\nWith that, it should lead to a stronger currency, but at the end of the day the economic figures do not pan out for a stronger Euro.\nBeyond that, it is important to think of this as an indicator, showing you Euro strength or weakness in general.", "text": "The Euro market rallied against the US dollar on the majority of the week, reaching towards the 1.1150 level before pulling back a bit early on Friday. Quite frankly, we are facing a significant amount of resistance just above and this is a completely messy chart at the moment. Yes, it is an extraordinarily strong and bullish candlestick that we have seen this recently, where the Euro exploded straight up in the air and then got slammed right back down. EUR/USD Video 01.06.20  A lot of what we are seeing is a reaction “unified bonds” that the European Union is selling. In other words, Germany is backstopping Greece."}, "News 6": {"title": "EUR/USD Price Forecast – Euro Continues to Press Higher", "keywords": ["press", "currency", "seen", "euro", "short", "obviously", "price", "forecast", "continues", "dollar", "mind", "lot", "eurusd", "bit", "quite", "higher"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/eur-usd-price-forecast-euro-133703362.html", "summary": "The Euro exploded to the upside it over the last 48 hours, as the market has reached towards the 1.1150 level.\nThis should be stronger, and therefore people like the idea of the future of the Euro much more than they did just a few weeks ago.\nEUR/USD Video 01.06.20It is a remarkable move, but when you look at the last couple of months, we have seen massive moves in one direction or another.\nWith that in mind I am a bit skeptical, and quite frankly will trade the Euro against other currencies.\nFor a look at all of today’s economic events, check out our economic calendar.", "text": "The Euro exploded to the upside it over the last 48 hours, as the market has reached towards the 1.1150 level. This is an area where we have seen selling previously, but a lot of this is due to the European Union offering bonds that are backed by the entirety of the EU instead of the single countries. This should be stronger, and therefore people like the idea of the future of the Euro much more than they did just a few weeks ago. EUR/USD Video 01.06.20  It is a remarkable move, but when you look at the last couple of months, we have seen massive moves in one direction or another. In other words, even though it is obviously bullish over the last several days, it is still difficult to get long of the Euro at this point, because we have seen this movie before, and have seen it recently."}, "News 7": {"title": "Spain approves 462 euro monthly minimum income for the poorest", "keywords": ["approved", "monthly", "approves", "worth", "told", "income", "euro", "month", "spain", "euros", "million", "minimum", "iglesias", "poorest", "25", "462"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/spain-approves-462-euro-monthly-110610838.html", "summary": "MADRID, May 29 (Reuters) - The Spanish government approved on Friday the creation of a minimum income worth 462 euros ($514) a month for the poorest, Deputy Prime Minister Pablo Iglesias told a news conference, in a scheme that targets some 2.5 million people.\nUnder the decree approved at a cabinet meeting, the government would pay the monthly stipend and top up existing revenue for people earning less so that they get at least that minimum amount every month, Iglesias told reporters.\nThe minimum income would increase with the number of family members to a total of up to 1,015 euros per month.\nThe new programme aims to reach 850,000 households or 2.5 million people and would cost the government about 3 billion euros a year.\n($1 = 0.8981 euros) (Reporting by Inti Landauro, Emma Pinedo and Belen Carreño, editing by Andrei Khalip)", "text": "MADRID, May 29 (Reuters) - The Spanish government approved on Friday the creation of a minimum income worth 462 euros ($514) a month for the poorest, Deputy Prime Minister Pablo Iglesias told a news conference, in a scheme that targets some 2.5 million people. Under the decree approved at a cabinet meeting, the government would pay the monthly stipend and top up existing revenue for people earning less so that they get at least that minimum amount every month, Iglesias told reporters. The minimum income would increase with the number of family members to a total of up to 1,015 euros per month. The new programme aims to reach 850,000 households or 2.5 million people and would cost the government about 3 billion euros a year. ($1 = 0.8981 euros) (Reporting by Inti Landauro, Emma Pinedo and Belen Carreño, editing by Andrei Khalip)"}, "no_of_news": 7, "plot_name": "/content/fx_plots/EURUSD=X.png"}, "JPY=X": {"currency_pair": "USD/JPY", "News 1": {"title": "USD/JPY Forex Technical Analysis – May Be Ripe for Upside Breakout Following 15 Days of Rangebound Trading", "keywords": ["trading", "main", "usdjpy", "days", "following", "potential", "chart", "forex", "economic", "breakout", "rangebound", "trump", "technical", "level", "upside", "trade", "ripe"], "publish_date": "2020-05-31", "url": "https://finance.yahoo.com/news/usd-jpy-forex-technical-analysis-222634762.html", "summary": "The Dollar/Yen reversed to the upside on Friday after President Trump’s comments about China fueled a late session surge in demand for higher risk assets.\nDaily USD/JPY MoreDaily Swing Chart Technical AnalysisThe main trend is up according to the daily swing chart, however, momentum has been drifting sideways since the 108.088 top on May 19.\nThe USD/JPY has been trading inside its retracement zone at 106.706 to 108.008 since May 11 or 15 trading sessions.\nFriday’s high at 107.897 is the first potential breakout level, the Fibonacci level at 108.008 is the second potential breakout level, but I think the main top at 108.088 is the potential trigger point for an acceleration to the upside.\nFor a look at all of today’s economic events, check out our economic calendar.", "text": "The Dollar/Yen reversed to the upside on Friday after President Trump’s comments about China fueled a late session surge in demand for higher risk assets. The Japanese Yen was underpinned throughout the session on Friday as traders waited for U.S. President Trump’s response to China’s moves to tighten control over Hong Kong. Cautious traders were taking protection in the Yen because they feared Trump would walk away from Phase One of the trade deal between the two economic powerhouses, which would worsen tensions over the financial hub. On Friday, the USD/JPY settled at 107.793, up 0.175 or +0.16%. The USD/JPY posted a rapid turnaround late Friday after Trump did not indicate the U.S. would pull out of the phase one trade agreement reached with China earlier this year, easing trader concerns for the time being."}, "News 2": {"title": "USD/JPY Weekly Price Forecast – US Dollar Stock in Tight Range Against Japanese Yen", "keywords": ["usdjpy", "looks", "japanese", "point", "price", "weekly", "forecast", "dollar", "probably", "stock", "market", "type", "ultimately", "impulsive", "level", "right", "range", "yen", "think", "tight"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/usd-jpy-weekly-price-forecast-154431718.html", "summary": "The US dollar went back and forth during the course of the week, hanging around the ¥107 level yet again.\nUltimately, I think that longer-term traders will probably continue to avoid this market, and quite frankly I think they probably should.\nUSD/JPY Video 01.06.20When we do make that impulsive candlestick, then you can follow the market for a couple of hundred tics.\nUltimately though, the market looks highly likely to see some type of decision eventually.\nAt this point, this is a market that is probably easier to trade on short-term charts, as an investment would be a bit difficult.", "text": "The US dollar went back and forth during the course of the week, hanging around the ¥107 level yet again. This seems to be a bit of a magnet for price, as it is in the middle of the larger consolidation area between the ¥105 level on the bottom and the ¥109 level on the top. At this point, it looks as if the market is trying to pick the next direction, so you are better off simply waiting on some type of impulsive candlestick to get involved. Ultimately, I think that longer-term traders will probably continue to avoid this market, and quite frankly I think they probably should. USD/JPY Video 01.06.20  When we do make that impulsive candlestick, then you can follow the market for a couple of hundred tics."}, "News 3": {"title": "GBP/JPY Weekly Price Forecast – British Pound Resilient Against Yen", "keywords": ["resilient", "point", "price", "weekly", "forecast", "level", "pound", "british", "lot", "market", "type", "going", "gbpjpy", "quite", "yen", "waiting", "think"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/gbp-jpy-weekly-price-forecast-153249765.html", "summary": "The British pound rallied during the week, breaking above the ¥132 level in a sign of strength.\nHowever, there is a lot of noise between here and the ¥135 level, so I think it is only a matter of time before we see some type of pushback.\nKeep in mind that the market has faced a lot of support underneath in order to bounce yet again.\nAt this point, I believe that simply waiting to see where the risk in the world is will tell you what this pair should do.\nA break above the ¥135 level could get this market moving to the upside quite quickly though.", "text": "The British pound rallied during the week, breaking above the ¥132 level in a sign of strength. However, there is a lot of noise between here and the ¥135 level, so I think it is only a matter of time before we see some type of pushback. Keep in mind that the market has faced a lot of support underneath in order to bounce yet again. However, the most recent bounce before the one we are in now is lower, so that does suggest that perhaps there is still a lot of shorting going on out there. GBP/JPY Video 01.06.20  The market has been rather tight as of late, so at this point I think we are waiting for a large impulsive candlestick in order to take some type of trade on."}, "News 4": {"title": "USD/JPY Price Forecast – US Dollar Pulls Back Toward Support Against Yen", "keywords": ["usdjpy", "support", "point", "huge", "price", "forecast", "dollar", "pulls", "pips", "influence", "possibility", "market", "ema", "level", "opens", "yen", "think"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/usd-jpy-price-forecast-us-134918113.html", "summary": "The US dollar has broken down significantly against the Japanese yen on Friday, dropping about 80 pips by the time New York started.\nWhile that is not a huge move, it is relatively big for the last couple of weeks.\nUSD/JPY Video 01.06.20To the upside, the 50 day EMA continues to hang above the ¥107.75.\nA break above there opens up the possibility of a move towards the 200 day EMA, which at this point I think that the sellers would be an influence as well.\nI do not have clarity at this point, so it is short-term back-and-forth, probably in increments of 20 or even 30 pips.", "text": "The US dollar has broken down significantly against the Japanese yen on Friday, dropping about 80 pips by the time New York started. While that is not a huge move, it is relatively big for the last couple of weeks. The market stopped just above the ¥107 level and hung about there, so I think at this point it is likely that the area could bring some buyers in this vicinity, but if we were to break down below the ¥107 level, it opens up the possibility of a move down to the ¥106 level where we had seen a bit of a bounce. USD/JPY Video 01.06.20  To the upside, the 50 day EMA continues to hang above the ¥107.75. A break above there opens up the possibility of a move towards the 200 day EMA, which at this point I think that the sellers would be an influence as well."}, "News 5": {"title": "GBP/JPY Price Forecast – British Pound Continues Consolidation Against Yen", "keywords": ["trading", "day", "price", "forecast", "continues", "ema", "economic", "pound", "british", "market", "lot", "come", "general", "gbpjpy", "risk", "yen", "consolidation", "think"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/gbp-jpy-price-forecast-british-132927275.html", "summary": "The British pound has initially pulled back during the trading session on Friday but has seen buying come in and push the market towards the top of the short-term range again.\nAt this point though, the market still sees a lot of noise in general, so I do think that we are likely to see choppy trading back and forth.\nThe 50 day EMA is sitting just above, and therefore it should be paid attention to.\nThe 50 day EMA of course is an area that should cause some kind of barrier, so breaking above there will attract a lot of momentum traders.\nFor a look at all of today’s economic events, check out our economic calendar.", "text": "The British pound has initially pulled back during the trading session on Friday but has seen buying come in and push the market towards the top of the short-term range again. At this point though, the market still sees a lot of noise in general, so I do think that we are likely to see choppy trading back and forth. The 50 day EMA is sitting just above, and therefore it should be paid attention to. If the market were to break above there, the likelihood of a move towards ¥135 increases drastically. On the other hand, if the market were to break down below the ¥132 level again, one would have to think that the overall trend would come back into play, suggesting that we are going to go lower."}, "News 6": {"title": "Brent Oil and Gold With Interesting Setups", "keywords": ["resistance", "setups", "brent", "todays", "recent", "signal", "price", "pattern", "oil", "sellers", "gold", "trend", "interesting"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/brent-oil-gold-interesting-setups-101402256.html", "summary": "In today’s analysis, we will focus on commodities: Gold and Oil.\nIn the previous months, Gold was climbing has been mostly moving higher and oil has been declining.\nIn both cases, gold has a nice bullish signal and oil is drawing rather bearish pattern.\nFirst, lest start with Brent Oil, where its price has doubled since the end of April.\nThe second instrument is Gold, where the price is currently breaking the upper line of the flag formation.", "text": "In today’s analysis, we will focus on commodities: Gold and Oil. In the previous months, Gold was climbing has been mostly moving higher and oil has been declining. Despite the most recent rise in the price of Brent and a small decline in the price of gold, we think that we are about to see a comeback to the dominant trend. In both cases, gold has a nice bullish signal and oil is drawing rather bearish pattern. First, lest start with Brent Oil, where its price has doubled since the end of April."}, "News 7": {"title": "FOREX-Euro and yen gain before Trump's press conference on China", "keywords": ["second", "press", "trumps", "currency", "forexeuro", "euro", "dollar", "weekly", "conference", "yuan", "trump", "traded", "china", "yen", "trade", "gain"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/forex-euro-yen-gain-trumps-084125188.html", "summary": "The yen rose against major currencies as investors looked for safe havens before Trump's response to China's passing of a national security law for Hong Kong.\nOffshore, the yuan was little changed and traded at 7.1661 per dollar, not far from the nine-month low of 7.1965 yuan per dollar reached on Wednesday.\nThe common currency was headed for its second weekly gain after the 750 billion-euro coronavirus recovery fund fuelled optimism about the euro zone economy.\nSterling was stable against the dollar, down 0.04% at $1.2312 but still on course for its second weekly gain.\nThe New Zealand dollar traded at $0.6208, near its strongest since early March.", "text": "* Graphic: World FX rates in 2020 https://tmsnrt.rs/2RBWI5E  * Trump plans China news conference for Friday  * Euro set for second weeks of gains  By Julien Ponthus  LONDON, May 29 (Reuters) - The euro extended its gains on Friday to a two-month high as traders waited for U.S. President Donald Trump's response to China's tightening control over Hong Kong, which could further worsen tensions between the two over the financial hub. The yen rose against major currencies as investors looked for safe havens before Trump's response to China's passing of a national security law for Hong Kong. \"I think the market is still fearful that it might escalate into something more serious. If he was serious with trade tariffs, that would have a meaningful impact\", said Moh Siong Sim, a currency strategist at Bank of Singapore. \"You can never quite predict Trump."}, "no_of_news": 7, "plot_name": "/content/fx_plots/JPY=X.png"}, "GBPUSD=X": {"currency_pair": "GBP/USD", "News 1": {"title": "The Week Ahead – Stats, Geopolitics, and Central Banks to Test the Markets", "keywords": ["stats", "numbers", "half", "markets", "ahead", "figures", "test", "busy", "central", "economic", "banks", "focus", "sector", "geopolitics", "week"], "publish_date": "2020-05-31", "url": "https://finance.yahoo.com/news/week-ahead-stats-geopolitics-central-020311888.html", "summary": "On the MacroIt’s a busy week ahead on the economic calendar, with 60 stats in focus in the week ending 5th June.\nFor the Dollar:While it’s another busy week ahead on the economic data front.\nFor the EUR:It’s yet another busy week ahead on the economic data front.\nFor the Loonie:It’s a relatively busy week ahead on the economic calendar.\nOut of AsiaFor the Aussie Dollar:It’s a busy week ahead for the Aussie Dollar.", "text": "On the Macro  It’s a busy week ahead on the economic calendar, with 60 stats in focus in the week ending 5th June. In the week prior, 58 stats had also been in focus. For the Dollar:  While it’s another busy week ahead on the economic data front. Some data will garner more attention than others, however. In the first half of the week, we have May’s ISM Manufacturing and Non-Manufacturing PMIs."}, "News 2": {"title": "GBP/USD Weekly Price Forecast – British Pound Has Strong Week", "keywords": ["resistance", "price", "weekly", "forecast", "ema", "pound", "british", "lot", "continue", "strong", "start", "gbpusd", "level", "market", "week", "think"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/gbp-usd-weekly-price-forecast-154411223.html", "summary": "The British pound has rallied significantly during the week, reaching towards the 1.2350 level.\nThis is an area that shows up a lot on shorter-term charts, as both support and resistance.\nGBP/USD Video 01.06.20If we were to break above the 50 week EMA, which is just above there, then the British pound could very well go to the 1.30 level.\nUltimately, this is a market that I think has to deal with the Brexit headlines next week, as negotiations start back up.\nIf we break above and close above the 50 week EMA on the daily chart, then it is time to start buying.", "text": "The British pound has rallied significantly during the week, reaching towards the 1.2350 level. This is an area that shows up a lot on shorter-term charts, as both support and resistance. If we can continue to grind higher from here, and we very well could, then the 1.25 level becomes in focus. That area I think would continue to cause significant resistance, so pay attention to that level if we get there, as it will certainly be a major fight. GBP/USD Video 01.06.20  If we were to break above the 50 week EMA, which is just above there, then the British pound could very well go to the 1.30 level."}, "News 3": {"title": "GBP/USD Price Forecast – British Pound Tests 50 Day EMA", "keywords": ["day", "pull", "price", "forecast", "level", "ema", "50", "pound", "british", "continue", "noisy", "market", "tests", "gbpusd", "going", "economic", "bit", "think"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/gbp-usd-price-forecast-british-133255613.html", "summary": "The British pound initially pulled back a bit during the trading session on Friday before turning around and smashing into the 50 day EMA.\nAs we got there, the market did pull back a bit, and it should be noted that we continue to see a lot of noisy behavior overall.\nIf that is going to continue to be the case, then I think it is only a matter of time before we see massive selling pressure.\nHowever, if we break above the 50 day EMA, then it is likely that we will then go looking towards the 1.25 level.\nGBP/USD Video 01.06.20The market will continue to be very noisy, as we have a whole plethora of problems in the UK that will continue to weigh upon Sterling.", "text": "The British pound initially pulled back a bit during the trading session on Friday before turning around and smashing into the 50 day EMA. As we got there, the market did pull back a bit, and it should be noted that we continue to see a lot of noisy behavior overall. If that is going to continue to be the case, then I think it is only a matter of time before we see massive selling pressure. However, if we break above the 50 day EMA, then it is likely that we will then go looking towards the 1.25 level. At that point, I would anticipate seeing even more resistance."}, "News 4": {"title": "GBP/USD Remains Well-Supported on a Broadly Weaker Dollar", "keywords": ["yesterday", "4hour", "support", "ahead", "events", "remains", "wellsupported", "dollar", "weaker", "broadly", "gbpusd", "level", "risk", "session", "chart"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/gbp-usd-remains-well-supported-102240446.html", "summary": "The session ahead is expected to be a volatile one.\nIn addition to the scheduled risk events, trade adjustments are typically made at month-end which stands to further impact the markets today.\nTechnical AnalysisGBPUSD 4-Hour Chart MoreGBP/USD has been underpinned by a weaker dollar as the US dollar index (DXY) has fallen to lows not seen around the middle of March in early trading today.\nSo far, sellers have stepped in near 1.2350 with the 200 moving average on a 4-hour chart near there to create an obstacle for bulls.\nThe session ahead is expected to be volatile with several risk events and potential month-end trade adjustments that stand to move the markets.", "text": "A strong appetite for risk has weighed on the dollar and all of the major currencies have gained against the greenback this week as a result. The British pound, however, has gained less than most of its counterparts as concerns over Brexit and further monetary policy easing in the UK has weighed. The session ahead is expected to be a volatile one. Here are some of the scheduled risk events:  US President Trump will hold a press conference regarding China. The announcement was made late yesterday which has triggered some risk aversion  Fed Chair Powell will speak later today."}, "News 5": {"title": "GBP/USD Daily Forecast – Test Of Key Resistance At 1.2350", "keywords": ["significant", "resistance", "support", "dollar", "forecast", "test", "upcoming", "daily", "gbpusd", "level", "china", "12250", "key", "12350"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/gbp-usd-daily-forecast-test-065202338.html", "summary": "Technical AnalysisThe recent sell-off, caused by fears about upcoming Brexit problems, proved to be temporary, and GBP/USD quickly returned above 1.2250 and headed towards the test of the nearest resistance level at 1.2350.\nThis level has already been tested several times, and each time GBP/USD met significant resistance.\nIn case GBP/USD manages to settle above 1.2350, it will gain additional upside momentum and head towards the next resistance level at 1.2450.\nOn the support side, the nearest support for GBP/USD is located at the 20 EMA at 1.2280, followed by the major support level at 1.2250.\nMost likely, the whole area between 1.2250 and 1.2280 will serve as one significant support level for GPB/USD.", "text": "GBP/USD Video 29.05.20. Increasing U.S. – China Tensions Do Not Help The U.S. Dollar  GBP/USD is testing the resistance level at 1.2350 as the U.S. dollar remains under pressure against a broad basket of currencies despite the increase in U.S. – China tensions. U.S. President Donald Trump is set to hold a press conference on China on Friday. The key intrigue is whether U.S. will choose some mild sanctions like travel bans for certain Chinese officials or impose new tariffs on China. Interestingly, the deterioration of U.S. – China relations and the prospect of a new phase of the trade war between the two biggest economies do not help the U.S. dollar which has served as a safe haven asset of last resort during the coronavirus crisis."}, "News 6": {"title": "Economic Data to Take a Back Seat with Trump’s News Conference the Main Event", "keywords": ["main", "numbers", "day", "trumps", "measures", "number", "economic", "seat", "conference", "event", "cases", "writing", "prices", "lockdown", "figures", "data"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/economic-data-back-seat-trump-033848413.html", "summary": "Away from the economic calendar, the markets responded to Trump’s announcement on Thursday of plans to unveil measures against China at the news conference later today.\nFiscal stimulus from Brussels and the easing of lockdown measures across the EU and the U.S had provided support to riskier assets ahead of today’s open.\nThe EU’s recovery plan and the continued easing of lockdown measures remain positives.\nIf an upward trend begins, this could question member state plans to ease lockdown measures further.\nEconomic data includes April inflation and personal spending figures and May consumer sentiment and Chicago PMI numbers.", "text": "Earlier in the Day:  It was a relatively busy day on the economic calendar this morning. The Japanese Yen and Aussie Dollar were in action early in the day. Away from the economic calendar, the markets responded to Trump’s announcement on Thursday of plans to unveil measures against China at the news conference later today. Fiscal stimulus from Brussels and the easing of lockdown measures across the EU and the U.S had provided support to riskier assets ahead of today’s open. Looking at the latest coronavirus numbers,  On Thursday, the number of new coronavirus cases rose by 112,124 to 5,900,627."}, "News 7": {"title": "Dollar Drifts Lower in Tight Trading Ranges", "keywords": ["trading", "research", "hong", "trumps", "drifts", "dollar", "uschina", "et", "lower", "global", "recovery", "economy", "ranges", "continued", "tight"], "publish_date": "2020-05-29", "url": "https://finance.yahoo.com/news/dollar-drifts-lower-tight-trading-025804643.html", "summary": "By Peter NurseInvesting.com - The dollar edged lower in early European trade Friday, but trading ranges have been tight as traders attempt to weigh up the conflicting forces of a continued economic recovery with heightened tensions over China’s move to tighten control over Hong Kong.\nThis is another horrendous figure, but the weekly totals have continued to fall since hitting a peak of 6.8 million in late March.\n\"When that happens, there will be more risk-off trades, which supports buying of both the dollar and the yen.\"\nAt 2:55 AM ET, USD/CNY traded at 7.1515, not far off the record of 7.1966 reached on Thursday.\nAt 02:55 AM ET, EUR/USD traded at $1.1098, up 0.2%, having earlier broken through the $1.11 level for the first time since late March.", "text": "By Peter Nurse  Investing.com - The dollar edged lower in early European trade Friday, but trading ranges have been tight as traders attempt to weigh up the conflicting forces of a continued economic recovery with heightened tensions over China’s move to tighten control over Hong Kong. At 2:55 AM ET (0655 GMT), the U.S. Dollar Index, which tracks the greenback against a basket of six other currencies, stood at 98.293, down 0.1%, while USD/JPY fell 0.4% to 107.18 and GBP/USD rose 0.2% at 1.2344. German retail sales fell at their fastest pace since 2007 in April, data showed on Friday, but the drop - at 5.3% on the month - was not as steep as expected in a sign of the relative resilience of Europe's largest economy during the coronavirus crisis. March's figures were also revised to reflect a gentler decline. While in the U.S., Thursday’s initial jobless claims data showed that more than two million Americans filed for unemployment benefits for the first time last week."}, "no_of_news": 7, "plot_name": "/content/fx_plots/GBPUSD=X.png"}}, "INDICES": {"^DJI": {"Index Name": "Dow Jones Industrial Average", "News 1": {"title": "Dow Jones Futures: Tesla Leads 5 Stocks Looking To Break Out Decisively In Coronavirus Market Rally", "keywords": ["futures", "rally", "leads", "dow", "decisively", "buy", "stock", "market", "jones", "coronavirus", "looking", "week", "tesla", "stocks"], "publish_date": "2020-06-01", "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-coronavirus-stock-market-rally-tesla-microsoft-apple/?src=A00220&yptr=yahoo", "summary": "Join IBD experts as they analyze actionable stocks in the coronavirus stock market rally on IBD Live.\nDow Jones Futures TodayDow Jones futures rose 0.4% vs. fair value, erasing solid losses.\nWhile Dow Jones futures haven't been as volatile as during the market crash, they are still prone to big moves during the coronavirus stock market rally.\nCoronavirus Stock Market RallyThe coronavirus stock market rally had some big swings, with growth stocks plunging from a Tuesday peak to Wednesday morning, then rebounding strongly.\nGame Plan The Stock Market RallyDuring last week's volatile action in the coronavirus stock market rally, there was a strong argument for buying, selling or holding.", "text": "Dow Jones futures turned slightly higher Sunday night, along with S&P 500 futures and Nasdaq futures, following a weekend of unrest in cities in across the country. The coronavirus stock market rally had some wild intraday swings last week, but ultimately finished with solid gains. The Dow Jones and S&P 500 index led, but the Nasdaq reasserted leadership on Friday. The wild action showed the importance of having a market rally game plan ahead of time. X  Meanwhile, Tesla (TSLA), Microsoft (MSFT), UnitedHealth (UNH) as well as Apple (AAPL) and Domino's Pizza (DPZ), are all in the \"friend zone.\""}, "News 2": {"title": "The stock market now has another risk ‘bubbling up,’ strategist warns", "keywords": ["shue", "recent", "seen", "warns", "number", "tensions", "stock", "market", "priced", "strategist", "investors", "bubbling", "right", "risk", "think"], "publish_date": "2020-05-31", "url": "https://www.marketwatch.com/story/the-stock-market-now-has-another-risk-bubbling-up-strategist-warns-2020-05-31?siteid=yhoof2&yptr=yahoo", "summary": "Meghan Shue, investment strategist as Wilmington Trust, says that while the coronavirus is still the biggest risk facing the stock market, another freshening headwind could hobble the recent rally.\nWe’ve seen them bubbling up in recent days and weeks...\n“There’s not much room on the political stage for anyone that is seen as going soft on China,” she said.\n“The market is priced pretty much to perfection right now.\nStocks looks to be pulling back a bit to start the week, with futures on the Dow Jones Industrial Average DJIA, -0.06% pointing to a lower open.", "text": "As if the pandemic isn’t enough. Meghan Shue, investment strategist as Wilmington Trust, says that while the coronavirus is still the biggest risk facing the stock market, another freshening headwind could hobble the recent rally. “ ‘We are definitely worried about U.S.-China tensions escalating. We’ve seen them bubbling up in recent days and weeks... There are a number of risks that I don’t think are adequately priced into the market that could see a resurgence.” ”  That’s Shue waving a warning flag for investors in an interview Friday on CNBC, in which she was referring to President Trump’s tough talk regarding China."}, "News 3": {"title": "Dow futures fall Sunday evening after weekend of violent protests amid coronavirus pandemic", "keywords": ["futures", "weekend", "violent", "fall", "dow", "amid", "pandemic", "coronavirus", "protests", "evening"], "publish_date": "2020-05-31", "url": "https://www.marketwatch.com/story/dow-futures-fall-more-than-200-points-sunday-evening-after-weekend-of-violent-protests-amid-coronavirus-pandemic-2020-05-31?siteid=yhoof2&yptr=yahoo", "summary": "", "text": ""}, "News 4": {"title": "Stock market news live updates: Stock futures fall as nation grapples with protests", "keywords": ["updates", "nation", "futures", "live", "grapples", "fall", "cities", "points", "including", "minneapolis", "ceo", "stock", "market", "stores", "protests", "week"], "publish_date": "2020-05-31", "url": "https://finance.yahoo.com/news/stock-market-news-live-june-1-2020-222325796.html", "summary": "Stock futures opened lower Sunday evening, dropping against a backdrop of protracted protests in some of the nation’s largest cities, many of which had already been struggling to reopen amid the coronavirus outbreak.\nDemonstrations since erupted in dozens of cities across the nation, accompanied by looting and destruction of some retail stores and other large and small businesses.\nTarget (TGT) which is headquartered in Minneapolis and has 73 stores in Minnesota, closed or adjusted hours at 200 stores this weekend.\nET Sunday: Stock futures open lowerHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:04 p.m.\nFind live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay", "text": "Stock futures opened lower Sunday evening, dropping against a backdrop of protracted protests in some of the nation’s largest cities, many of which had already been struggling to reopen amid the coronavirus outbreak. The protests centered on constituents’ outrage over the death of George Floyd, who was killed by police in Minneapolis last week in one of the latest public instances of police brutality against an unarmed black man. Demonstrations since erupted in dozens of cities across the nation, accompanied by looting and destruction of some retail stores and other large and small businesses. The escalation of these protests led governors in two dozen states including Minnesota, California, Illinois and Washington to activate the National Guard, along with mayors in some cities to impose curfews. A number of major companies temporarily changed operations as they assessed the violence that ensued in recent days."}, "News 5": {"title": "The stock market isn’t reflecting reality... yet, warns Citigroup", "keywords": ["thats", "reflecting", "warns", "way", "stock", "market", "tap", "reality", "times", "citigroup", "isnt", "start", "telling", "tougher", "falco", "think"], "publish_date": "2020-05-31", "url": "https://www.marketwatch.com/story/the-stock-market-isnt-reflecting-reality-yet-warns-citi-investment-banker-2020-05-31?siteid=yhoof2&yptr=yahoo", "summary": "“ ‘We definitely feel that the markets are way ahead of reality.\nWe really are telling every client to tap the market if they can because we think the pricing now couldn’t get any better.’ ”That’s Manolo Falco, Citigroup’s C, -2.54% co-head of investment banking, explaining to the Financial Times why he believes the firm’s corporate clients should raise as much cash as possible before the reality of the pandemic sinks in for investors.\n“As the second quarter comes along and we start seeing the pain, and the collateral effects of that,” Falco continued, “we think this is going to be much tougher than it looks.”", "text": "“ ‘We definitely feel that the markets are way ahead of reality. We really are telling every client to tap the market if they can because we think the pricing now couldn’t get any better.’ ”  That’s Manolo Falco, Citigroup’s C, -2.54% co-head of investment banking, explaining to the Financial Times why he believes the firm’s corporate clients should raise as much cash as possible before the reality of the pandemic sinks in for investors. “As the second quarter comes along and we start seeing the pain, and the collateral effects of that,” Falco continued, “we think this is going to be much tougher than it looks.”"}, "News 6": {"title": "Over 40 million people filed for unemployment since March — $1,200 stimulus checks are a mere Band-Aid for Americans", "keywords": ["americans", "checks", "monthly", "mere", "40", "income", "stimulus", "1200", "work", "million", "need", "unemployment", "filed", "workers", "security", "money", "bandaid"], "publish_date": "2020-05-19", "url": "https://www.marketwatch.com/story/heres-how-much-trouble-laid-off-americans-are-in-and-why-1200-stimulus-checks-are-only-a-band-aid-2020-05-19?siteid=yhoof2&yptr=yahoo", "summary": "Nearly 160 million stimulus checks are already winding their way to millions of Americans.\nFamilies in McAllen, Texas, will benefit the most, with the stimulus checks covering 96% of their $3,500 monthly bills.\n“Social Security beneficiaries who need money today are twice as likely to withdraw from their retirement accounts as those who do not claim Social Security,” the researchers wrote.\nAnd in some cases, people have even thrown away the debit cards containing their long-awaited stimulus money — before they realized their mistake.\nSome 2 million Americans applied for unemployment benefits in the last recorded week, but the real number was almost 1 million higher including a new federal relief program; nearly 40 million people have applied for benefits through their states since mid-March, when the shutdowns began.", "text": "Nearly 160 million stimulus checks are already winding their way to millions of Americans. They’re a key part of the government’s $2.2 trillion CARES Act, but furloughed and laid-off workers say a maximum $1,200 payment is not nearly enough to see them through what could be an even bigger economic crisis than the Great Recession. LendingTree TREE, -1.99% analyzed income data in the 98 cities with the highest number of families per capita to determine their monthly expenses and estimate how much of a household’s monthly expenses $3,400 in economic impact payments would cover. That’s two $1,200 stimulus checks, plus $500 each for two dependents. “ There’s growing concern among many Americans that businesses won’t restart in time to save them from paying the rent, their mortgage and going hungry."}, "no_of_news": 6, "plot_name": "/content/indices_plots/^DJI.png"}, "^BSESN": {"Index Name": "S&P BSE SENSEX", "News 1": {"title": "Hong Kong shares drop amid tensions with China", "keywords": ["hong", "drop", "kong", "trading", "early", "markets", "sp", "tensions", "amid", "chinese", "shares", "china", "coronavirus", "financial", "index"], "publish_date": "2020-05-28", "url": "https://www.marketwatch.com/story/hong-kong-shares-drop-amid-tensions-with-china-2020-05-28?siteid=yhoof2&yptr=yahoo", "summary": "Shares rose in Tokyo and Sydney, but fell in China and Hong Kong, where tensions are flaring over Beijing’s effort to exert more control over the former British colony.\nHong Kong pro-democracy activists are urging the international community to pressure Beijing to withdraw proposed national security legislation that could further reduce the semi-autonomous Chinese territory’s civil liberties.\nOn Wednesday, U.S. Secretary of State Mike Pompeo told Congress the Trump administration no longer regards Hong Kong as autonomous from mainland China.\nThat sets the stage for the U.S. to withdraw the preferential trade and financial status Hong Kong has held since it reverted to Chinese rule 23 years ago.\nHong Kong’s Hang Seng index HSI, +3.22% lost 1.8%, while the Shanghai Composite index SHCOMP, +1.96% declined 0.4%.", "text": "BANGKOK (AP) — Asian stocks were mixed after an upbeat open on Thursday, as investors pinned their hopes on an economic rebound from the coronavirus crisis. Shares rose in Tokyo and Sydney, but fell in China and Hong Kong, where tensions are flaring over Beijing’s effort to exert more control over the former British colony. The most recent developments are another thorn in a relationship already testy over China’s handling of the early stages of the coronavirus outbreaks and over longstanding trade and other antagonisms. Two pro-democracy lawmakers were ejected from Hong Kong’s legislative chamber Thursday morning, at the start of a second day of debate on a contentious bill that would criminalize insulting or abusing the Chinese national anthem. Hong Kong pro-democracy activists are urging the international community to pressure Beijing to withdraw proposed national security legislation that could further reduce the semi-autonomous Chinese territory’s civil liberties."}, "News 2": {"title": "Prospect of $35 billion telecom deal shows M&A not entirely sidelined by coronavirus pandemic", "keywords": ["liberty", "virgin", "prospect", "ma", "shows", "cable", "deal", "entirely", "million", "telefónica", "telecom", "global", "mobile", "pandemic", "coronavirus", "uk", "sidelined", "billion"], "publish_date": "2020-05-04", "url": "https://www.marketwatch.com/story/liberty-global-and-telefonica-in-advanced-talks-to-create-28-billion-uk-telecoms-group-2020-05-04?siteid=yhoof2&yptr=yahoo", "summary": "Liberty Global declined to comment.\nIn midday Monday trades Liberty Global shares were up 0.4% while the Telefónica ADRs were off 2.8%.\nA deal with Liberty Global would help it significantly reduce the Spanish telecommunications giant’s heavy debt load, which stood at almost €37 billion at the end of 2019.\nLiberty Global bought Virgin Media, which offers pay-television, broadband and phone packages in the U.K., in a cash-and-stock deal worth $23.3 billion in 2013.\nIn the U.K., Virgin competes with Sky, which is owned by Comcast CMCSA, +0.12% , in pay TV, and with BT and Sky in broadband.", "text": "Spain’s Telefónica TEF, -2.23% said on Monday that it is in talks with U.S. tycoon John Malone’s cable group Liberty Global over a possible merger of their U.K. operations, in a deal that would create a new television and mobile company with a combined value of almost £28 billion, including debt and anticipated synergies. The Spanish telecom group said discussions to combine its O2 mobile business with Liberty Global’s LBTYA, +0.56% Virgin Media cable network were in “negotiation phase,” and it couldn't guarantee the precise terms of the deal or the probability of its success. However, people close to the situation said the talks were at an advanced stage and a deal could be announced as early as Thursday, when Telefónica is due to report its first-quarter earnings. If it’s pulled off, the deal would radically reshape the U.K telecommunications industry, creating a competitor to the country’s current top operator BT Group BT.A, -2.10% by combining the 34 million customers on O2’s mobile network with Virgin Media’s 3.3 million mobile customers and its 6 million broadband users. Analysts at New Street Research said a combination of O2 and Virgin Media could create a business worth £28 billion, including debt and synergies."}, "no_of_news": 2, "plot_name": "/content/indices_plots/^BSESN.png"}, "^GSPC": {"Index Name": "S&P 500", "News 1": {"title": "Stock Market Rebound Put to Test Again With Street Unrest Raging", "keywords": ["street", "rebound", "virus", "weekend", "states", "bloomberg", "won", "tchir", "test", "impact", "stock", "market", "economy", "unrest", "raging", "stocks"], "publish_date": "2020-06-01", "url": "https://finance.yahoo.com/news/stock-market-rebound-put-test-221818056.html", "summary": "“Given everything that happened over the weekend, that’s a pretty bullish open,” said Max Gokhman, Pacific Life’s head of asset allocation.\n“I’ve expressed concern that shuttering businesses could lead to social unrest, but the ongoing protesting has nothing to do with that,” Tchir wrote in a note Sunday.\n“As we saw in the 1960s, social unrest does not always have a negative impact.” However, it could easily have an impact on the election, he said.\nBiden had a wide, 65% to 32% lead in the states won by Democrat Hillary Clinton in 2016.\nFor more articles like this, please visit us at bloomberg.comSubscribe now to stay ahead with the most trusted business news source.", "text": "(Bloomberg) -- An equity market bounce that has weathered a pandemic, shut-down economies and tens of millions of lost jobs now must navigate spiraling civic unrest with the potential to exacerbate all of it. American stocks enter June more than two-thirds of the way back from a rout that erased $12 trillion from share values, thanks to a 36% rally since March that has defied every bearish prognostication. An astonishing display of resilience, the rally has pushed S&P 500 valuations to the highest in 20 years as it spread to industries like banks and airlines. Along with central bank support, prospects of a speedy reopening to the U.S. economy and the avoidance of a second virus wave fueled the comeback, by some measures the fastest of its kind ever recorded. Those hopes are being tested by violence in dozens of cities following the death of George Floyd, the black Minneapolis man killed by police last week."}, "News 2": {"title": "Hong Kong Stocks See Relief Gains; Dollar Slips: Markets Wrap", "keywords": ["hong", "kong", "rose", "markets", "wrap", "slips", "bloomberg", "dollar", "relief", "05", "tokyo", "seng", "gains", "yield", "kongs", "stocks", "index"], "publish_date": "2020-06-01", "url": "https://finance.yahoo.com/news/yen-edges-amid-u-protests-211230794.html", "summary": "(Bloomberg) -- Stocks in Asia advance, with Hong Kong outperforming after U.S. President Donald Trump on Friday stopped short of specifying tough sanctions over China’s new national security law for Hong Kong.\nHong Kong’s Hang Seng Index gained over 3%, while Tokyo, Seoul, Sydney and Shanghai saw more modest moves.\nThe U.S. president also promised sanctions against Chinese and Hong Kong officials “directly or indirectly involved” in eroding Hong Kong’s autonomy but didn’t identify individuals.\n“The impact is likely to be limited and more symbolic while the financial sector is unlikely to be affected,” Sean Darby, Jefferies’ global equity strategist in Hong Kong, wrote in a research note.\nCommoditiesWest Texas Intermediate crude fell 0.5% to $35.34 a barrel.Gold rose 0.5% to $1,738.52.", "text": "(Bloomberg) -- Stocks in Asia advance, with Hong Kong outperforming after U.S. President Donald Trump on Friday stopped short of specifying tough sanctions over China’s new national security law for Hong Kong. The dollar retreated. Hong Kong’s Hang Seng Index gained over 3%, while Tokyo, Seoul, Sydney and Shanghai saw more modest moves. U.S. stock futures pared earlier declines as investors weighed the violent protests in some American cities that have stoked concerns about a reacceleration in infection rates and a damper on the economic recovery. Crude oil ticked lower."}, "News 3": {"title": "Dow Jones Futures: Tesla Leads 5 Stocks Looking To Break Out Decisively In Coronavirus Market Rally", "keywords": ["futures", "rally", "leads", "dow", "decisively", "buy", "stock", "market", "jones", "coronavirus", "looking", "week", "tesla", "stocks"], "publish_date": "2020-06-01", "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-coronavirus-stock-market-rally-tesla-microsoft-apple/?src=A00220&yptr=yahoo", "summary": "Join IBD experts as they analyze actionable stocks in the coronavirus stock market rally on IBD Live.\nDow Jones Futures TodayDow Jones futures rose 0.4% vs. fair value, erasing solid losses.\nWhile Dow Jones futures haven't been as volatile as during the market crash, they are still prone to big moves during the coronavirus stock market rally.\nCoronavirus Stock Market RallyThe coronavirus stock market rally had some big swings, with growth stocks plunging from a Tuesday peak to Wednesday morning, then rebounding strongly.\nGame Plan The Stock Market RallyDuring last week's volatile action in the coronavirus stock market rally, there was a strong argument for buying, selling or holding.", "text": "Dow Jones futures turned slightly higher Sunday night, along with S&P 500 futures and Nasdaq futures, following a weekend of unrest in cities in across the country. The coronavirus stock market rally had some wild intraday swings last week, but ultimately finished with solid gains. The Dow Jones and S&P 500 index led, but the Nasdaq reasserted leadership on Friday. The wild action showed the importance of having a market rally game plan ahead of time. X  Meanwhile, Tesla (TSLA), Microsoft (MSFT), UnitedHealth (UNH) as well as Apple (AAPL) and Domino's Pizza (DPZ), are all in the \"friend zone.\""}, "News 4": {"title": "Global Markets: Asia stocks reach three-month peaks, resilient to U.S. riots", "keywords": ["threemonth", "futures", "having", "following", "reach", "markets", "peaks", "unemployment", "global", "asia", "added", "trade", "china", "riots", "resilient", "stocks", "yields"], "publish_date": "2020-06-01", "url": "https://finance.yahoo.com/news/global-markets-asia-cautious-u-014201606.html", "summary": "After a cautious start Asian markets were led higher by China on signs parts of the domestic economy were picking up.\nJapan's Nikkei <.N225> added 1.1% to also reach a three-month peak.\nE-Mini futures for the S&P 500 <ESc1> recovered to be up 0.1%, having been down 1% in early trade.\nIn commodity markets, gold added 0.6% to $1,1737 an ounce.\nBrent crude futures were off 7 cents at $37.77 a barrel, while U.S. crude was flat at $35.49.", "text": "FILE PHOTO: A man wearing a protective face mask, following the coronavirus disease (COVID-19) outbreak, walks in front of a stock quotation board outside a brokerage in Tokyo  By Wayne Cole  SYDNEY (Reuters) - Asian shares pushed to three-month highs on Monday as progress on opening up economies helped offset jitters over riots in U.S. cities and unease over Washington's power struggle with Beijing. There was also relief that while President Donald Trump began the process of ending special U.S. treatment for Hong Kong to punish China, he left their trade deal intact. \"With specific and verifiable measures against China appearing to be weak, markets may draw hollow consolation that the U.S. is treading carefully,\" said analysts at Mizuho in a note. After a cautious start Asian markets were led higher by China on signs parts of the domestic economy were picking up. Hong Kong <.HSI> managed to rally 3.6%, while Chinese blue chips <.CSI300> put on 2.2%."}, "News 5": {"title": "Asia stocks reach 3-month peaks, resilient to U.S. riots", "keywords": ["futures", "threemonth", "3month", "having", "following", "reach", "markets", "peaks", "unemployment", "added", "asia", "trade", "china", "riots", "resilient", "stocks", "yields"], "publish_date": "2020-06-01", "url": "https://finance.yahoo.com/news/asia-cautious-u-riots-weigh-002451589.html", "summary": "After a cautious start Asian markets were led higher by China on signs parts of the domestic economy were picking up.\nThat helped lift MSCI's broadest index of Asia-Pacific shares outside Japan <.MIAPJ0000PUS> 2.1% to its highest since early March.\nJapan's Nikkei <.N225> added 1.1% to also reach a three-month peak.\nE-Mini futures for the S&P 500 recovered to be up 0.1%, having been down 1% in early trade.\nBrent crude futures were off 7 cents at $37.77 a barrel, while U.S. crude was flat at $35.49.", "text": "A passerby wearing a protective face mask, following an outbreak of the coronavirus, walks past an electronic board showing the graphs of the recent movements of Japan's Nikkei share average outside a brokerage in Tokyo  By Wayne Cole  SYDNEY (Reuters) - Asian shares pushed to three-month highs on Monday as progress on opening up economies helped offset jitters over riots in U.S. cities and unease over Washington's power struggle with Beijing. There was also relief that while President Donald Trump began the process of ending special U.S. treatment for Hong Kong to punish China, he left their trade deal intact. \"With specific and verifiable measures against China appearing to be weak, markets may draw hollow consolation that the U.S. is treading carefully,\" said analysts at Mizuho in a note. After a cautious start Asian markets were led higher by China on signs parts of the domestic economy were picking up. Hong Kong <.HSI> managed to rally 3.6%, while Chinese blue chips <.CSI300> put on 2.2%."}, "no_of_news": 5, "plot_name": "/content/indices_plots/^GSPC.png"}}}, "Plots": {"US": {"Zscaler, Inc.": {"open": "66.97,66.23,66.61,70.0,71.84,73.5,75.15,73.99,77.5,76.95,73.72,75.48,77.87,75.0,76.83,77.63,76.67,79.0,76.86,74.7,87.08", "close": "67.08,66.85,69.08,71.23,72.54,74.88,74.02,76.96,76.45,75.16,75.62,76.39,73.81,75.24,77.06,75.63,76.94,76.52,74.53,75.8,98.09", "high": "69.0,67.75,69.1,71.67,73.1,75.15,75.55,77.5,78.76,78.19,75.89,78.31,77.87,76.01,77.78,77.65,77.14,80.0,76.91,77.05,98.38", "low": "66.27,65.51,66.0,69.66,70.3,73.11,73.0,73.66,75.72,73.26,73.21,75.48,73.5,74.26,75.96,74.16,75.1,76.3,69.83,73.79,85.5", "date": "2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-26 ,2020-05-27 ,2020-05-28 ,2020-05-29 ", "volume": "1826600,1794000,2026200,2501300,3089400,2773400,2091400,2408900,2006800,2089200,2596200,1856000,2361900,1644500,1517600,1638600,1330600,2485100,3720100,4293200,22768800"}, "Canopy Growth Corporation": {"open": "16.81,15.65,16.26,16.0,15.87,15.43,15.57,15.23,14.96,14.78,13.2,14.34,16.51,16.5,17.65,17.0,18.38,20.6,20.08,20.05,17.0", "close": "16.0,15.26,15.74,15.76,15.36,15.44,15.34,14.97,14.77,13.56,13.86,15.86,16.32,17.3,16.93,18.25,19.42,20.01,19.9,21.72,17.37", "high": "16.93,15.77,16.26,16.28,15.92,15.83,15.6,15.33,15.65,14.78,14.02,15.99,16.95,17.54,17.92,18.5,19.48,20.92,20.35,22.19,18.39", "low": "15.82,14.78,15.32,15.66,15.28,15.24,15.15,14.72,14.62,13.36,12.95,13.92,15.76,15.82,16.53,16.67,17.6,19.85,18.51,19.84,16.95", "date": "2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-26 ,2020-05-27 ,2020-05-28 ,2020-05-29 ", "volume": "5323900,6020300,8251200,4467900,2840400,3298000,3802800,4469800,7411100,8228200,4534000,11927200,9387900,9460800,6862800,10600700,14024500,12920400,10233800,15080200,25271600"}, "BridgeBio Pharma, Inc.": {"open": "30.79,29.93,29.24,30.76,30.82,32.75,33.85,33.31,33.36,32.55,29.67,30.76,33.01,35.2,34.7,35.09,34.86,35.02,35.83,36.42,31.34", "close": "30.53,28.97,29.99,30.85,32.27,33.08,34.04,32.98,32.83,30.78,30.6,32.19,34.82,34.5,34.9,34.73,35.0,35.32,35.69,35.11,29.33", "high": "32.0,30.35,30.26,31.58,32.66,34.31,34.37,34.19,34.92,32.9,30.93,32.49,35.05,35.93,35.17,35.73,35.29,36.55,36.06,36.5,32.46", "low": "30.51,28.6,28.37,30.09,30.6,32.22,33.16,32.11,32.39,29.56,29.09,29.7,33.01,34.5,33.77,33.66,34.33,34.5,34.0,34.92,28.87", "date": "2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-26 ,2020-05-27 ,2020-05-28 ,2020-05-29 ", "volume": "775200,473500,299500,842300,297900,590000,279500,447700,386700,465500,403800,419400,472100,357000,948400,390000,222800,561900,419100,523800,2446400"}, "DXC Technology Company": {"open": "18.2,17.18,16.5,17.44,16.74,16.74,17.74,17.08,16.83,15.39,14.21,14.8,16.64,16.51,16.51,16.84,15.95,16.59,17.23,17.6,14.95", "close": "18.13,16.79,16.59,16.53,16.21,17.33,17.65,16.7,15.82,14.66,15.15,15.28,16.73,16.16,16.98,15.85,15.48,16.36,17.68,16.57,14.21", "high": "18.56,17.41,16.83,17.68,17.05,17.7,17.91,17.24,17.11,15.42,15.22,15.36,17.17,16.73,17.23,16.93,15.98,16.67,17.73,17.65,15.35", "low": "17.59,16.31,15.88,16.48,16.09,16.69,17.19,16.35,15.81,14.39,13.65,14.52,16.51,15.78,16.48,15.81,15.06,16.2,16.31,16.33,14.0", "date": "2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-26 ,2020-05-27 ,2020-05-28 ,2020-05-29 ", "volume": "3122700,2313600,1995600,2342200,2941500,6119000,2240800,2832100,2650200,4283600,3024800,5436200,4446900,2477300,4629700,2842400,5049200,5131200,5838000,6427700,29822000"}, "General Electric Company": {"open": "6.56,6.67,6.3,6.28,6.2,6.06,6.21,6.24,6.22,6.0,5.62,5.61,5.74,6.29,6.33,6.42,6.48,6.79,7.25,7.49,6.56", "close": "6.8,6.5,6.21,6.2,5.98,6.11,6.29,6.19,6.0,5.79,5.7,5.49,6.27,6.21,6.42,6.48,6.41,6.8,7.29,6.78,6.57", "high": "6.82,6.74,6.31,6.46,6.25,6.26,6.33,6.25,6.28,6.02,5.9,5.66,6.49,6.37,6.47,6.55,6.48,6.94,7.43,7.49,6.72", "low": "6.41,6.41,6.15,6.16,5.97,6.06,6.16,6.13,6.0,5.48,5.48,5.48,5.74,6.09,6.29,6.33,6.27,6.79,7.09,6.74,6.44", "date": "2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-26 ,2020-05-27 ,2020-05-28 ,2020-05-29 ", "volume": "175438800,120376500,136852400,116998500,117253600,100663300,93934600,71843000,95652200,235745300,140205400,128486200,255278700,108485100,91287400,98821100,69586200,129510700,147750900,138714800,129300100"}, "Annaly Capital Management, Inc.": {"open": "6.73,6.06,6.02,6.29,6.3,6.15,6.18,6.11,6.07,5.78,5.51,5.83,6.07,6.2,6.25,6.4,6.36,6.41,6.6,6.57,6.25", "close": "6.25,6.13,6.12,6.28,6.04,6.09,6.21,6.03,5.8,5.65,5.93,5.81,6.2,6.23,6.43,6.34,6.34,6.43,6.55,6.34,6.16", "high": "6.75,6.39,6.21,6.45,6.39,6.28,6.24,6.19,6.09,5.8,5.94,5.97,6.28,6.42,6.49,6.46,6.37,6.55,6.6,6.58,6.39", "low": "6.18,6.03,5.95,6.23,6.03,6.06,6.12,6.03,5.8,5.48,5.49,5.79,5.99,6.15,6.22,6.2,6.17,6.4,6.27,6.3,6.15", "date": "2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-26 ,2020-05-27 ,2020-05-28 ,2020-05-29 ", "volume": "23068300,16048500,15855900,14207700,12544200,15583500,11523000,14791500,17890900,22607700,18693900,19186500,27130400,16618300,21779000,15997300,14856300,23791000,23932700,25555900,125369200"}, "Bank of America Corporation": {"open": "24.21,23.38,22.7,23.48,23.0,22.66,23.47,23.11,22.71,21.66,20.29,21.4,22.42,22.66,22.68,22.81,22.93,23.75,26.07,26.08,24.42", "close": "24.05,23.08,22.93,22.66,22.35,22.84,23.57,22.58,21.87,20.87,21.71,21.44,22.93,22.21,22.91,22.9,22.66,24.28,25.98,24.86,24.12", "high": "24.38,23.46,22.99,23.52,23.08,23.37,23.62,23.12,22.82,21.75,21.79,21.7,23.06,23.0,23.0,23.27,22.95,24.6,26.17,26.14,24.91", "low": "23.85,22.81,22.43,22.62,22.23,22.61,23.25,22.56,21.85,20.72,20.1,21.23,22.07,22.19,22.64,22.78,22.46,23.7,24.97,24.79,24.06", "date": "2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-26 ,2020-05-27 ,2020-05-28 ,2020-05-29 ", "volume": "55132400,51772600,45886100,45691900,53874600,51884300,45250000,68951800,69588700,112113400,88359100,64484000,86699200,62179000,59789500,57726000,48107000,119485500,117672700,84340800,113811100"}, "Marathon Oil Corporation": {"open": "6.31,5.89,5.34,6.2,5.61,5.62,5.6,5.7,5.83,5.9,5.43,5.62,5.94,6.03,5.92,6.0,5.88,6.07,6.12,6.11,5.64", "close": "6.12,5.5,5.81,5.53,5.6,5.51,5.78,5.75,5.96,5.56,5.64,5.61,6.08,5.82,5.95,5.94,5.89,6.03,6.15,5.7,5.34", "high": "6.34,6.03,5.81,6.25,5.79,5.81,5.79,5.84,6.23,5.93,5.79,5.78,6.2,6.05,6.07,6.11,5.93,6.12,6.15,6.11,5.65", "low": "5.75,5.46,5.24,5.5,5.45,5.35,5.52,5.61,5.81,5.36,5.2,5.57,5.89,5.79,5.88,5.86,5.75,5.93,5.86,5.7,5.31", "date": "2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-26 ,2020-05-27 ,2020-05-28 ,2020-05-29 ", "volume": "76883100,37538000,31074200,51969900,30066000,41313100,33772200,29104500,46900300,67595800,33303700,35936000,45410800,34827500,36032500,30115800,19179900,28896700,35656300,46655700,107519800"}}, "NSE": {"JSW Steel Ltd.": {"open": "170.95,167.5,165.5,164.2,175.55,170.0,172.0,189.0,179.0,176.9,175.8,167.0,169.3,172.0,168.4,168.0,176.05,186.2,181.0,188.0", "close": "163.55,163.9,165.8,172.2,168.65,174.55,178.2,182.35,175.2,174.3,163.25,169.3,171.05,169.9,166.15,176.25,184.8,184.15,184.2,196.5", "high": "170.95,171.65,169.3,174.0,176.6,176.4,179.6,189.0,180.4,179.4,176.2,172.95,173.0,174.85,169.5,178.25,189.0,188.75,185.45,199.4", "low": "162.35,162.8,163.15,162.5,167.5,168.75,167.05,180.6,174.2,173.25,162.1,165.9,168.3,168.95,163.5,168.0,174.15,183.2,180.05,187.15", "date": "2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-26 ,2020-05-27 ,2020-05-28 ,2020-05-29 ,2020-06-01 ", "volume": "10645228,12993334,8720744,11944057,9042793,9199262,11889650,10377119,5808569,11546095,8130435,11001050,10091663,11064338,10227598,30382764,20403214,14269347,13458180,6582313"}, "Tata Steel Ltd.": {"open": "285.0,279.0,274.1,275.45,282.8,275.55,273.3,287.5,272.0,270.0,274.1,271.95,272.0,283.9,279.0,277.5,282.2,291.9,292.1,302.0", "close": "273.6,272.65,277.75,275.85,272.9,276.2,273.95,276.55,268.55,273.45,266.6,272.0,283.2,283.7,274.45,280.45,287.95,295.5,295.2,314.4", "high": "286.15,282.4,280.45,282.85,284.0,283.0,276.8,288.0,275.2,276.8,276.2,280.4,284.0,286.25,280.25,284.4,290.4,298.6,296.9,316.2", "low": "270.1,271.0,272.05,274.65,272.0,275.0,264.5,273.5,267.3,268.8,262.45,267.5,270.1,278.5,273.3,277.0,279.05,289.4,287.85,302.0", "date": "2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-26 ,2020-05-27 ,2020-05-28 ,2020-05-29 ,2020-06-01 ", "volume": "12891459,12182330,9507731,8958376,9877755,10907408,15040297,14723116,10796902,14989665,11615367,16897094,14421812,13035811,10656739,12107559,14007462,16601958,13127985,9178899"}, "Housing Development Finance Corporation Ltd.": {"open": "1856.0,1745.0,1709.0,1730.0,1737.0,1712.5,1630.0,1747.0,1685.0,1649.0,1633.5,1570.0,1550.0,1632.9,1582.0,1516.0,1513.0,1580.0,1615.9,1706.6", "close": "1724.35,1689.9,1732.15,1703.9,1689.7,1658.45,1674.1,1712.75,1632.4,1633.8,1512.05,1539.85,1627.0,1597.3,1516.15,1502.15,1570.4,1623.7,1658.9,1723.05", "high": "1856.0,1769.5,1777.55,1745.95,1742.0,1722.0,1682.8,1749.5,1693.0,1657.75,1637.65,1591.75,1640.0,1651.8,1596.7,1568.15,1578.0,1643.8,1676.35,1731.0", "low": "1708.3,1678.0,1680.0,1697.65,1685.0,1652.1,1587.1,1698.0,1628.1,1609.0,1506.4,1512.0,1545.0,1590.0,1501.5,1486.0,1490.0,1577.0,1590.9,1701.3", "date": "2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-26 ,2020-05-27 ,2020-05-28 ,2020-05-29 ,2020-06-01 ", "volume": "6039982,7807170,8781387,3349383,4420826,4677440,7018913,5734243,5424645,5609955,8460057,9261075,6847040,7056039,12034379,12752483,12428419,10261919,13809094,1723233"}, "Dr. Reddys Laboratories Ltd.": {"open": "3850.0,3980.0,3851.0,3908.9,3900.1,3977.8,3863.2,3849.0,3790.0,3746.0,3760.15,3700.15,3720.9,3950.0,3840.6,3899.0,3864.75,3895.0,3880.0,4077.6", "close": "3939.0,3833.9,3852.5,3837.65,3984.0,3862.0,3773.4,3779.6,3732.0,3735.1,3679.15,3699.6,3910.2,3847.5,3892.85,3864.3,3883.0,3887.75,4071.25,4010.0", "high": "4006.0,3986.35,3880.0,3936.55,4132.2,3977.8,3909.6,3849.0,3819.95,3778.9,3762.55,3722.0,3930.0,3954.15,3910.0,3939.0,3900.0,3910.8,4090.7,4092.35", "low": "3848.2,3806.0,3805.05,3818.55,3900.1,3848.05,3759.15,3735.1,3718.6,3717.05,3613.85,3660.1,3693.15,3825.5,3811.0,3853.45,3814.0,3842.5,3869.3,4003.45", "date": "2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-26 ,2020-05-27 ,2020-05-28 ,2020-05-29 ,2020-06-01 ", "volume": "1415487,795726,955903,916267,2003458,1194988,1078497,878435,897141,899387,990876,935404,4216709,1734424,1010510,827376,861668,792562,1926224,354480"}}, "FOREX": {"EUR/USD": {"open": "1.0945,1.0957,1.0905,1.084,1.0801,1.0837,1.084,1.0809,1.0846,1.0822,1.0806,1.0819,1.0916,1.093,1.0979,1.0952,1.0909,1.0901,1.0981,1.1015,1.1078,1.1135", "close": "1.0945,1.0959999999999999,1.0904,1.0839,1.0799,1.0837,1.084,1.0809,1.0847,1.0824,1.0807,1.0821,1.0915,1.0928,1.0983,1.0953,1.0908,1.0903,1.0982,1.1017,1.1079,1.1138", "high": "1.1016,1.0958,1.0921,1.0845,1.0816,1.0873,1.0853,1.088,1.0893,1.0825,1.085,1.0913,1.0975,1.0999,1.1009,1.0955,1.0915,1.0992,1.103,1.1072,1.1145,1.1145", "low": "1.0935,1.0901,1.0827,1.0784,1.0768,1.0816,1.0804,1.0785,1.0831,1.0777,1.0791,1.0801,1.0903,1.0929,1.0939,1.0886,1.0872,1.0898,1.0937,1.0993,1.107,1.1107", "date": "2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-25 ,2020-05-26 ,2020-05-27 ,2020-05-28 ,2020-05-29 ,2020-06-01 "}, "USD/JPY": {"open": "107.305,106.751,106.68299999999999,106.431,106.21,106.39,106.905,107.588,107.163,106.914,107.361,107.229,107.37700000000001,107.819,107.59899999999999,107.634,107.74,107.69,107.48899999999999,107.803,107.626,107.78299999999999", "close": "107.285,106.738,106.697,106.45200000000001,106.191,106.359,106.919,107.566,107.13799999999999,106.93299999999999,107.365,107.208,107.381,107.81,107.59100000000001,107.631,107.735,107.68700000000001,107.491,107.79799999999999,107.64299999999999,107.58", "high": "107.399,107.055,106.889,106.431,106.646,106.72,107.728,107.67299999999999,107.251,107.164,107.432,107.495,108.074,107.975,107.84700000000001,107.76,107.772,107.916,107.932,107.896,107.81200000000001,107.85700000000001", "low": "106.61,106.67200000000001,106.484,106.024,106.139,106.23299999999999,106.775,107.21600000000001,106.762,106.785,106.876,107.06700000000001,107.305,107.346,107.575,107.334,107.63,107.40299999999999,107.37200000000001,107.579,107.09,107.57", "date": "2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-25 ,2020-05-26 ,2020-05-27 ,2020-05-28 ,2020-05-29 ,2020-06-01 "}, "GBP/USD": {"open": "1.2581,1.2457,1.2448,1.2445,1.2327,1.2374,1.2416,1.2332,1.2254,1.2239,1.2234,1.2086,1.2203,1.2259,1.2235,1.2226,1.2187,1.22,1.2335,1.2263,1.232,1.2352", "close": "1.2581,1.2454,1.2446,1.2444,1.2326,1.2376,1.2417,1.2333,1.2255,1.2242,1.2234,1.2086,1.22,1.2256,1.2237,1.2223,1.2186,1.2201,1.2335,1.2265,1.2321,1.2387", "high": "1.2581,1.2469,1.248,1.245,1.2415,1.2464,1.2438,1.2376,1.2337,1.2241,1.2238,1.2224,1.2269,1.2287,1.2249,1.2235,1.2204,1.2363,1.2349,1.2335,1.2392,1.2413", "low": "1.2504,1.2406,1.2422,1.2338,1.227,1.2358,1.2286,1.2289,1.2222,1.2169,1.2116,1.2086,1.2185,1.2223,1.2187,1.2163,1.2165,1.2199,1.2209,1.2235,1.2293,1.2327", "date": "2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-25 ,2020-05-26 ,2020-05-27 ,2020-05-28 ,2020-05-29 ,2020-06-01 "}}, "INDICES": {"Dow Jones Industrial Average": {"open": "24585.57,24120.78,23581.55,23958.88,23978.88,23837.21,24107.82,24256.45,24292.84,23702.16,23049.06,23454.83,24059.98,24577.48,24455.94,24564.27,24461.98,24781.84,25298.63,25697.36,25324.15", "close": "24345.72,23723.69,23749.76,23883.09,23664.64,23875.89,24331.32,24221.99,23764.78,23247.97,23625.34,23685.42,24597.37,24206.86,24575.9,24474.12,24465.16,24995.11,25548.27,25400.64,25383.11", "high": "24585.57,24120.78,23769.56,24169.72,24054.59,24094.62,24349.9,24366.21,24382.09,23708.9,23630.86,23730.08,24708.54,24599.5,24649.48,24718.46,24481.64,25176.42,25551.56,25758.79,25482.8", "low": "24186.9,23645.3,23361.16,23868.91,23661.14,23834.39,24107.05,24070.22,23761.58,23067.64,22789.62,23354.15,24059.98,24202.96,24455.94,24370.88,24294.07,24781.84,25009.87,25358.73,25031.67", "date": "2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-26 ,2020-05-27 ,2020-05-28 ,2020-05-29 ", "volume": "478280000,418160000,355360000,369710000,377450000,369890000,335760000,352400000,359480000,469950000,472700000,491510000,484190000,374100000,366510000,346770000,255660000,424380000,411230000,377800000,527620000"}, "S&P BSE SENSEX": {"open": "32748.14,32182.9,31577.63,31677.69,32083.32,32030.34,31342.93,32841.87,31466.33,31296.28,31248.26,30450.74,30159.59,30904.29,30822.78,30864.27,30793.11,31827.8,32041.29,32906.05", "close": "31715.35,31453.51,31685.75,31443.38,31642.7,31561.22,31371.12,32008.61,31122.89,31097.73,30028.98,30196.17,30818.61,30932.9,30672.59,30609.3,31605.22,32200.59,32424.1,33321.59", "high": "32748.14,32264.0,31970.84,31705.25,32088.51,32301.58,31536.89,32845.48,31630.94,31296.28,31248.26,30739.96,30878.31,31188.79,31107.91,31086.7,31660.6,32267.23,32480.52,33376.32", "low": "31632.02,31403.57,31158.75,31362.87,31598.0,31500.87,30844.66,31901.92,31052.65,30770.48,29968.45,30116.82,30157.75,30765.32,30474.88,30512.14,30525.68,31641.77,31823.8,32876.55", "date": "2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-26 ,2020-05-27 ,2020-05-28 ,2020-05-29 ,2020-06-01 ", "volume": "18300,19200,19200,19900,15900,18100,23100,18400,15200,13000,19500,18700,16100,15500,20600,188300,20500,27500,37100,0"}, "S&P 500": {"open": "2930.91,2869.09,2815.01,2868.88,2883.14,2878.26,2908.83,2915.46,2939.5,2865.86,2794.54,2829.95,2913.86,2948.59,2953.63,2969.95,2948.05,3004.08,3015.65,3046.61,3025.17", "close": "2912.43,2830.71,2842.74,2868.44,2848.42,2881.19,2929.8,2930.19,2870.12,2820.0,2852.5,2863.7,2953.91,2922.94,2971.61,2948.51,2955.45,2991.77,3036.13,3029.73,3044.31", "high": "2930.91,2869.09,2844.24,2898.23,2891.11,2901.92,2932.16,2944.25,2945.82,2874.14,2852.8,2865.01,2968.09,2964.21,2980.29,2978.5,2956.76,3021.72,3036.25,3068.67,3049.17", "low": "2892.47,2821.61,2797.85,2863.55,2847.65,2876.48,2902.88,2903.44,2869.59,2793.15,2766.64,2816.78,2913.86,2922.35,2953.63,2938.57,2933.59,2988.17,2969.75,3023.4,2998.61", "date": "2020-04-30 ,2020-05-01 ,2020-05-04 ,2020-05-05 ,2020-05-06 ,2020-05-07 ,2020-05-08 ,2020-05-11 ,2020-05-12 ,2020-05-13 ,2020-05-14 ,2020-05-15 ,2020-05-18 ,2020-05-19 ,2020-05-20 ,2020-05-21 ,2020-05-22 ,2020-05-26 ,2020-05-27 ,2020-05-28 ,2020-05-29 ", "volume": "6523120000,4753160000,4723140000,5129590000,4861920000,5164640000,4857160000,4807320000,5107710000,6143130000,5641920000,5477040000,6364290000,4969330000,4992970000,4966940000,3952800000,5837060000,6371230000,5402670000,7275080000"}}}}